{"agent": {"2405.10255": "|**2024-05-16**|**When LLMs step into the 3D World: A Survey and Meta-Analysis of 3D Tasks via Multi-modal Large Language Models**|Xianzheng Ma et.al.|[2405.10255](http://arxiv.org/abs/2405.10255)|**[link](https://github.com/activevisionlab/awesome-llm-3d)**|\n", "2411.03817": "|**2024-11-06**|**From Novice to Expert: LLM Agent Policy Optimization via Step-wise Reinforcement Learning**|Zhirui Deng et.al.|[2411.03817](http://arxiv.org/abs/2411.03817)|null|\n", "2411.03519": "|**2024-11-05**|**AI Metropolis: Scaling Large Language Model-based Multi-Agent Simulation with Out-of-order Execution**|Zhiqiang Xie et.al.|[2411.03519](http://arxiv.org/abs/2411.03519)|null|\n", "2411.03284": "|**2024-11-05**|**SMoA: Improving Multi-agent Large Language Models with Sparse Mixture-of-Agents**|Dawei Li et.al.|[2411.03284](http://arxiv.org/abs/2411.03284)|**[link](https://github.com/david-li0406/smoa)**|\n", "2411.03252": "|**2024-11-05**|**Spontaneous Emergence of Agent Individuality through Social Interactions in LLM-Based Communities**|Ryosuke Takata et.al.|[2411.03252](http://arxiv.org/abs/2411.03252)|null|\n", "2411.02305": "|**2024-11-04**|**CRMArena: Understanding the Capacity of LLM Agents to Perform Professional CRM Tasks in Realistic Environments**|Kung-Hsiang Huang et.al.|[2411.02305](http://arxiv.org/abs/2411.02305)|**[link](https://github.com/salesforceairesearch/crmarena)**|\n", "2411.01747": "|**2024-11-04**|**DynaSaur: Large Language Agents Beyond Predefined Actions**|Dang Nguyen et.al.|[2411.01747](http://arxiv.org/abs/2411.01747)|null|\n", "2411.01643": "|**2024-11-03**|**EcoAct: Economic Agent Determines When to Register What Action**|Shaokun Zhang et.al.|[2411.01643](http://arxiv.org/abs/2411.01643)|null|\n", "2411.03346": "|**2024-11-03**|**Fixing Security Vulnerabilities with AI in OSS-Fuzz**|Yuntong Zhang et.al.|[2411.03346](http://arxiv.org/abs/2411.03346)|null|\n", "2411.01236": "|**2024-11-02**|**AutoPT: How Far Are We from the End2End Automated Web Penetration Testing?**|Benlong Wu et.al.|[2411.01236](http://arxiv.org/abs/2411.01236)|**[link](https://github.com/Dizzy-K/AutoPT)**|\n", "2411.01143": "|**2024-11-02**|**A Large-scale Time-aware Agents Simulation for Influencer Selection in Digital Advertising Campaigns**|Xiaoqing Zhang et.al.|[2411.01143](http://arxiv.org/abs/2411.01143)|null|\n", "2411.04329": "|**2024-11-12**|**CodeTree: Agent-guided Tree Search for Code Generation with Large Language Models**|Jierui Li et.al.|[2411.04329](http://arxiv.org/abs/2411.04329)|null|\n", "2411.05651": "|**2024-11-08**|**LightVA: Lightweight Visual Analytics with LLM Agent-Based Task Planning and Execution**|Yuheng Zhao et.al.|[2411.05651](http://arxiv.org/abs/2411.05651)|null|视觉分析（VA）要求分析师基于观察反复提出分析任务，并通过创建可视化和交互式探索来执行任务以获得洞察。这一过程需要编程、数据处理和可视化工具的技能，突显了对更智能、更简洁的VA方法的需求。最近开发的大规模语言模型（LLM）作为能够处理各种任务并具备动态规划和工具使用能力的代理，为提高VA的效率和多功能性提供了潜力。我们提出了LightVA，这是一种轻量级的VA框架，支持通过人机协作进行任务分解、数据分析和交互式探索。我们的方法旨在帮助用户逐步将高层次的分析目标转化为低层次的任务，生成可视化并得出见解。具体来说，我们引入了一种基于LLM代理的任务规划与执行策略，采用了一个涉及规划者、执行者和控制器的递归过程。规划者负责推荐和分解任务，执行者处理包括数据分析、可视化生成和多视图组合在内的任务执行，而控制器则协调规划者与执行者之间的互动。在此框架基础上，我们开发了一个具有混合用户界面的系统，该界面包含用于监控和管理任务规划过程的任务流程图、用于交互式数据探索的可视化面板以及用于通过自然语言指令指导模型的聊天视图。我们通过一个使用场景和一项专家研究来检验我们方法的有效性。|\n", "2411.05349": "|**2024-11-08**|**Enhancing Cluster Resilience: LLM-agent Based Autonomous Intelligent Cluster Diagnosis System and Evaluation Framework**|Honghao Shi et.al.|[2411.05349](http://arxiv.org/abs/2411.05349)|null|最近在大型语言模型（LLM）及相关技术如检索增强生成（RAG）和思维图谱（DoT）方面的进展，使得能够创建出可以自主进行集群诊断和故障排除的智能系统。通过将这些技术与自我对弈方法相结合，我们开发了一个旨在自主诊断并解决AI集群问题的LLM代理系统。我们的创新包括一个专为集群诊断定制的知识库、改进的LLM算法、代理部署的实际策略，以及专门为评估该领域内LLM能力设计的基准测试。通过多维度的广泛实验，我们展示了我们的系统在应对集群诊断挑战方面，特别是在检测和纠正性能问题上，比传统方法更高效且准确。|\n", "2411.05209": "|**2024-11-07**|**Alopex: A Computational Framework for Enabling On-Device Function Calls with LLMs**|Yide Ran et.al.|[2411.05209](http://arxiv.org/abs/2411.05209)|null|大型语言模型（LLM）的快速发展使其越来越多地被集成到移动设备中，以提供个性化的辅助服务。这使得LLM能够调用外部API函数来增强其性能。然而，数据稀缺、问题格式不恰当以及灾难性遗忘等问题阻碍了设备上LLM代理的发展。为了解决这些问题，我们提出了Alopex框架，该框架使用Fox LLM实现精确的设备上函数调用。Alopex引入了一种基于逻辑的方法来生成高质量的训练数据，并采用了一种新的“描述-问题-输出”格式进行微调，减少了函数信息泄露的风险。此外，还使用了一种数据混合策略来减轻灾难性遗忘，通过将函数调用数据与教材数据集结合，以提高在各种任务中的表现。实验结果显示，Alopex提高了函数调用的准确性，并显著减少了灾难性遗忘，为无需人工干预即可将函数调用能力集成到LLM中提供了一个强大的解决方案。|\n", "2411.05185": "|**2024-11-07**|**PentestAgent: Incorporating LLM Agents to Automated Penetration Testing**|Xiangmin Shen et.al.|[2411.05185](http://arxiv.org/abs/2411.05185)|null|渗透测试是识别安全漏洞的关键技术，传统上由熟练的安全专家手动执行。这个复杂的过程包括收集目标系统的信息、识别入口点、利用系统和报告发现结果。尽管这种方法非常有效，但手动渗透测试耗时且成本高昂，通常需要许多组织无法负担的大量专业知识和资源。虽然已经提出了自动化的渗透测试方法，但由于灵活性、适应性和实施方面的限制，这些方法在实际应用中往往表现不佳。最近，在大型语言模型（LLM）方面的进步为通过增强智能化和自动化来改进渗透测试提供了新的机会。然而，当前基于LLM的方法仍然面临重大挑战，包括有限的渗透测试知识和缺乏全面的自动化能力。为了解决这些不足，我们提出了PentestAgent，这是一个新颖的基于LLM的自动化渗透测试框架，它利用LLM的力量以及诸如检索增强生成（RAG）等各种基于LLM的技术来增强渗透测试知识并自动化各种任务。我们的框架通过多代理协作来自动化情报收集、漏洞分析和利用阶段，减少了人工干预。我们使用一个全面的基准对PentestAgent进行了评估，展示了其在任务完成和整体效率上的卓越表现。这项工作显著推进了自动化渗透测试系统的实际应用性。|\n", "2411.07228": "|**2024-11-11**|**Tooling or Not Tooling? The Impact of Tools on Language Agents for Chemistry Problem Solving**|Botao Yu et.al.|[2411.07228](http://arxiv.org/abs/2411.07228)|null|为了增强大型语言模型（LLM）解决化学问题的能力，已经提出了几种基于LLM的代理工具，如ChemCrow和Coscientist。然而，它们的评估范围狭窄，导致对工具在多样化化学任务中的益处理解不足。为了解决这个问题，我们开发了ChemAgent，这是对ChemCrow的一种改进型化学代理，并对其在专业化学任务和一般化学问题上的表现进行了全面评估。令人惊讶的是，ChemAgent并不总是在所有情况下都优于没有工具的基本LLM。通过与化学专家进行错误分析表明：对于合成预测等专业化学任务，我们应该用专门工具来增强代理；但对于考试中的一般化学问题，代理正确运用化学知识进行推理的能力更为重要，工具增强并不总是有帮助。|\n", "2411.06490": "|**2024-11-10**|**Hermes: A Large Language Model Framework on the Journey to Autonomous Networks**|Fadhel Ayed et.al.|[2411.06490](http://arxiv.org/abs/2411.06490)|null|随着蜂窝网络系统复杂性的增加，自动化蜂窝网络操作的趋势日益增长。尽管有所进步，但由于建模网络行为和定义策略以满足目标需求仍然依赖于人工干预，因此目前完全自主性仍无法实现。网络数字孪生（NDT）在增强网络智能方面显示出潜力，但该技术的成功实施受到特定用例架构的限制，这限制了其在网络自主性进展中的作用。需要一个更强大的网络智能，即“电信大脑”，来实现蜂窝网络的无缝、自主管理。大型语言模型（LLM）作为实现这一愿景的潜在推动者已经出现，但在网络建模方面面临挑战，特别是在推理和处理多种数据类型方面。为了解决这些差距，我们引入了Hermes，这是一种由LLM代理组成的链条，通过结构化且可解释的逻辑步骤使用“蓝图”构建NDT实例。Hermes允许对各种用例和配置进行自动、可靠和准确的网络建模，从而朝着完全自主的网络运营迈出了一步。|\n", "2411.05990": "|**2024-11-12**|**Game-theoretic LLM: Agent Workflow for Negotiation Games**|Wenyue Hua et.al.|[2411.05990](http://arxiv.org/abs/2411.05990)|**[link](https://github.com/wenyueh/game_theory)**|**本文研究了大型语言模型（LLMs）在战略决策环境中的理性，特别是在博弈论框架下。我们评估了多个最先进的LLMs在完全信息和不完全信息游戏中的表现。研究发现，随着收益矩阵的增大或序列树的加深，LLMs经常偏离理性策略。为了解决这些局限性，我们设计了多种博弈论工作流程，以指导LLMs的推理和决策过程。这些工作流程旨在提高模型计算纳什均衡和在不确定性和信息不完全条件下做出理性选择的能力。实验结果表明，采用这些工作流程显著提高了LLMs在博弈论任务中的理性和鲁棒性。具体而言，在使用工作流程后，LLMs在识别最优策略、在谈判场景中实现接近最优分配以及减少谈判过程中被利用的风险方面表现出显著改进。此外，我们还探讨了代理是否应该采用此类工作流程的元策略考虑，认识到使用或放弃工作流程本身就是一个博弈论问题。我们的研究深化了对LLMs在战略背景下的决策能力的理解，并提供了通过结构化工作流程增强其理性的见解。研究结果对于开发更稳健且具有战略意识的AI代理，使其能够应对复杂的交互环境具有重要意义。支持本研究的代码和数据可从\\url{https://github.com/Wenyueh/game_theory}获取。**|\n", "2411.08449": "|**2024-11-13**|**Towards Evaluating Large Language Models for Graph Query Generation**|Siraj Munir et.al.|[2411.08449](http://arxiv.org/abs/2411.08449)|null|大型语言模型（LLMs）正在革新生成式人工智能（GenAI）的领域，基于LLM的创新解决方案迅速涌现。然而，在数据库技术方面，特别是在图数据库和知识图谱（KGs）的查询生成上，LLMs仍面临重大挑战。尽管关于LLM驱动的结构化查询语言（SQL）查询生成的研究已经存在，但针对图数据库的类似系统仍然不够成熟。本文介绍了一项比较研究，旨在解决使用开放访问的LLM生成Cypher查询的问题，Cypher是一种与图数据库交互的强大语言。我们通过设计的少量学习提示和基于思维链（CoT）推理的检索增强生成（RAG），严格评估了几个LLM代理（OpenAI ChatGPT 4.0、Claude Sonnet 3.5、Google Gemini Pro 1.5以及本地部署的Llama 3.1 8B）。我们的查询生成准确性实证分析表明，在这一特定领域中，Claude Sonnet 3.5的表现优于其竞争对手。此外，我们还指出了有前景的未来研究方向，以解决已识别的局限性，并推进LLM驱动的图数据库查询生成技术的发展。|\n", "2411.08294": "|**2024-11-13**|**Collaborative Participatory Research with LLM Agents in South Asia: An Empirically-Grounded Methodological Initiative and Agenda from Field Evidence in Sri Lanka**|Xinjie Zhao et.al.|[2411.08294](http://arxiv.org/abs/2411.08294)|null|将人工智能整合到发展研究方法中为解决参与式研究中的长期挑战提供了前所未有的机会，特别是在像南亚这样语言多样化的地区。本文基于斯里兰卡僧伽罗语社区的实际实施情况，提出了一种实证基础的方法论框架，旨在改变参与式发展研究的方式，该研究背景是斯里兰卡易受洪水影响的尼尔瓦拉河流域这一充满挑战的多语言环境中。该框架超越了传统的翻译和数据收集工具，采用了一种多代理系统架构，重新定义了在语言和文化多样性研究环境中的数据收集、分析和社区参与方式。这种结构化的基于代理的方法使得参与式研究既可扩展又具有响应性，确保社区观点仍然是研究结果的核心部分。实地经验表明，基于大模型的系统在解决资源有限地区的长期发展研究问题方面具有巨大潜力，既提高了定量效率，也提升了包容性的质量。从更广泛的方法论层面来看，这一研究议程倡导使用以AI驱动的参与式研究工具，这些工具保持了伦理考量、文化尊重和操作效率，强调了部署能够加强社区能动性和公平知识生成的AI系统的战略路径，可能为全球南方更广泛的研究议程提供信息。|\n", "2411.09523": "|**2024-11-14**|**Navigating the Risks: A Survey of Security, Privacy, and Ethics Threats in LLM-Based Agents**|Yuyou Gan et.al.|[2411.09523](http://arxiv.org/abs/2411.09523)|null|随着大型语言模型（LLM）的不断发展，基于Transformer的模型在众多自然语言处理（NLP）任务中取得了突破性进展，催生了一系列以LLM为控制中心的代理。尽管LLM在各种任务中取得了成功，但它们面临着众多安全和隐私威胁，在代理场景中这些威胁变得更加严重。为了增强基于LLM应用的可靠性，一系列研究从不同角度出发评估和缓解这些风险。为了帮助研究人员全面了解各种风险，本综述收集并分析了这些代理所面临的不同威胁。为解决以往分类方法在处理跨模块和跨阶段威胁时的挑战，我们提出了一种基于来源和影响的新分类框架。此外，我们识别了基于LLM的代理的六个关键特征，并基于这些特征总结了当前的研究进展及分析了其局限性。随后，我们选取四个具有代表性的代理作为案例研究，分析了它们在实际使用中可能面临的各种风险。最后，基于上述分析，我们从数据、方法论和政策的角度提出了未来的研究方向。|\n"}, "llm": {"2405.10255": "|**2024-05-16**|**When LLMs step into the 3D World: A Survey and Meta-Analysis of 3D Tasks via Multi-modal Large Language Models**|Xianzheng Ma et.al.|[2405.10255](http://arxiv.org/abs/2405.10255)|**[link](https://github.com/activevisionlab/awesome-llm-3d)**|\n", "2411.04118": "|**2024-11-06**|**Medical Adaptation of Large Language and Vision-Language Models: Are We Making Progress?**|Daniel P. Jeong et.al.|[2411.04118](http://arxiv.org/abs/2411.04118)|null|\n", "2411.04105": "|**2024-11-06**|**How Transformers Solve Propositional Logic Problems: A Mechanistic Analysis**|Guan Zhe Hong et.al.|[2411.04105](http://arxiv.org/abs/2411.04105)|null|\n", "2411.04032": "|**2024-11-06**|**Beemo: Benchmark of Expert-edited Machine-generated Outputs**|Ekaterina Artemova et.al.|[2411.04032](http://arxiv.org/abs/2411.04032)|null|\n", "2411.03964": "|**2024-11-06**|**What Really is Commonsense Knowledge?**|Quyet V. Do et.al.|[2411.03964](http://arxiv.org/abs/2411.03964)|null|\n", "2411.03962": "|**2024-11-06**|**How Does A Text Preprocessing Pipeline Affect Ontology Syntactic Matching?**|Zhangcheng Qiang et.al.|[2411.03962](http://arxiv.org/abs/2411.03962)|null|\n", "2411.03957": "|**2024-11-06**|**Fine-Grained Guidance for Retrievers: Leveraging LLMs' Feedback in Retrieval-Augmented Generation**|Yuhang Liu et.al.|[2411.03957](http://arxiv.org/abs/2411.03957)|null|\n", "2411.03948": "|**2024-11-06**|**Long-Form Text-to-Music Generation with Adaptive Prompts: A Case of Study in Tabletop Role-Playing Games Soundtracks**|Felipe Marra et.al.|[2411.03948](http://arxiv.org/abs/2411.03948)|null|\n", "2411.03884": "|**2024-11-06**|**Polynomial Composition Activations: Unleashing the Dynamics of Large Language Models**|Zhijian Zhuo et.al.|[2411.03884](http://arxiv.org/abs/2411.03884)|**[link](https://github.com/brycezhuo/polycom)**|\n", "2411.03883": "|**2024-11-06**|**MEG: Medical Knowledge-Augmented Large Language Models for Question Answering**|Laura Cabello et.al.|[2411.03883](http://arxiv.org/abs/2411.03883)|**[link](https://github.com/lautel/meg)**|\n", "2411.03881": "|**2024-11-06**|**Data Fusion of Synthetic Query Variants With Generative Large Language Models**|Timo Breuer et.al.|[2411.03881](http://arxiv.org/abs/2411.03881)|**[link](https://github.com/breuert/sigirap24)**|\n", "2411.05000": "|**2024-11-07**|**Needle Threading: Can LLMs Follow Threads through Near-Million-Scale Haystacks?**|Jonathan Roberts et.al.|[2411.05000](http://arxiv.org/abs/2411.05000)|null|\n", "2411.04997": "|**2024-11-07**|**LLM2CLIP: Powerful Language Model Unlock Richer Visual Representation**|Weiquan Huang et.al.|[2411.04997](http://arxiv.org/abs/2411.04997)|**[link](https://github.com/microsoft/LLM2CLIP)**|\n", "2411.04996": "|**2024-11-07**|**Mixture-of-Transformers: A Sparse and Scalable Architecture for Multi-Modal Foundation Models**|Weixin Liang et.al.|[2411.04996](http://arxiv.org/abs/2411.04996)|null|\n", "2411.04991": "|**2024-11-07**|**Rethinking Bradley-Terry Models in Preference-Based Reward Modeling: Foundations, Theory, and Alternatives**|Hao Sun et.al.|[2411.04991](http://arxiv.org/abs/2411.04991)|**[link](https://github.com/holarissun/rewardmodelingbeyondbradleyterry)**|\n", "2411.04981": "|**2024-11-07**|**Enhancing Reverse Engineering: Investigating and Benchmarking Large Language Models for Vulnerability Analysis in Decompiled Binaries**|Dylan Manuel et.al.|[2411.04981](http://arxiv.org/abs/2411.04981)|null|\n", "2411.04975": "|**2024-11-07**|**SuffixDecoding: A Model-Free Approach to Speeding Up Large Language Model Inference**|Gabriele Oliaro et.al.|[2411.04975](http://arxiv.org/abs/2411.04975)|null|\n", "2411.04965": "|**2024-11-07**|**BitNet a4.8: 4-bit Activations for 1-bit LLMs**|Hongyu Wang et.al.|[2411.04965](http://arxiv.org/abs/2411.04965)|null|\n", "2411.04962": "|**2024-11-07**|**Position Paper On Diagnostic Uncertainty Estimation from Large Language Models: Next-Word Probability Is Not Pre-test Probability**|Yanjun Gao et.al.|[2411.04962](http://arxiv.org/abs/2411.04962)|null|\n", "2411.04954": "|**2024-11-07**|**CAD-MLLM: Unifying Multimodality-Conditioned CAD Generation With MLLM**|Jingwei Xu et.al.|[2411.04954](http://arxiv.org/abs/2411.04954)|null|\n", "2411.04920": "|**2024-11-07**|**GPTKB: Building Very Large Knowledge Bases from Language Models**|Yujia Hu et.al.|[2411.04920](http://arxiv.org/abs/2411.04920)|**[link](https://github.com/Knowledge-aware-AI/GPTKB)**|\n", "2411.05787": "|**2024-11-08**|**Recycled Attention: Efficient inference for long-context language models**|Fangyuan Xu et.al.|[2411.05787](http://arxiv.org/abs/2411.05787)|null|\n", "2411.05775": "|**2024-11-08**|**Fact or Fiction? Can LLMs be Reliable Annotators for Political Truths?**|Veronica Chatrath et.al.|[2411.05775](http://arxiv.org/abs/2411.05775)|null|\n", "2411.05762": "|**2024-11-08**|**Multi-hop Evidence Pursuit Meets the Web: Team Papelo at FEVER 2024**|Christopher Malon et.al.|[2411.05762](http://arxiv.org/abs/2411.05762)|null|\n", "2411.05665": "|**2024-11-08**|**Unmasking the Limits of Large Language Models: A Systematic Evaluation of Masked Text Processing Ability through MskQA and MskCal**|Fuka Matsuzaki et.al.|[2411.05665](http://arxiv.org/abs/2411.05665)|**[link](https://github.com/isfhub/maskcode)**|\n", "2411.05653": "|**2024-11-08**|**The influence of persona and conversational task on social interactions with a LLM-controlled embodied conversational agent**|Leon O. H. Kroczek et.al.|[2411.05653](http://arxiv.org/abs/2411.05653)|null|\n", "2411.05651": "|**2024-11-08**|**LightVA: Lightweight Visual Analytics with LLM Agent-Based Task Planning and Execution**|Yuheng Zhao et.al.|[2411.05651](http://arxiv.org/abs/2411.05651)|null|\n", "2411.05641": "|**2024-11-08**|**Evaluating Large Language Model Capability in Vietnamese Fact-Checking Data Generation**|Long Truong To et.al.|[2411.05641](http://arxiv.org/abs/2411.05641)|null|\n", "2411.05609": "|**2024-11-08**|**A Two-Step Concept-Based Approach for Enhanced Interpretability and Trust in Skin Lesion Diagnosis**|Cristiano Patrício et.al.|[2411.05609](http://arxiv.org/abs/2411.05609)|**[link](https://github.com/cristianopatricio/2-step-concept-based-skin-diagnosis)**|\n", "2411.05593": "|**2024-11-08**|**Evaluating and Adapting Large Language Models to Represent Folktales in Low-Resource Languages**|JA Meaney et.al.|[2411.05593](http://arxiv.org/abs/2411.05593)|null|\n", "2411.05555": "|**2024-11-08**|**AcceLLM: Accelerating LLM Inference using Redundancy for Load Balancing and Data Locality**|Ilias Bournias et.al.|[2411.05555](http://arxiv.org/abs/2411.05555)|null|\n", "2411.07240": "|**2024-11-11**|**UTMath: Math Evaluation with Unit Test via Reasoning-to-Coding Thoughts**|Bo Yang et.al.|[2411.07240](http://arxiv.org/abs/2411.07240)|**[link](https://github.com/utmathgroup/utmath)**|\n", "2411.07228": "|**2024-11-11**|**Tooling or Not Tooling? The Impact of Tools on Language Agents for Chemistry Problem Solving**|Botao Yu et.al.|[2411.07228](http://arxiv.org/abs/2411.07228)|null|\n", "2411.07213": "|**2024-11-11**|**Comparing Bottom-Up and Top-Down Steering Approaches on In-Context Learning Tasks**|Madeline Brumley et.al.|[2411.07213](http://arxiv.org/abs/2411.07213)|null|\n", "2411.07205": "|**2024-11-11**|**DLCR: A Generative Data Expansion Framework via Diffusion for Clothes-Changing Person Re-ID**|Nyle Siddiqui et.al.|[2411.07205](http://arxiv.org/abs/2411.07205)|**[link](https://github.com/croitorualin/dlcr)**|\n", "2411.07191": "|**2024-11-11**|**The Super Weight in Large Language Models**|Mengxia Yu et.al.|[2411.07191](http://arxiv.org/abs/2411.07191)|**[link](https://github.com/mengxiayu/llmsuperweight)**|\n", "2411.07186": "|**2024-11-11**|**NatureLM-audio: an Audio-Language Foundation Model for Bioacoustics**|David Robinson et.al.|[2411.07186](http://arxiv.org/abs/2411.07186)|null|\n", "2411.07163": "|**2024-11-11**|**A Domain-Agnostic Neurosymbolic Approach for Big Social Data Analysis: Evaluating Mental Health Sentiment on Social Media during COVID-19**|Vedant Khandelwal et.al.|[2411.07163](http://arxiv.org/abs/2411.07163)|null|\n", "2411.07140": "|**2024-11-11**|**Chinese SimpleQA: A Chinese Factuality Evaluation for Large Language Models**|Yancheng He et.al.|[2411.07140](http://arxiv.org/abs/2411.07140)|null|\n", "2411.07133": "|**2024-11-11**|**Stronger Models are NOT Stronger Teachers for Instruction Tuning**|Zhangchen Xu et.al.|[2411.07133](http://arxiv.org/abs/2411.07133)|null|\n", "2411.07127": "|**2024-11-11**|**Benchmarking LLMs' Judgments with No Gold Standard**|Shengwei Xu et.al.|[2411.07127](http://arxiv.org/abs/2411.07127)|**[link](https://github.com/yx-lu/benchmarking-llms--judgments-with-no-gold-standard)**|\n", "2411.08028": "|**2024-11-12**|**Learning with Less: Knowledge Distillation from Large Language Models via Unlabeled Data**|Juanhui Li et.al.|[2411.08028](http://arxiv.org/abs/2411.08028)|null|\n", "2411.08027": "|**2024-11-12**|**LLMPhy: Complex Physical Reasoning Using Large Language Models and World Models**|Anoop Cherian et.al.|[2411.08027](http://arxiv.org/abs/2411.08027)|null|\n", "2411.08019": "|**2024-11-12**|**Language Models as Causal Effect Generators**|Lucius E. J. Bynum et.al.|[2411.08019](http://arxiv.org/abs/2411.08019)|**[link](https://github.com/lbynum/sequence-driven-scms)**|\n", "2411.08010": "|**2024-11-12**|**ExpressivityArena: Can LLMs Express Information Implicitly?**|Joshua Tint et.al.|[2411.08010](http://arxiv.org/abs/2411.08010)|null|\n", "2411.08003": "|**2024-11-12**|**Can adversarial attacks by large language models be attributed?**|Manuel Cebrian et.al.|[2411.08003](http://arxiv.org/abs/2411.08003)|null|\n", "2411.07990": "|**2024-11-12**|**Derivational Morphology Reveals Analogical Generalization in Large Language Models**|Valentin Hofmann et.al.|[2411.07990](http://arxiv.org/abs/2411.07990)|null|\n", "2411.07965": "|**2024-11-12**|**From General to Specific: Utilizing General Hallucation to Automatically Measure the Role Relationship Fidelity for Specific Role-Play Agents**|Chuyi Kong et.al.|[2411.07965](http://arxiv.org/abs/2411.07965)|null|\n", "2411.07942": "|**2024-11-12**|**Towards Low-bit Communication for Tensor Parallel LLM Inference**|Harry Dong et.al.|[2411.07942](http://arxiv.org/abs/2411.07942)|null|\n", "2411.07871": "|**2024-11-12**|**Leveraging Multimodal Models for Enhanced Neuroimaging Diagnostics in Alzheimer's Disease**|Francesco Chiumento et.al.|[2411.07871](http://arxiv.org/abs/2411.07871)|null|\n", "2411.07858": "|**2024-11-12**|**Verbosity $\\neq$ Veracity: Demystify Verbosity Compensation Behavior of Large Language Models**|Yusen Zhang et.al.|[2411.07858](http://arxiv.org/abs/2411.07858)|**[link](https://github.com/psunlpgroup/verbosityllm)**|\n", "2411.08870": "|**2024-11-13**|**The Limited Impact of Medical Adaptation of Large Language and Vision-Language Models**|Daniel P. Jeong et.al.|[2411.08870](http://arxiv.org/abs/2411.08870)|null|\n", "2411.08862": "|**2024-11-13**|**LLMStinger: Jailbreaking LLMs using RL fine-tuned LLMs**|Piyush Jha et.al.|[2411.08862](http://arxiv.org/abs/2411.08862)|null|\n", "2411.08794": "|**2024-11-13**|**Evaluating World Models with LLM for Decision Making**|Chang Yang et.al.|[2411.08794](http://arxiv.org/abs/2411.08794)|null|\n", "2411.08745": "|**2024-11-13**|**Separating Tongue from Thought: Activation Patching Reveals Language-Agnostic Concept Representations in Transformers**|Clément Dumas et.al.|[2411.08745](http://arxiv.org/abs/2411.08745)|**[link](https://github.com/butanium/llm-lang-agnostic)**|\n", "2411.08733": "|**2024-11-13**|**Dynamic Rewarding with Prompt Optimization Enables Tuning-free Self-Alignment of Language Models**|Somanshu Singla et.al.|[2411.08733](http://arxiv.org/abs/2411.08733)|**[link](https://github.com/Singla17/DRPO)**|\n", "2411.08671": "|**2024-11-13**|**Theoretical Analysis of Byte-Pair Encoding**|László Kozma et.al.|[2411.08671](http://arxiv.org/abs/2411.08671)|null|\n", "2411.08645": "|**2024-11-13**|**A System Level Performance Evaluation for Superconducting Digital Systems**|Joyjit Kundu et.al.|[2411.08645](http://arxiv.org/abs/2411.08645)|null|\n", "2411.08640": "|**2024-11-13**|**Towards Secure Intelligent O-RAN Architecture: Vulnerabilities, Threats and Promising Technical Solutions using LLMs**|Mojdeh Karbalaee Motalleb et.al.|[2411.08640](http://arxiv.org/abs/2411.08640)|null|\n", "2411.08574": "|**2024-11-13**|**Practitioners' Discussions on Building LLM-based Applications for Production**|Alina Mailach et.al.|[2411.08574](http://arxiv.org/abs/2411.08574)|null|\n", "2411.08563": "|**2024-11-13**|**Leveraging LLMs for Predictive Insights in Food Policy and Behavioral Interventions**|Micha Kaiser et.al.|[2411.08563](http://arxiv.org/abs/2411.08563)|null|\n", "2411.09688": "|**2024-11-14**|**Squeezed Attention: Accelerating Long Context Length LLM Inference**|Coleman Hooper et.al.|[2411.09688](http://arxiv.org/abs/2411.09688)|null|新兴的大型语言模型（LLM）应用需要长输入提示来执行复杂的下游任务，如文档分析和代码生成。对于这些长上下文长度的应用程序，输入提示的长度对推理效率构成了重大挑战，因为推理成本随着序列长度线性增加。然而，在许多这些应用程序中，提示中的大部分上下文在不同的用户输入之间是固定的，从而提供了机会进行离线优化，以便快速处理收到的用户输入。在这项工作中，我们提出了挤压注意力机制，以加速其中大部分输入提示为固定内容的LLM应用程序。我们首先利用K-means聚类在线下根据语义相似性对固定上下文的键进行分组，并用单个质心值表示每个簇。在推理过程中，我们将来自用户输入的查询令牌与质心进行比较，以预测哪些来自固定上下文的键在语义上相关并需要在推理时加载。然后，我们仅使用这些重要键从固定上下文中计算精确注意力，从而减少带宽和计算成本。我们还扩展了我们的方法，使用分层质心查找来识别重要键，这可以将注意力的复杂度从线性降低到对数级别。我们实现了用于质心比较和稀疏FlashAttention的重要键优化Triton内核，在长上下文推理的预填充和生成阶段都实现了超过4倍的速度提升。此外，我们在各种长上下文基准测试中广泛评估了我们的方法，包括LongBench，结果显示它可以在不损失准确性的情况下将KV缓存预算减少3倍，并且对于各种模型，最多可以减少8倍的KV缓存预算，同时保持低于0.5点的精度差距。|\n", "2411.09625": "|**2024-11-14**|**Local deployment of large-scale music AI models on commodity hardware**|Xun Zhou et.al.|[2411.09625](http://arxiv.org/abs/2411.09625)|null|我们介绍了MIDInfinite，这是一个能够在普通硬件上本地生成符号音乐的网络应用程序。创建这个演示涉及将预训练于Lakh MIDI数据集上的Anticipatory Music Transformer（一种大型语言模型）移植到Machine Learning Compilation (MLC) 框架中。一旦模型被移植，MLC就能够支持在包括C++、移动设备和浏览器等多种运行环境下的推理。我们设想MLC有潜力弥合日益强大的音乐AI模型与音乐软件开发者更熟悉的开发技术之间的差距。作为概念验证，我们构建了一个网络应用程序，允许用户在浏览器中生成无尽的多乐器MIDI流，可以是从零开始或基于提示进行生成。在普通硬件（如M3 Macbook Pro）上，我们的演示可以每秒生成51个音符，这比72.9%的生成速度快于实时播放速度，并且通过提前2秒缓冲，这一比例增加到了86.3%。|\n", "2411.09613": "|**2024-11-14**|**PTR: Precision-Driven Tool Recommendation for Large Language Models**|Hang Gao et.al.|[2411.09613](http://arxiv.org/abs/2411.09613)|null|通过为大型语言模型（LLMs）配备外部工具，其解决复杂问题的能力得到了显著增强。然而，尽管LLMs的解析能力在不断进步，但由于外部工具数量庞大，同时将所有可用工具纳入提示中仍然不切实际。因此，在考虑数量和质量的情况下，为特定任务提供一套精确的工具对于LLMs来说至关重要。当前的工具检索方法主要集中在优化工具排名列表上，并直接将固定数量的高排名工具打包成工具集。然而，这些方法往往不能在执行前为LLMs配备最佳工具集，因为不同任务所需的最佳工具数量可能不同，这导致了诸如冗余或不合适工具等问题，阻碍了对最相关工具的即时访问。本文旨在解决为LLMs推荐精确工具集的问题。我们引入了工具推荐问题，定义了其范围，并提出了一种新的基于精度驱动的工具推荐（PTR）方法。PTR通过利用历史工具捆绑使用情况来捕捉一个初步且精简的工具集，并通过执行工具匹配动态调整工具集，最终实现基于多视角的工具添加。此外，我们还介绍了一个新的数据集RecTools以及一种用于评估LLMs工具推荐效果的新度量标准TRACC。我们通过全面的实验进一步验证了我们的设计选择，在两个开放基准测试和我们的RecTools数据集上展示了令人鼓舞的准确性。|\n", "2411.09595": "|**2024-11-14**|**LLaMA-Mesh: Unifying 3D Mesh Generation with Language Models**|Zhengyi Wang et.al.|[2411.09595](http://arxiv.org/abs/2411.09595)|null|这项工作探讨了扩展预训练于文本的大规模语言模型（LLM）的能力，使其能够在统一模型中生成3D网格。这提供了两个主要优势：(1) 利用已经嵌入到LLM中的空间知识，这些知识来源于诸如3D教程等文本资源；(2) 使能对话式3D生成和网格理解。一个主要挑战是如何有效地将3D网格数据分词成离散的标记，以便LLM能够无缝处理。为了解决这个问题，我们引入了LLaMA-Mesh，这是一种新颖的方法，它将3D网格的顶点坐标和面定义表示为纯文本，允许直接与LLM集成而无需扩充词汇表。我们构建了一个监督微调（SFT）数据集，使得预训练的LLM能够(1) 根据文本提示生成3D网格，(2) 按需产生交错的文本和3D网格输出，以及(3) 理解和解释3D网格。我们的工作首次展示了LLM可以通过基于文本格式的微调来获取用于3D网格生成的复杂空间知识，有效统一了3D和文本模态。LLaMA-Mesh在保持强大的文本生成性能的同时，在网格生成质量上达到了与从头开始训练的模型相当的水平。|\n", "2411.09590": "|**2024-11-14**|**Adopting RAG for LLM-Aided Future Vehicle Design**|Vahid Zolfaghari et.al.|[2411.09590](http://arxiv.org/abs/2411.09590)|null|本文探讨了将大型语言模型（LLM）与检索增强生成（RAG）相结合，以提高汽车行业自动化设计和软件开发的效率。我们展示了两个案例研究：一个标准化合规聊天机器人和一个设计副驾，两者都利用RAG提供准确且具有上下文感知能力的响应。我们评估了四种LLM——GPT-4o、LLAMA3、Mistral和Mixtral，比较了它们的回答准确性和执行时间。结果表明，虽然GPT-4表现最佳，但LLAMA3和Mistral也显示出在本地部署方面的潜力，解决了汽车应用中的数据隐私问题。本研究表明，RAG增强的LLM在改进汽车工程的设计流程和合规性方面具有巨大潜力。|\n", "2411.09439": "|**2024-11-14**|**Spider: Any-to-Many Multimodal LLM**|Jinxiang Lai et.al.|[2411.09439](http://arxiv.org/abs/2411.09439)|null|多模态大语言模型（MLLMs）作为大型语言模型（LLMs）的扩展，实现了多种模态的整合。然而，现有的Any-to-Any MLLMs仅限于在单个响应中生成成对的模态“文本 + X”，例如文本 + {图像或音频或视频}。为了解决这一限制，我们提出了Spider，这是一种新颖高效的任意到多模态生成（AMMG）框架，能够生成任意组合的模态“文本 + Xs”，如文本 + {图像和音频和视频}。为了实现高效的AMMG，我们的Spider集成了三个核心组件：一个用于基本X-to-X（即Any-to-Any）模态处理的基础模型、一种新型高效解码器控制器用于控制多模态解码器生成Xs（多模态）内容，以及一种专为产生Xs信号提示设计的任意到多模态指令模板。为了训练Spider，我们构建了一个新的文本格式多模态（TMM）数据集，这有助于学习X-to-Xs（即Any-to-Many）能力，这是AMMG所必需的。最终，经过良好训练的Spider生成了一个伪X-to-Xs数据集，这是首个X-to-Xs多模态数据集，增强了未来研究中AMMG任务的潜力。总体而言，这项工作不仅推动了多模态交互的边界，还为该领域的进步提供了丰富的数据支持。|\n", "2411.09580": "|**2024-11-14**|**Software Performance Engineering for Foundation Model-Powered Software (FMware)**|Haoxiang Zhang et.al.|[2411.09580](http://arxiv.org/abs/2411.09580)|null|基础模型（FMs）如大型语言模型（LLMs）的兴起正在彻底改变软件开发。尽管这些原型令人印象深刻，但将FMware转变为生产就绪的产品需要跨多个领域的复杂工程。一个关键但常被忽视的方面是性能工程，其目标是确保FMware满足诸如吞吐量和延迟等性能目标，以避免用户不满和财务损失。通常，性能考虑是事后才想到的，导致部署后进行昂贵的优化工作。FMware对计算资源的高需求凸显了高效使用硬件的重要性。持续的性能工程对于防止性能退化至关重要。本文强调了软件性能工程（SPE）在FMware中的重要性，并基于文献调查和开发内部FMware系统的经验，确定了四个关键挑战：认知架构设计、通信协议、调优与优化以及部署。我们讨论了这些问题、当前的做法以及为软件工程社区提供的创新路径。|\n", "2411.09539": "|**2024-11-14**|**A Practical Guide to Fine-tuning Language Models with Limited Data**|Márton Szép et.al.|[2411.09539](http://arxiv.org/abs/2411.09539)|null|利用预训练的大规模语言模型（LLM）已成为自然语言处理（NLP）领域的标准做法，尽管这些模型需要大量的数据。本文受到近期在低资源领域和语言中用有限数据训练LLM的研究激增的启发，对最近的迁移学习方法进行了综述，以优化在数据稀缺的下游任务中的模型性能。我们首先探讨了初始预训练和持续预训练策略，以便更好地利用先验知识来应对未见过的领域和语言。接着，我们研究了如何在微调和少量样本学习过程中最大化有限数据的效用。最后一部分从特定任务的角度出发，回顾了适用于不同程度数据稀缺性的模型和方法。我们的目标是为实践者提供克服数据限制挑战的实际指南，同时也指出未来研究的有前景方向。|\n", "2411.09523": "|**2024-11-14**|**Navigating the Risks: A Survey of Security, Privacy, and Ethics Threats in LLM-Based Agents**|Yuyou Gan et.al.|[2411.09523](http://arxiv.org/abs/2411.09523)|null|随着大型语言模型（LLM）的不断发展，基于Transformer的模型在众多自然语言处理（NLP）任务中取得了突破性进展，催生了一系列以LLM为控制中心的智能体。尽管LLM在各种任务上取得了成功，但它们面临着诸多安全和隐私威胁，在智能体场景下这些问题变得更加严重。为了增强基于LLM应用的可靠性，一系列研究从不同角度出发评估并缓解这些风险。为了帮助研究人员全面了解各种风险，本综述收集并分析了这些智能体面临的不同威胁。针对之前分类方法在处理跨模块和跨阶段威胁时存在的挑战，我们提出了一种基于来源和影响的新分类框架。此外，我们识别出了基于LLM的智能体的六个关键特征，并在此基础上总结了当前的研究进展，分析了它们的局限性。随后，我们选择了四个代表性智能体作为案例研究，分析了它们在实际使用中可能面临的风险。最后，基于上述分析，我们从数据、方法论和政策三个角度提出了未来的研究方向。|\n", "2411.09510": "|**2024-11-14**|**Communication Compression for Tensor Parallel LLM Inference**|Jan Hansen-Palmus et.al.|[2411.09510](http://arxiv.org/abs/2411.09510)|null|大型语言模型（LLM）推动了人工智能的前沿，但它们由数百亿个参数和运算组成。为了加快推理延迟，LLM通过各种模型并行策略部署在多个硬件加速器上。我们的论文详细研究了其中一种策略——张量并行，并提出通过压缩加速器间的通信来减少延迟。我们利用细粒度量化技术将选定的激活压缩3.5到4.5倍。我们提出的方法使首次生成令牌的时间（TTFT）最多减少了2倍，同时对模型性能的影响微乎其微。|\n"}, "moe": {"2411.02115": "|**2024-11-04**|**FedMoE-DA: Federated Mixture of Experts via Domain Aware Fine-grained Aggregation**|Ziwei Zhan et.al.|[2411.02115](http://arxiv.org/abs/2411.02115)|null|联邦学习（FL）是一种协作式机器学习方法，它使多个客户端能够在不共享其私有数据的情况下训练模型。随着深度学习的兴起，由于大规模模型表现出色，它们受到了广泛关注。然而，在FL中，客户端计算和通信资源受限成为部署这些大型模型的关键挑战。混合专家（MoE）架构通过其稀疏激活特性解决了这一挑战，该特性在推理和更新过程中减少了计算工作量和通信需求。此外，MoE通过允许每个专家专门处理数据分布的不同子集，从而更好地实现个性化。为了减轻服务器与客户端之间的通信负担，我们提出了FedMoE-DA，这是一种新的FL模型训练框架，利用了MoE架构，并结合了一种新颖的领域感知、细粒度聚合策略，以同时增强鲁棒性、个性化能力和通信效率。具体来说，我们利用了客户端内专家模型之间以及客户端间数据异质性的相关性。此外，我们利用客户端间的点对点（P2P）通信进行选择性专家模型同步，从而显著减少了服务器与客户端之间的传输。实验表明，我们的FedMoE-DA在减少服务器通信压力的同时取得了优异的性能。|\n", "2411.01457": "|**2024-11-03**|**Facet-Aware Multi-Head Mixture-of-Experts Model for Sequential Recommendation**|Mingrui Liu et.al.|[2411.01457](http://arxiv.org/abs/2411.01457)|null|序贯推荐（SR）系统通过利用用户的历史交互记录来捕捉用户的动态偏好。大多数现有的SR系统为每个项目分配一个单一的嵌入向量以表示其特征，并采用各种类型的模型将这些项目嵌入组合成序列表示向量，以捕捉用户意图。然而，我们认为这种表示方法不足以捕捉项目的多方面特性（例如电影类型、主演演员）。此外，用户在这些方面通常表现出复杂且多样的偏好（例如，在类型方面既喜欢动作片也喜欢音乐剧），这很难被完全表示。为了解决上述问题，我们提出了一种新的结构，称为面向方面的多头混合专家模型用于序贯推荐（FAME）。我们利用最后一个多头注意力层中每个头部的子嵌入分别预测下一个项目。这种方法可以捕捉项目的潜在多方面性质，而不会增加模型的复杂性。一种门控机制整合了来自每个头部的推荐，并动态确定它们的重要性。此外，我们在每个注意力头部引入了一个混合专家（MoE）网络，以解开每个方面内的各种用户偏好。MoE中的每个专家专注于特定的偏好。采用可学习的路由网络来计算每个专家的重要性权重并进行聚合。我们在四个公开的序贯推荐数据集上进行了广泛的实验，结果表明我们的方法比现有的基线模型更有效。|\n", "2411.01433": "|**2024-11-06**|**HOBBIT: A Mixed Precision Expert Offloading System for Fast MoE Inference**|Peng Tang et.al.|[2411.01433](http://arxiv.org/abs/2411.01433)|null|混合专家（MoE）架构在大型语言模型（LLM）时代展示了显著的优势，提供了增强的能力并降低了推理成本。然而，由于其巨大的内存需求，在内存受限的边缘设备上部署基于MoE的LLM仍然具有挑战性。虽然现有的专家卸载方法减轻了内存需求，但它们通常会带来显著的专家加载成本或牺牲模型准确性。我们提出了HOBBIT，这是一个混合精度专家卸载系统，旨在实现灵活高效的MoE推理。我们的关键见解是，通过动态地将较不重要的缓存未命中专家替换为低精度版本，可以大幅减少专家加载延迟，同时保持模型准确性。HOBBIT引入了三种创新技术，映射了MoE计算的自然层次：(1) 令牌级别的动态专家加载机制，(2) 层级自适应专家预取技术，以及(3) 序列级别的多维专家缓存策略。这些创新充分利用了混合精度专家推理的好处。通过在著名的LLM推理框架Llama.cpp之上实现HOBBIT，我们在不同边缘设备上使用代表性MoE模型对其性能进行了评估。结果表明，与最先进的MoE卸载系统相比，HOBBIT实现了高达9.93倍的解码速度提升。|\n", "2411.01288": "|**2024-11-07**|**HEXA-MoE: Efficient and Heterogeneous-aware MoE Acceleration with ZERO Computation Redundancy**|Shuqing Luo et.al.|[2411.01288](http://arxiv.org/abs/2411.01288)|**[link](https://github.com/unites-lab/hexa-moe)**|**混合专家（MoE）已成为一种实用的方法，通过扩展Transformer模型的参数以实现更好的泛化能力，同时保持计算开销的亚线性增长。当前的MoE模型主要基于分布式设备上的专家并行构建。然而，这种方法通常依赖于同构设备进行部署，并且存在严重的通信开销和计算冗余问题。在本文中，我们探索开发了一个名为**HEXA-MoE**的异构感知专家分配框架，该框架显著提高了计算效率。它包含两个组件：(1) **特定专家操作符**。我们用我们的操作符替换了典型的通用矩阵乘法或分组矩阵乘法接口，使得计算可以以内存原地方式进行，且**无任何冗余**。(2) **适应不同工作负载规模的数据和模型中心配置**。具体来说，我们在每个设备上引入了管道共享缓存，以解决现有数据中心MoE库中的高内存消耗问题。通过对Swin-MoE基准测试的全面实验一致显示了我们HEXA-MoE框架的有效性，即相比当前最先进的MoE库，减少了10%~48%的内存消耗，并实现了0.5~4.3倍的速度提升。此外，我们还考察了HEXA-MoE在异构设备上的数据和模型中心设置。有希望的结果表明，在异构设备上采用最优并行配置与HEXA-MoE可以大幅减少整体延迟。代码可在https://github.com/UNITES-Lab/HEXA-MoE获取。**|\n", "2411.01245": "|**2024-11-02**|**PMoL: Parameter Efficient MoE for Preference Mixing of LLM Alignment**|Dongxu Liu et.al.|[2411.01245](http://arxiv.org/abs/2411.01245)|null|\n", "2411.01016": "|**2024-11-01**|**MoE-I$^2$: Compressing Mixture of Experts Models through Inter-Expert Pruning and Intra-Expert Low-Rank Decomposition**|Cheng Yang et.al.|[2411.01016](http://arxiv.org/abs/2411.01016)|null|\n", "2411.02433": "|**2024-11-01**|**SLED: Self Logits Evolution Decoding for Improving Factuality in Large Language Models**|Jianyi Zhang et.al.|[2411.02433](http://arxiv.org/abs/2411.02433)|null|\n", "2411.00662": "|**2024-11-01**|**MoNTA: Accelerating Mixture-of-Experts Training with Network-Traffc-Aware Parallel Optimization**|Jingming Guo et.al.|[2411.00662](http://arxiv.org/abs/2411.00662)|**[link](https://github.com/enflametechnology/deepspeed)**|\n", "2411.00918": "|**2024-11-01**|**LIBMoE: A Library for comprehensive benchmarking Mixture of Experts in Large Language Models**|Nam V. Nguyen et.al.|[2411.00918](http://arxiv.org/abs/2411.00918)|**[link](https://github.com/Fsoft-AIC/LibMoE)**|\n", "2410.23836": "|**2024-10-31**|**Stereo-Talker: Audio-driven 3D Human Synthesis with Prior-Guided Mixture-of-Experts**|Xiang Deng et.al.|[2410.23836](http://arxiv.org/abs/2410.23836)|null|\n", "2411.06826": "|**2024-11-11**|**Adaptive Conditional Expert Selection Network for Multi-domain Recommendation**|Kuiyao Dong et.al.|[2411.06826](http://arxiv.org/abs/2411.06826)|null|混合专家（MOE）模型由于其强大的表达能力，已成为多领域推荐（MDR）的实际标准。然而，这种基于MOE的方法通常对每个实例使用所有专家，导致可扩展性问题和领域与专家之间的低区分度。此外，常用的特定领域网络设计进一步加剧了可扩展性问题。为了解决这些问题，我们提出了一种名为CESAA的新方法，该方法包括条件专家选择（CES）模块和自适应专家聚合（AEA）模块来应对这些挑战。具体来说，CES首先将稀疏门控策略与领域共享专家结合。然后，AEA利用互信息损失来增强专家与特定领域之间的关联，并显著提高专家之间的区分度。因此，对于每个实例，只有领域共享专家和选定的领域特定专家被激活，在计算效率和模型性能之间取得平衡。在公共排名和工业检索数据集上的实验结果验证了我们的方法在MDR任务中的有效性。|\n", "2411.06056": "|**2024-11-09**|**Learning Mixtures of Experts with EM**|Quentin Fruytier et.al.|[2411.06056](http://arxiv.org/abs/2411.06056)|null|专家混合模型（MoE）是一种机器学习模型，它通过将输入空间划分为多个部分，并在每个部分上训练一个独立的“专家”模型。最近，MoE作为当今大型语言模型中的组件变得流行起来，以此来减少训练和推理成本。在那里，分区函数和专家都是通过梯度下降法对对数似然进行联合学习的。本文专注于研究期望最大化（EM）算法在MoE模型训练中的效率。我们首先严格分析了线性或逻辑回归专家情况下的EM算法，表明EM等同于使用单位步长和Kullback-Leibler散度正则化器的镜像下降。这一视角使我们能够推导出新的收敛结果，并基于信噪比（SNR）确定局部线性收敛的条件。在合成数据和小规模真实世界数据上的实验表明，EM算法在收敛速度和达到的准确性方面均优于梯度下降算法。|\n", "2411.08446": "|**2024-11-13**|**LSH-MoE: Communication-efficient MoE Training via Locality-Sensitive Hashing**|Xiaonan Nie et.al.|[2411.08446](http://arxiv.org/abs/2411.08446)|null|较大的Transformer模型在各种任务上总是表现得更好，但扩大模型规模需要更高的成本。为了高效地扩大模型规模，广泛采用了混合专家（MoE）架构，该架构由一个门控网络和一系列专家组成，并通过将输入数据路由到固定数量的专家而不是所有专家来保持训练成本不变。在现有的大规模MoE训练系统中，专家会被分布在不同的GPU上以实现并行化，因此输入数据需要额外的全对全通信来访问目标专家并进行相应的计算。然而，在评估三种主流MoE模型在常用GPU集群上的训练过程时，我们发现全对全通信的比例平均约为45%，这显著阻碍了MoE模型训练的效率和可扩展性。在这篇论文中，我们提出了LSH-MoE，这是一种使用局部敏感哈希（LSH）的通信高效的MoE训练框架。我们首先介绍了现有系统中扩展MoE训练的问题，并强调了利用令牌相似性促进数据压缩的潜力。然后，我们介绍了一种高效的基于LSH的压缩技术，该技术利用交叉多面体哈希进行快速聚类，并实施基于残差的误差补偿方案以减轻压缩带来的负面影响。为了验证我们的方法的有效性，我们在语言模型（如RoBERTa、GPT和T5）和视觉模型（如Swin）上进行了预训练和微调任务的实验。结果表明，与同类方法相比，我们的方法在不同任务上实现了1.28倍至2.2倍的速度提升。|\n", "2411.08212": "|**2024-11-12**|**PERFT: Parameter-Efficient Routed Fine-Tuning for Mixture-of-Expert Model**|Yilun Liu et.al.|[2411.08212](http://arxiv.org/abs/2411.08212)|null|混合专家（MoE）范式已成为一种强大的方法，能够通过改进资源利用率来扩展Transformer。然而，高效微调MoE模型仍然在很大程度上未被充分探索。受最近关于参数高效微调（PEFT）工作的启发，我们提出了一种将PEFT模块直接集成到MoE机制中的统一框架。与MoE的核心原则和架构保持一致，我们的框架涵盖了一系列设计维度，包括多种功能和组合策略。通过结合我们框架内的设计选择，我们引入了参数高效的路由微调（PERFT），作为一种灵活且可扩展的PEFT策略家族，专门针对MoE模型进行了定制。在使OLMoE-1B-7B和Mixtral-8×7B适应常识推理和算术推理任务方面的广泛实验表明了PERFT的有效性、可扩展性和有趣的动态特性。此外，我们还为每个具体的设计选择提供了实证结果，以促进更好地应用MoE和PEFT。|\n", "2411.08982": "|**2024-11-13**|**Lynx: Enabling Efficient MoE Inference through Dynamic Batch-Aware Expert Selection**|Vima Gupta et.al.|[2411.08982](http://arxiv.org/abs/2411.08982)|null|混合专家（MoE）架构最近在实现大规模语言模型的有效扩展方面获得了广泛关注。然而，我们发现了一个根本性的矛盾：虽然MoE旨在选择性激活专家，但生产环境中的请求批处理却迫使所有专家都被激活，从而在解码阶段抵消了MoE的效率优势。我们提出了Lynx系统，通过动态、批处理感知的专家选择来实现高效的MoE推理。我们的关键洞察是，在不同的标记和推理阶段，专家的重要性差异显著，这为运行时优化提供了机会。Lynx利用这一洞察，通过一个轻量级框架动态减少活跃专家的数量，同时保持模型准确性。评估结果显示，Lynx在复杂的代码生成和数学推理任务中实现了高达1.55倍的推理延迟减少，而与基线模型相比，准确率损失可以忽略不计。|\n", "2411.08968": "|**2024-11-13**|**Sparse Upcycling: Inference Inefficient Finetuning**|Sasha Doubov et.al.|[2411.08968](http://arxiv.org/abs/2411.08968)|null|小型、经过高度训练的开源大型语言模型因其推理效率而被广泛使用，但进一步提高其质量仍然是一个挑战。稀疏升级是一种有前景的方法，它将预训练的密集模型转换为混合专家（MoE）架构，增加模型的参数数量和质量。在这项工作中，我们比较了在不同模型大小、计算预算和预训练持续时间下，稀疏升级与继续预训练（CPT）的有效性。我们的实验表明，在某些情况下，稀疏升级可以实现更好的质量，相对于CPT提高了超过20%。然而，这也带来了显著的推理成本，对于较大的模型，在高需求推理设置中会导致40%的减速。我们的发现强调了模型质量和推理效率之间的权衡，为寻求平衡模型质量和部署约束的从业者提供了见解。|\n"}, "SSMs": {"2411.03855": "|**2024-11-06**|**MambaPEFT: Exploring Parameter-Efficient Fine-Tuning for Mamba**|Masakazu Yoshimura et.al.|[2411.03855](http://arxiv.org/abs/2411.03855)|null|基于Transformer的模型通过使用大量数据构建大型模型，已经建立了一个生态系统。参数高效微调（PEFT）是将这些模型以最小成本部署到下游任务并实现有效性能的关键技术。最近，基于状态空间模型（SSM）的Mamba作为Transformer的一个潜在替代方案受到了关注。尽管已经提出了许多大规模基于Mamba的模型，但如何高效地将预训练的Mamba模型适应于下游任务仍然未被充分探索。在本文中，我们对Mamba的PEFT方法进行了探索性分析。我们研究了现有的针对Transformer的PEFT方法应用于Mamba时的有效性，并对这些方法进行了修改以更好地与Mamba架构对齐。此外，我们还提出了新的特定于Mamba的PEFT方法，这些方法利用了Mamba的独特结构。我们的实验表明，PEFT对于Mamba比对于Transformer更有效。最后，我们展示了如何有效地结合多种PEFT方法，并提供了一个优于以往工作的框架。为了确保可复现性，我们将在发表后公开代码。|\n", "2411.02949": "|**2024-11-05**|**A scalable generative model for dynamical system reconstruction from neuroimaging data**|Eric Volkmann et.al.|[2411.02949](http://arxiv.org/abs/2411.02949)|null|基于观察到的时间序列推断生成动力学是机器学习和自然科学中日益受到关注的领域。在神经科学中，这些方法有望减轻基于生物物理原理手工构建模型的需求，并能够自动化推断大脑动力学中的个体间差异。最近，在训练专门用于动态系统重建（DSR）的状态空间模型（SSM）的技术方面取得了突破，即使是从较短的时间序列中也能恢复包括其几何（吸引子）和长期统计不变量在内的底层系统。这些技术基于控制理论的思想，如现代变种的教师强迫（TF），以确保在训练过程中稳定地传播损失梯度。然而，目前这些技术不直接适用于当前观测依赖于先前状态整个历史的数据模态，这是由于信号的滤波特性所导致的，在神经科学（以及更广泛的生理学）中很常见。突出的例子包括功能性磁共振成像（fMRI）中的血氧水平依赖（BOLD）信号或Ca²⁺成像数据。这类信号使得SSM的解码器模型不可逆，这与之前基于TF的方法要求相悖。本文利用最近在训练SSM的控制技术方面的成功，提出了一种新算法，解决了这个问题，并且随着模型维度和滤波长度的增加表现出极好的扩展性。我们展示了该算法从短短的BOLD时间序列中高效重构动态系统的能力，包括其状态空间几何特性和长期时间特性。|\n", "2411.02824": "|**2024-11-05**|**Layer-Adaptive State Pruning for Deep State Space Models**|Minseon Gwak et.al.|[2411.02824](http://arxiv.org/abs/2411.02824)|**[link](https://github.com/msgwak/last)**|**由于缺乏状态维度优化方法，深度状态空间模型（SSM）不得不在模型容量、训练搜索空间或稳定性方面做出牺牲，以减轻高状态维度带来的计算成本。在这项工作中，我们为SSM提供了一种结构化剪枝方法——层自适应状态剪枝（LAST），通过扩展单个系统的模态截断来减少每层的状态维度，从而最小化模型级能量损失。LAST评分是通过评估每个状态的子系统$\\mathcal{H}_{\\infty}$范数以及逐层能量归一化得到的。这些评分作为全局剪枝标准，使得能够跨层比较状态并实现层自适应剪枝。在各种序列基准测试中，LAST优化了先前的SSM，揭示了其状态空间中的冗余性和可压缩性。值得注意的是，我们展示了平均而言，在不重新训练的情况下，剪枝33%的状态仍然可以保持性能，仅损失0.52%的准确率于多输入多输出SSM中。代码可在$\\href{https://github.com/msgwak/LAST}{此链接}$获取。**|\n", "2411.02217": "|**2024-11-04**|**Recursive Learning of Asymptotic Variational Objectives**|Alessandro Mastrototaro et.al.|[2411.02217](http://arxiv.org/abs/2411.02217)|null|一般状态空间模型（SSM）在统计机器学习中被广泛应用，是序列时间序列数据中最经典的生成模型之一。SSM包含潜在的马尔可夫状态，可以进行变分推理（VI），但如重要性加权自动编码器（IWAE）这样的标准VI方法缺乏处理流数据的功能。为了在观测数据实时到达时能够进行在线VI，我们提出通过随机逼近法最大化一种基于IWAE类型的变分下界的目标函数，而不是使用标准的IWAE ELBO。与直接最大化渐近对比函数的递归最大似然方法不同，我们的方法称为在线序列IWAE（OSIWAE），允许在线学习模型参数和用于推断潜在状态的马尔可夫识别模型。通过使用顺序蒙特卡洛（SMC）方法来近似滤波状态后验及其导数，我们为SSM中的在线VI创建了一个基于粒子的框架。这种方法比最近提出的在线变分SMC方法具有更坚实的理论基础。我们提供了关于学习目标的严格理论结果，并通过数值研究展示了该方法在学习模型参数和粒子提议核方面的效率。|\n", "2411.01030": "|**2024-11-07**|**Birdie: Advancing State Space Models with Reward-Driven Objectives and Curricula**|Sam Blouir et.al.|[2411.01030](http://arxiv.org/abs/2411.01030)|**[link](https://github.com/samblouir/birdie)**|**高效的时序模型（SSMs），例如线性循环神经网络和线性注意力变体，相比Transformer具有计算上的优势，但在需要长距离上下文检索的任务中表现不佳，如文本复制、联想回忆和长上下文问答。以往解决这些挑战的努力主要集中在架构修改上，但往往重新引入了计算效率问题。在本文中，我们提出了一种新的训练方法Birdie，该方法能够显著增强SSMs的上下文检索能力，而无需改变其架构。我们的方法结合了双向输入处理与通过强化学习优化的动态混合专业预训练目标。我们引入了一种新的双向SSM架构，可以无缝地从双向上下文处理过渡到因果生成。实验评估表明，Birdie在多号码电话簿查找、长段落问答和填充等检索密集型任务上显著提高了性能，缩小了与Transformer的性能差距，同时保持了计算效率。我们的发现强调了训练过程在利用SSMs固定状态容量方面的重要性，为提升其能力提供了新方向。所有代码和预训练模型可在https://www.github.com/samblouir/birdie获取，支持JAX和PyTorch。**|\n", "2411.00233": "|**2024-10-31**|**SambaMixer: State of Health Prediction of Li-ion Batteries using Mamba State Space Models**|José Ignacio Olalde-Verano et.al.|[2411.00233](http://arxiv.org/abs/2411.00233)|**[link](https://github.com/sascha-kirch/samba-mixer)**|\n", "2411.00218": "|**2024-10-31**|**Nudging state-space models for Bayesian filtering under misspecified dynamics**|Fabian Gonzalez et.al.|[2411.00218](http://arxiv.org/abs/2411.00218)|null|\n", "2411.00151": "|**2024-10-31**|**NIMBA: Towards Robust and Principled Processing of Point Clouds With SSMs**|Nursena Köprücü et.al.|[2411.00151](http://arxiv.org/abs/2411.00151)|null|\n", "2410.23882": "|**2024-10-31**|**In-Context Learned Equalization in Cell-Free Massive MIMO via State-Space Models**|Zihang Song et.al.|[2410.23882](http://arxiv.org/abs/2410.23882)|null|\n", "2410.19382": "|**2024-10-28**|**Multi-Agent Reinforcement Learning with Selective State-Space Models**|Jemma Daniel et.al.|[2410.19382](http://arxiv.org/abs/2410.19382)|null|\n", "2411.04760": "|**2024-11-07**|**Zero-Shot Temporal Resolution Domain Adaptation for Spiking Neural Networks**|Sanja Karilanova et.al.|[2411.04760](http://arxiv.org/abs/2411.04760)|null|脉冲神经网络（SNNs）是一种受生物启发的深度神经网络，能够高效提取时间信息，并在部署于神经形态设备上时提供显著的能量效率和延迟优势。然而，SNN模型参数对时间分辨率非常敏感，当边缘的目标数据的时间分辨率与用于训练的预部署源数据的时间分辨率不同时，尤其是在边缘无法进行微调的情况下，会导致性能大幅下降。为了解决这一挑战，我们提出了三种新的领域适应方法，以适应由于时间分辨率变化引起的神经元参数变化，而无需在目标时间分辨率下重新训练。所提出的方法基于SNN中神经元动态与状态空间模型（SSMs）之间的映射，并适用于一般的神经元模型。我们在时空数据任务上评估了所提出的方法，包括音频关键词识别数据集SHD和MSWC以及图像分类NMINST数据集。我们的方法提供了现有参考方法（简单地缩放时间常数）之外的一种替代方案，并且在大多数情况下显著优于现有方法。此外，我们的结果表明，通过在较低时间分辨率数据上进行时间高效的训练和模型适应，可以在高时间分辨率数据上获得高精度。|\n", "2411.04165": "|**2024-11-06**|**Bio-xLSTM: Generative modeling, representation and in-context learning of biological and chemical sequences**|Niklas Schmidinger et.al.|[2411.04165](http://arxiv.org/abs/2411.04165)|**[link](https://github.com/ml-jku/chem-xlstm)**|**生物和化学序列的语言模型能够支持药物发现、蛋白质工程和精准医疗等关键应用。目前，这些语言模型主要基于Transformer架构。尽管Transformer取得了令人印象深刻的结果，但其运行时间对序列长度的二次依赖性使得它们在处理长基因组序列以及蛋白质和化学序列的上下文学习时变得复杂。最近，循环xLSTM架构在自然语言领域中的表现已被证明优于Transformer和现代状态空间模型（SSM）架构。类似于SSM，xLSTM对序列长度具有线性的运行时间依赖性，并允许在推理时进行常数内存解码，这使它们成为建模生物和化学序列中长距离依赖关系的理想选择。在这项工作中，我们针对这些领域定制了xLSTM，并提出了一系列称为Bio-xLSTM的架构变体。我们在基因组学、蛋白质和化学三个大领域进行了广泛的实验，以评估xLSTM建模生物和化学序列的能力。结果表明，基于Bio-xLSTM的模型a)可以作为DNA、蛋白质和化学序列的有效生成模型，b)为这些模态学习丰富的表示，c)可以对蛋白质和小分子进行上下文学习。**|\n", "2411.06968": "|**2024-11-11**|**Mamba-based Decoder-Only Approach with Bidirectional Speech Modeling for Speech Recognition**|Yoshiki Masuyama et.al.|[2411.06968](http://arxiv.org/abs/2411.06968)|**[link](https://github.com/YoshikiMas/madeon-asr)**|**选择性状态空间模型（SSM）由Mamba表示，在各种任务中展示了其计算效率和有希望的结果，包括自动语音识别（ASR）。Mamba已被应用于基于注意力的编码器-解码器框架中的ASR任务，其中保持了编码器和解码器之间的交叉注意力机制。本文探讨了Mamba作为仅解码器架构在ASR任务中的能力。我们的基于MAmba的仅解码器方法（MADEON）由单个解码器组成，该解码器以语音标记为条件并以自回归方式预测文本标记。为了增强MADEON，我们进一步提出了语音前缀处理，它对语音标记进行双向处理，从而丰富隐藏状态中的上下文信息。实验表明，MADEON显著优于非选择性SSM。将语音前缀处理与最近提出的Mamba-2结合使用，在大型数据集上表现出与基于Transformer的模型相当的性能。**|\n", "2411.06318": "|**2024-11-10**|**SEM-Net: Efficient Pixel Modelling for image inpainting with Spatially Enhanced SSM**|Shuang Chen et.al.|[2411.06318](http://arxiv.org/abs/2411.06318)|**[link](https://github.com/chrischen1023/sem-net)**|**图像修复旨在基于已知区域的信息修复部分损坏的图像。实现语义上合理的修复结果尤其具有挑战性，因为它要求重建的区域展示出与语义一致区域相似的模式。这需要一个能够捕捉长距离依赖关系的强大模型。现有的模型在这方面存在困难，因为基于卷积神经网络（CNN）的方法的感受野增长缓慢，而基于Transformer的方法仅在块级别进行交互，这两种方法都难以有效捕捉长距离依赖关系。为此，我们提出了SEM-Net，这是一种新颖的视觉状态空间模型（SSM）视觉网络，在像素级别对损坏图像进行建模，同时在状态空间中捕捉长距离依赖关系，实现了线性的计算复杂度。为了解决SSM固有的空间感知不足问题，我们引入了蛇曼巴块（SMB）和空间增强前馈网络。这些创新使SEM-Net在两个不同的数据集上超越了最先进的修复方法，显著提高了长距离依赖关系的捕捉能力和空间一致性。此外，SEM-Net在运动去模糊任务上也达到了最先进的性能，展示了其通用性。我们的源代码将在https://github.com/ChrisChen1023/SEM-Net发布。**|\n", "2411.07364": "|**2024-11-11**|**AEROMamba: An efficient architecture for audio super-resolution using generative adversarial networks and state space models**|Wallace Abreu et.al.|[2411.07364](http://arxiv.org/abs/2411.07364)|null|音频超分辨率旨在通过创建高频内容来增强低分辨率信号。在这项工作中，我们修改了AERO（一种用于此任务的最先进系统）的架构，以实现音乐超分辨率。具体来说，我们在所有网络层中用Mamba（一种状态空间模型）替换了其原有的注意力机制和LSTM层。Mamba能够有效地替代这些模块，因为它提供了一种类似于注意力机制的功能，并且也可以作为递归网络工作。通过提出的AEROMamba，在训练过程中所需的GPU内存减少了2-4倍，因为Mamba利用了卷积公式并利用了GPU内存层次结构。此外，在推理过程中，由于递归性，Mamba在常数内存下运行，避免了与注意力机制相关的内存增长问题。这使得使用更少的GPU（减少5倍）时速度提高了14倍。主观听力测试（0到100分制）表明，所提出的模型优于AERO模型。在MUSDB数据集中，降质信号得分为38.22，而AERO和AEROMamba分别得分为60.03和66.74。对于PianoEval数据集，降质信号得分为72.92，AERO得分为76.89，AEROMamba得分为84.41。|\n"}, "Communication Intelligence": {"2410.03688": "|**2024-09-21**|**LLM Agents as 6G Orchestrator: A Paradigm for Task-Oriented Physical-Layer Automation**|Zhuoran Xiao et.al.|[2410.03688](http://arxiv.org/abs/2410.03688)|null|生成式预训练模型的快速发展正在推动技术进步从基础应用如聊天机器人向更复杂的基于代理的系统转变。将6G系统与大型语言模型（LLM）代理和数字孪生（DT）相结合，对于管理具有新出现特性（如原生AI服务和感知）的高度复杂通信系统来说，既具有巨大潜力也是必要的。通过6G导向的代理，基站能够理解各种动态上层任务的传输需求，并自动编排最优系统工作流程。通过不断从6G DT获取反馈进行强化，这些代理最终可以相应地提高实际系统的性能。与为通用应用设计的现有LLM代理不同，6G导向的代理旨在利用大量的额外专业知识来进行高度严谨和精确的规划，这不可避免地要求从模型训练到实施的具体系统设计。本文提出了一种构建面向任务的6G LLM代理的新综合方法。我们首先提出了一种两阶段持续预训练和微调方案，以建立领域基础模型及多种专门化的专家模型，以满足各种应用场景的需求。此外，还提出了一种基于语义检索的新推理框架，以利用现有的通信相关功能。物理层任务分解等示例任务的实验结果表明了所提范式的可行性和有效性。|\n"}, "RAG": {"2411.03957": "|**2024-11-06**|**Fine-Grained Guidance for Retrievers: Leveraging LLMs' Feedback in Retrieval-Augmented Generation**|Yuhang Liu et.al.|[2411.03957](http://arxiv.org/abs/2411.03957)|null|\n", "2411.03920": "|**2024-11-06**|**RAGulator: Lightweight Out-of-Context Detectors for Grounded Text Generation**|Ian Poey et.al.|[2411.03920](http://arxiv.org/abs/2411.03920)|null|\n", "2411.03572": "|**2024-11-06**|**Advanced RAG Models with Graph Structures: Optimizing Complex Knowledge Reasoning and Text Generation**|Yuxin Dong et.al.|[2411.03572](http://arxiv.org/abs/2411.03572)|null|\n", "2411.03538": "|**2024-11-05**|**Long Context RAG Performance of Large Language Models**|Quinn Leng et.al.|[2411.03538](http://arxiv.org/abs/2411.03538)|null|\n", "2411.02959": "|**2024-11-05**|**HtmlRAG: HTML is Better Than Plain Text for Modeling Retrieved Knowledge in RAG Systems**|Jiejun Tan et.al.|[2411.02959](http://arxiv.org/abs/2411.02959)|**[link](https://github.com/plageon/HtmlRAG)**|\n", "2411.02937": "|**2024-11-06**|**Benchmarking Multimodal Retrieval Augmented Generation with Dynamic VQA Dataset and Self-adaptive Planning Agent**|Yangning Li et.al.|[2411.02937](http://arxiv.org/abs/2411.02937)|**[link](https://github.com/alibaba-nlp/omnisearch)**|\n", "2411.02850": "|**2024-11-05**|**WASHtsApp -- A RAG-powered WhatsApp Chatbot for supporting rural African clean water access, sanitation and hygiene**|Simon Kloker et.al.|[2411.02850](http://arxiv.org/abs/2411.02850)|null|\n", "2411.02832": "|**2024-11-06**|**PersianRAG: A Retrieval-Augmented Generation System for Persian Language**|Hossein Hosseini et.al.|[2411.02832](http://arxiv.org/abs/2411.02832)|null|\n", "2411.02657": "|**2024-11-04**|**Zebra-Llama: A Context-Aware Large Language Model for Democratizing Rare Disease Knowledge**|Karthik Soman et.al.|[2411.02657](http://arxiv.org/abs/2411.02657)|**[link](https://github.com/karthiksoman/zebra-Llama)**|\n", "2411.02617": "|**2024-11-04**|**TeleOracle: Fine-Tuned Retrieval-Augmented Generation with Long-Context Support for Network**|Nouf Alabbasi et.al.|[2411.02617](http://arxiv.org/abs/2411.02617)|**[link](https://github.com/Nouf-Alabbasi/oKUmura_AI_Telecom_challenge)**|\n", "2411.04952": "|**2024-11-07**|**M3DocRAG: Multi-modal Retrieval is What You Need for Multi-page Multi-document Understanding**|Jaemin Cho et.al.|[2411.04952](http://arxiv.org/abs/2411.04952)|null|\n", "2411.04476": "|**2024-11-07**|**LLM-R: A Framework for Domain-Adaptive Maintenance Scheme Generation Combining Hierarchical Agents and RAG**|Laifa Tao et.al.|[2411.04476](http://arxiv.org/abs/2411.04476)|null|\n", "2411.04473": "|**2024-11-07**|**ML-Promise: A Multilingual Dataset for Corporate Promise Verification**|Yohei Seki et.al.|[2411.04473](http://arxiv.org/abs/2411.04473)|null|\n", "2411.04459": "|**2024-11-07**|**GPT-Guided Monte Carlo Tree Search for Symbolic Regression in Financial Fraud Detection**|Prashank Kadam et.al.|[2411.04459](http://arxiv.org/abs/2411.04459)|null|\n", "2411.04341": "|**2024-11-07**|**Enhancing classroom teaching with LLMs and RAG**|Elizabeth A Mullins et.al.|[2411.04341](http://arxiv.org/abs/2411.04341)|null|\n", "2411.04284": "|**2024-11-06**|**Enhancing Security Control Production With Generative AI**|Chen Ling et.al.|[2411.04284](http://arxiv.org/abs/2411.04284)|null|\n", "2411.05764": "|**2024-11-08**|**FinDVer: Explainable Claim Verification over Long and Hybrid-Content Financial Documents**|Yilun Zhao et.al.|[2411.05764](http://arxiv.org/abs/2411.05764)|null|\n", "2411.05442": "|**2024-11-08**|**IntellBot: Retrieval Augmented LLM Chatbot for Cyber Threat Knowledge Delivery**|Dincy R. Arikkat et.al.|[2411.05442](http://arxiv.org/abs/2411.05442)|null|\n", "2411.05349": "|**2024-11-08**|**Enhancing Cluster Resilience: LLM-agent Based Autonomous Intelligent Cluster Diagnosis System and Evaluation Framework**|Honghao Shi et.al.|[2411.05349](http://arxiv.org/abs/2411.05349)|null|\n", "2411.05285": "|**2024-11-08**|**A Taxonomy of AgentOps for Enabling Observability of Foundation Model based Agents**|Liming Dong et.al.|[2411.05285](http://arxiv.org/abs/2411.05285)|null|\n", "2411.05185": "|**2024-11-07**|**PentestAgent: Incorporating LLM Agents to Automated Penetration Testing**|Xiangmin Shen et.al.|[2411.05185](http://arxiv.org/abs/2411.05185)|null|\n", "2411.05141": "|**2024-11-07**|**Audiobox TTA-RAG: Improving Zero-Shot and Few-Shot Text-To-Audio with Retrieval-Augmented Generation**|Mu Yang et.al.|[2411.05141](http://arxiv.org/abs/2411.05141)|null|\n", "2411.07238": "|**2024-11-11**|**OpenThaiGPT 1.5: A Thai-Centric Open Source Large Language Model**|Sumeth Yuenyong et.al.|[2411.07238](http://arxiv.org/abs/2411.07238)|null|\n", "2411.07156": "|**2024-11-11**|**A Primer on Word Embeddings: AI Techniques for Text Analysis in Social Work**|Brian E. Perron et.al.|[2411.07156](http://arxiv.org/abs/2411.07156)|null|\n", "2411.07091": "|**2024-11-11**|**Impact of LLM-based Review Comment Generation in Practice: A Mixed Open-/Closed-source User Study**|Doriane Olewicki et.al.|[2411.07091](http://arxiv.org/abs/2411.07091)|null|\n", "2411.07021": "|**2024-11-11**|**Invar-RAG: Invariant LLM-aligned Retrieval for Better Generation**|Ziwei Liu et.al.|[2411.07021](http://arxiv.org/abs/2411.07021)|null|\n", "2411.06805": "|**2024-11-11**|**AssistRAG: Boosting the Potential of Large Language Models with an Intelligent Information Assistant**|Yujia Zhou et.al.|[2411.06805](http://arxiv.org/abs/2411.06805)|**[link](https://github.com/smallporridge/assistrag)**|\n", "2411.06558": "|**2024-11-10**|**Region-Aware Text-to-Image Generation via Hard Binding and Soft Refinement**|Zhennan Chen et.al.|[2411.06558](http://arxiv.org/abs/2411.06558)|**[link](https://github.com/nju-pcalab/rag-diffusion)**|\n", "2411.06493": "|**2024-11-10**|**LProtector: An LLM-driven Vulnerability Detection System**|Ze Sheng et.al.|[2411.06493](http://arxiv.org/abs/2411.06493)|null|\n", "2411.06237": "|**2024-11-09**|**Leveraging Retrieval-Augmented Generation for University Knowledge Retrieval**|Arshia Hemmat et.al.|[2411.06237](http://arxiv.org/abs/2411.06237)|null|\n", "2411.06207": "|**2024-11-09**|**Exploring Knowledge Boundaries in Large Language Models for Retrieval Judgment**|Zhen Zhang et.al.|[2411.06207](http://arxiv.org/abs/2411.06207)|null|\n", "2411.06175": "|**2024-11-09**|**Clustering Algorithms and RAG Enhancing Semi-Supervised Text Classification with Large LLMs**|Shan Zhong et.al.|[2411.06175](http://arxiv.org/abs/2411.06175)|null|\n", "2411.07870": "|**2024-11-12**|**Trustful LLMs: Customizing and Grounding Text Generation with Knowledge Bases and Dual Decoders**|Xiaofeng Zhu et.al.|[2411.07870](http://arxiv.org/abs/2411.07870)|null|\n", "2411.07820": "|**2024-11-12**|**Query Optimization for Parametric Knowledge Refinement in Retrieval-Augmented Large Language Models**|Youan Cong et.al.|[2411.07820](http://arxiv.org/abs/2411.07820)|null|\n", "2411.07773": "|**2024-11-12**|**Likelihood as a Performance Gauge for Retrieval-Augmented Generation**|Tianyu Liu et.al.|[2411.07773](http://arxiv.org/abs/2411.07773)|**[link](https://github.com/lyutyuh/poptimizer)**|\n", "2411.07739": "|**2024-11-12**|**Unlocking Legal Knowledge with Multi-Layered Embedding-Based Retrieval**|João Alberto de Oliveira Lima et.al.|[2411.07739](http://arxiv.org/abs/2411.07739)|null|\n", "2411.07688": "|**2024-11-12**|**Enhancing Ultra High Resolution Remote Sensing Imagery Analysis with ImageRAG**|Zilun Zhang et.al.|[2411.07688](http://arxiv.org/abs/2411.07688)|null|\n", "2411.07404": "|**2024-11-11**|**Controllable Context Sensitivity and the Knob Behind It**|Julian Minder et.al.|[2411.07404](http://arxiv.org/abs/2411.07404)|**[link](https://github.com/kdu4108/context-vs-prior-finetuning)**|\n", "2411.07396": "|**2024-11-11**|**Toward Optimal Search and Retrieval for RAG**|Alexandria Leto et.al.|[2411.07396](http://arxiv.org/abs/2411.07396)|null|\n", "2411.07360": "|**2024-11-11**|**ChatGPT Inaccuracy Mitigation during Technical Report Understanding: Are We There Yet?**|Salma Begum Tamanna et.al.|[2411.07360](http://arxiv.org/abs/2411.07360)|null|\n", "2411.08574": "|**2024-11-13**|**Practitioners' Discussions on Building LLM-based Applications for Production**|Alina Mailach et.al.|[2411.08574](http://arxiv.org/abs/2411.08574)|null|背景：大型语言模型（LLM）已经成为研究人员和实践者的重要兴趣点，但关于开发基于LLM系统的关键考虑因素的全面概述仍然缺乏。本研究通过收集并整理在线讨论的主题来填补这一空白，为开发基于LLM的应用提供了实用见解。方法：我们从2022年至2024年间收集了189个视频，这些视频来自积极开发此类系统的实践者，并讨论了在开发和部署生产环境中的LLM时遇到的各种方面。我们使用BERTopic分析了转录文本，然后手动对生成的主题进行了分类和合并，最终形成了8个主题下的20个话题。结果：最普遍的话题属于设计与架构主题，其中特别关注检索增强生成（RAG）系统。其他常讨论的话题包括模型能力与增强技术（如微调、提示工程）、基础设施与工具以及风险与伦理挑战。影响：我们的结果突出了当前在生产环境中部署LLM的讨论和挑战。通过这种方式，我们为开发基于LLM应用的关键方面提供了一个系统性的概览。此外，我们也指出了学术界感兴趣且需要进一步研究的话题。|\n", "2411.08469": "|**2024-11-13**|**Building Trustworthy AI: Transparent AI Systems via Large Language Models, Ontologies, and Logical Reasoning (TranspNet)**|Fadi Al Machot et.al.|[2411.08469](http://arxiv.org/abs/2411.08469)|null|随着对人工智能缺乏透明度的担忧日益增加，特别是在医疗保健和金融等高风险领域，需要开发可解释且值得信赖的系统。虽然大型语言模型（LLM）在生成准确输出方面表现出色，但其“黑盒”性质给透明度和信任带来了重大挑战。为了解决这一问题，本文提出了TranspNet流水线，该流水线将符号AI与LLM相结合。通过利用领域专家知识、检索增强生成（RAG）以及像答案集编程（ASP）这样的形式推理框架，TranspNet通过结构化推理和验证来增强LLM的输出。这种方法确保了AI系统不仅提供准确的结果，还提供可解释性和可信性，满足了对透明度和责任性的监管要求。TranspNet为开发可靠且可解释的AI系统提供了全面的解决方案，使其适用于信任至关重要的实际应用中。|\n", "2411.08449": "|**2024-11-13**|**Towards Evaluating Large Language Models for Graph Query Generation**|Siraj Munir et.al.|[2411.08449](http://arxiv.org/abs/2411.08449)|null|大型语言模型（LLMs）正在革新生成式人工智能（GenAI）的领域，基于LLM的创新解决方案迅速涌现。然而，在应用于数据库技术，特别是图数据库和知识图谱（KGs）的查询生成时，LLM仍然面临重大挑战。虽然关于LLM驱动的结构化查询语言（SQL）查询生成的研究已经存在，但对于图数据库类似系统的开发仍显不足。本文通过比较研究，探讨了使用开放访问的LLM生成Cypher查询这一强大图数据库交互语言所面临的挑战。我们采用精心设计的小样本学习提示与由思维链（CoT）推理支持的检索增强生成（RAG），对多个LLM代理（OpenAI ChatGPT 4.0、Claude Sonnet 3.5、Google Gemini Pro 1.5以及本地部署的Llama 3.1 8B）进行了严格的评估。我们的实证分析显示，在此特定领域内，Claude Sonnet 3.5的表现优于其同行。此外，我们还指出了有前景的未来研究方向，以解决已识别的局限性并推进LLM驱动的图数据库查询生成技术的发展。|\n", "2411.08438": "|**2024-11-13**|**Towards Optimizing a Retrieval Augmented Generation using Large Language Model on Academic Data**|Anum Afzal et.al.|[2411.08438](http://arxiv.org/abs/2411.08438)|null|鉴于许多组织正在将检索增强生成（RAG）整合到其运营中的趋势，我们评估了RAG在特定领域数据上的表现，并测试了各种优化技术下的最先进模型。我们结合了四种优化方法：多查询、父子检索器、集成检索器和上下文学习，以提高学术领域中的功能和性能。我们专注于数据检索，特别是针对一所大型技术大学的各种学习项目的数据检索。此外，我们引入了一种新的评估方法——RAG混淆矩阵，旨在评估RAG框架内不同配置的有效性。通过探索开源（如Llama2、Mistral）和闭源（GPT-3.5和GPT-4）大型语言模型的集成应用，我们为RAG框架在特定领域背景下的应用与优化提供了有价值的见解。我们的实验表明，在检索阶段加入多查询可以显著提高性能。|\n", "2411.08348": "|**2024-11-13**|**Refining Translations with LLMs: A Constraint-Aware Iterative Prompting Approach**|Shangfeng Chen et.al.|[2411.08348](http://arxiv.org/abs/2411.08348)|null|大型语言模型（LLMs）在机器翻译（MT）方面展现了卓越的能力，即使没有针对特定语言的专门训练也是如此。然而，在低资源或领域特定的上下文中翻译罕见词汇对LLMs来说仍然是一个挑战。为了解决这个问题，我们提出了一种多步骤提示链，通过优先处理对语义准确性至关重要的关键词来提高翻译的忠实度。我们的方法首先识别这些关键词，并从双语词典中检索它们的翻译，然后利用检索增强生成（RAG）将这些翻译整合到LLM的上下文中。我们还通过一种迭代自检机制来减轻由于长提示可能导致的输出幻觉问题，该机制让LLM根据词汇和语义约束来改进其翻译。使用Llama和Qwen作为基础模型在FLORES-200和WMT数据集上的实验表明，与基线相比，我们的方法显著提高了翻译的忠实度和鲁棒性，特别是在低资源场景下。|\n", "2411.08324": "|**2024-11-13**|**Are LLMs Prescient? A Continuous Evaluation using Daily News as the Oracle**|Hui Dai et.al.|[2411.08324](http://arxiv.org/abs/2411.08324)|null|许多现有的大型语言模型（LLM）评估基准由于新模型和训练数据的出现而迅速过时。这些基准也未能评估LLM随时间变化的表现，因为它们由没有时间维度的静态问题组成。为了解决这些局限性，我们提出使用未来事件预测作为持续评估方法，以评估LLM的时间泛化和预测能力。我们的基准“每日预言”从每日新闻中自动生成问答对，挑战LLM预测“未来”事件的结果。我们的研究发现，随着预训练数据变得过时，LLM的表现会随着时间的推移而下降。虽然检索增强生成（RAG）有潜力提高预测准确性，但性能下降的模式仍然存在，这突显了持续更新模型的必要性。|\n", "2411.08275": "|**2024-11-13**|**A Large-Scale Study of Relevance Assessments with Large Language Models: An Initial Look**|Shivani Upadhyay et.al.|[2411.08275](http://arxiv.org/abs/2411.08275)|null|\n", "2411.08249": "|**2024-11-12**|**Retrieval Augmented Time Series Forecasting**|Kutay Tire et.al.|[2411.08249](http://arxiv.org/abs/2411.08249)|**[link](https://github.com/kutaytire/retrieval-augmented-time-series-forecasting)**|\n", "2411.08148": "|**2024-11-12**|**Adaptive Meta-Learning for Robust Deepfake Detection: A Multi-Agent Framework to Data Drift and Model Generalization**|Dinesh Srivasthav P et.al.|[2411.08148](http://arxiv.org/abs/2411.08148)|**[link](https://github.com/dineshsrivasthav/adaptive_meta_learning_with_multi_agent_framework)**|\n", "2411.09607": "|**2024-11-14**|**Initial Nugget Evaluation Results for the TREC 2024 RAG Track with the AutoNuggetizer Framework**|Ronak Pradeep et.al.|[2411.09607](http://arxiv.org/abs/2411.09607)|null|本报告提供了TREC 2024检索增强生成（RAG）赛道的部分初步结果。我们已将RAG评估确定为信息访问（以及更广泛的自然语言处理和人工智能领域）持续进展的一个障碍，并希望通过我们的工作来应对这一领域的诸多挑战。我们在本研究中探讨的核心假设是，最初为2003年TREC问答赛道开发的金块评价方法为评估RAG系统提供了一个坚实的基础。因此，我们的努力集中在“重构”这种方法上，具体来说就是利用大型语言模型自动创建金块并将金块自动分配给系统的答案。我们将这个框架称为AutoNuggetizer。在TREC设置下，我们能够将完全自动的过程与半手动过程进行校准，在该过程中金块由人工评估者半手动创建并手动分配给系统答案。基于对来自45次运行的21个主题的初步结果分析，我们观察到从全自动金块评价得出的分数与人工评估者通过（大部分）手动金块评价得出的分数之间存在强相关性。这表明我们的全自动评价过程可以用于指导未来RAG系统的迭代。|\n", "2411.09590": "|**2024-11-14**|**Adopting RAG for LLM-Aided Future Vehicle Design**|Vahid Zolfaghari et.al.|[2411.09590](http://arxiv.org/abs/2411.09590)|null|在这篇论文中，我们探讨了将大型语言模型（LLMs）与检索增强生成（RAG）相结合，以提升汽车行业的自动化设计和软件开发。我们展示了两个案例研究：一个标准化合规聊天机器人和一个设计副驾，两者都利用RAG提供准确、情境感知的响应。我们评估了四种LLM——GPT-4o、LLAMA3、Mistral和Mixtral，比较了它们的回答准确性和执行时间。结果表明，虽然GPT-4表现出色，但LLAMA3和Mistral也显示出在本地部署方面的潜力，解决了汽车行业中的数据隐私问题。本研究突出了RAG增强型LLM在改善汽车工程设计流程和合规性方面的潜力。|\n", "2411.09269": "|**2024-11-14**|**Harnessing multiple LLMs for Information Retrieval: A case study on Deep Learning methodologies in Biodiversity publications**|Vamsi Krishna Kommineni et.al.|[2411.09269](http://arxiv.org/abs/2411.09269)|null|深度学习（DL）技术在各个领域的科学研究中越来越被广泛应用，以解决复杂的研究问题。然而，这些DL模型的方法细节往往隐藏在非结构化的文本中，使得关于这些模型如何设计、训练和评估的关键信息难以访问和理解。为了解决这个问题，在这项工作中，我们使用了五种不同的开源大型语言模型（LLM）：Llama-3 70B、Llama-3.1 70B、Mixtral-8x22B-Instruct-v0.1、Mixtral 8x7B 和 Gemma 2 9B 结合检索增强生成（RAG）方法，从科学出版物中自动提取并处理DL的方法细节。我们基于这五个LLM的输出构建了一个投票分类器，以准确报告DL方法信息。我们使用生物多样性出版物测试了我们的方法，这是基于我们之前的研究。为了验证我们的流程，我们采用了两个与DL相关的生物多样性出版物数据集：一个是我们先前工作中整理的100篇出版物集合，另一个是从《生态信息学》期刊中选取的364篇出版物集合。结果显示，多LLM结合RAG辅助的流程增强了DL方法信息的检索效果，仅基于出版物中的文本内容就达到了69.5%（600次比较中有417次正确）的准确率。这一性能是相对于那些能够访问代码、图表、表格和其他补充信息的人工注释者进行评估的。尽管本研究是在生物多样性领域展示的，但该方法论不限于此领域；它可以应用于其他需要详细方法报道以促进知识进步和确保可重复性的科学领域。本研究提出了一种可扩展且可靠的自动化信息提取方法，促进了跨研究的知识转移和更好的可重复性。|\n", "2411.09213": "|**2024-11-14**|**Comprehensive and Practical Evaluation of Retrieval-Augmented Generation Systems for Medical Question Answering**|Nghia Trung Ngo et.al.|[2411.09213](http://arxiv.org/abs/2411.09213)|null|检索增强生成（RAG）已成为一种有前景的方法，用于提高大型语言模型（LLMs）在知识密集型任务（如医学领域任务）中的性能。然而，医学领域的敏感性质要求系统必须完全准确且值得信赖。虽然现有的RAG基准测试主要关注标准的检索-回答设置，但它们忽略了衡量可靠医学系统的许多实际场景。本文通过提供一个全面的评估框架来填补这一空白，该框架用于RAG设置下的医学问答（QA）系统，涵盖充分性、整合性和鲁棒性等多个方面。我们引入了医学检索增强生成基准（MedRGB），为四个医学QA数据集提供了多种补充元素，以测试LLMs处理这些特定场景的能力。利用MedRGB，我们在多种检索条件下对最先进的商业LLMs和开源模型进行了广泛评估。我们的实验结果揭示了当前模型在处理检索文档中的噪声和错误信息方面的有限能力。我们进一步分析了LLMs的推理过程，为开发这一关键医学领域的RAG系统提供了宝贵的见解和未来方向。|\n"}, "text2sql": {"2411.02948": "|**2024-11-05**|**Grounding Natural Language to SQL Translation with Data-Based Self-Explanations**|Yuankai Fan et.al.|[2411.02948](http://arxiv.org/abs/2411.02948)|**[link](https://github.com/Kaimary/CycleSQL)**|**自然语言接口使非技术用户能够使用自然语言（NL）与数据进行交互。先进的方法通常利用神经序列到序列模型或更近期的大规模复杂语言模型，以端到端的方式实现从自然语言到SQL（NL2SQL）的转换。然而，就像人类一样，这些端到端的翻译模型可能不会总是在第一次尝试时就生成最佳的SQL输出。在这篇论文中，我们提出了CycleSQL，这是一个为端到端翻译模型设计的迭代框架，旨在通过自我评估自动生成最佳输出。CycleSQL的核心思想是引入基于数据的查询结果自然语言解释作为自我提供的反馈，并利用该反馈来迭代验证翻译的正确性，从而提高整体翻译准确性。为了研究CycleSQL，我们在五个广泛使用的基准测试上对七种现有翻译模型进行了广泛的实验，包括定量和定性评估。结果显示：1) CycleSQL引入的反馈循环可以持续提升现有模型的表现，特别是当将CycleSQL应用于REDSQL时，在Spider基准测试的验证集上获得了82.0%（+2.6%）的翻译准确率，在测试集上获得了81.6%（+3.2%）的翻译准确率；2) 生成的自然语言解释还能为用户提供有价值的见解，帮助理解翻译结果，从而增强NL2SQL翻译的可解释性。**|\n", "2410.22925": "|**2024-10-30**|**BIS: NL2SQL Service Evaluation Benchmark for Business Intelligence Scenarios**|Bora Caglayan et.al.|[2410.22925](http://arxiv.org/abs/2410.22925)|**[link](https://github.com/boracaglayan/bis-nl2sql)**|**近年来，自然语言到结构化查询语言（NL2SQL）的转换在商业智能（BI）应用中得到了广泛的应用。然而，现有的NL2SQL基准并不适用于生产环境中的BI场景，因为它们并不是为常见的商业智能问题而设计的。为了解决这一差距，我们开发了一个新的基准，专注于工业BI场景中典型的自然语言问题。我们讨论了构建一个面向BI的基准所面临的挑战以及现有基准的不足之处。此外，我们在基准中引入了一些问题类别，这些类别反映了常见的BI询问。最后，我们提出了两种新的语义相似度评估指标，用于评估BI应用程序和服务中的NL2SQL能力。**|\n", "2410.11457": "|**2024-10-15**|**LR-SQL: A Supervised Fine-Tuning Method for Text2SQL Tasks under Low-Resource Scenarios**|Wen Wuzhenghong et.al.|[2410.11457](http://arxiv.org/abs/2410.11457)|**[link](https://github.com/hongwin/lr-sql)**|**大型语言模型通过监督微调在Text2SQL领域带来了革命性的变化，但一个关键的限制被忽视了：数据库的复杂性导致上下文长度增加，从而增加了模型微调时对GPU内存的需求。为了解决这个问题，我们提出了LR-SQL。LR-SQL包含两个监督微调模型：schema_link模型和SQL_generation模型，其中schema_link模型是整个过程中简化流程的核心。在对schema_link模型进行微调时，LR-SQL将完整的数据库分解成具有可调节数量的表格组合，使模型能够从这些分散的片段中学习整个数据库内的关系。此外，为了增强模型在推理过程中感知不同离散片段之间关系的能力，LR-SQL训练了模型的Chain-of-Thought能力来完成此任务。实验结果表明，与现有的微调方法相比，LR-SQL可以将总GPU内存使用量减少40%，而在schema_link任务中的表预测准确性仅下降2%。对于整体Text2SQL任务，执行准确率仅下降0.6%。我们的项目现在可在https://github.com/hongWin/LR-SQL上获取。**|\n", "2408.14717": "|**2024-08-27**|**Text2SQL is Not Enough: Unifying AI and Databases with TAG**|Asim Biswal et.al.|[2408.14717](http://arxiv.org/abs/2408.14717)|**[link](https://github.com/tag-research/tag-bench)**|**能够通过自然语言查询数据库的人工智能系统有望解锁巨大的价值。这类系统允许用户利用语言模型（LMs）强大的推理和知识能力，同时结合数据管理系统可扩展的计算能力。这些综合能力将使用户能够对自定义数据源提出任意的自然语言问题。然而，现有的方法和基准测试未能充分探索这一领域。Text2SQL方法仅关注可以通过关系代数表达的自然语言问题，这仅代表了实际用户希望提出的问题的一小部分。同样地，检索增强生成（RAG）考虑的是可以通过对数据库中一个或少数几个数据记录进行点查找来回答的有限查询子集。我们提出了表增强生成（TAG），这是一种统一且通用的范式，用于回答基于数据库的自然语言问题。TAG模型涵盖了之前未被探索过的LM与数据库之间的广泛交互，并为利用LM在数据上的世界知识和推理能力创造了令人兴奋的研究机会。我们系统地开发了研究TAG问题的基准，并发现标准方法正确回答的问题不超过20%，这证实了该领域需要进一步的研究。我们在https://github.com/TAG-Research/TAG-Bench上发布了基准测试代码。**|\n", "2408.05109": "|**2024-11-03**|**A Survey of NL2SQL with Large Language Models: Where are we, and where are we going?**|Xinyu Liu et.al.|[2408.05109](http://arxiv.org/abs/2408.05109)|**[link](https://github.com/hkustdial/nl2sql_handbook)**|**将用户的自然语言查询（NL）转换为SQL查询（即NL2SQL）可以显著降低访问关系数据库的障碍，并支持各种商业应用。随着大型语言模型（LLMs）的出现，NL2SQL的性能得到了极大的提升。在这篇综述中，我们全面回顾了由LLMs驱动的NL2SQL技术，涵盖了从以下四个方面看其整个生命周期：(1) 模型：处理不仅包括自然语言的歧义和欠指定问题，还正确地将自然语言与数据库模式和实例映射的技术；(2) 数据：从训练数据的收集、因训练数据稀缺而进行的数据合成到NL2SQL基准测试；(3) 评估：使用不同的指标和粒度从多个角度评估NL2SQL方法；以及(4) 错误分析：分析NL2SQL错误以找到根本原因并指导NL2SQL模型的发展。此外，我们提供了一种开发NL2SQL解决方案的经验法则。最后，我们讨论了在LLM时代NL2SQL研究面临的挑战和开放问题。**|\n", "2407.21040": "|**2024-07-21**|**Towards Automated Data Sciences with Natural Language and SageCopilot: Practices and Lessons Learned**|Yuan Liao et.al.|[2407.21040](http://arxiv.org/abs/2407.21040)|null|尽管自然语言转SQL（NL2SQL）领域在将自然语言指令转换为可执行的SQL脚本以进行数据查询和处理方面取得了显著进展，但在更广泛的数据科学流程中实现完全自动化——包括数据查询、分析、可视化和报告——仍然是一个复杂的挑战。本研究介绍了SageCopilot，这是一个先进的、工业级系统，通过集成大型语言模型（LLMs）、自主代理（AutoAgents）和语言用户界面（LUIs）来自动化数据科学流程。具体来说，SageCopilot采用两阶段设计：在线组件通过上下文学习（ICL）细化用户的输入为可执行脚本，并运行这些脚本来报告结果并进行可视化；离线组件准备在线阶段ICL请求的演示。一系列流行策略如思维链和提示调优已被用来增强SageCopilot的性能。通过对真实世界数据集的严格测试和与基于提示解决方案的比较分析，SageCopilot已被实证验证在生成或执行脚本以及提供带有可视化的结果方面具有优越的端到端性能。我们的深入消融研究表明了SageCopilot使用的各种组件和策略对数据科学端到端正确性的个别贡献。|\n", "2406.07913": "|**2024-06-12**|**DeTriever: Decoder-representation-based Retriever for Improving NL2SQL In-Context Learning**|Yuxi Feng et.al.|[2406.07913](http://arxiv.org/abs/2406.07913)|null|尽管上下文学习（ICL）已被证明是提高大型语言模型（LLMs）在各种复杂任务中表现的有效技术，尤其是在将自然语言问题转换为结构化查询语言（NL2SQL）方面，但如何选择最有益的示例仍然是一个开放的研究问题。虽然先前的工作经常采用现成的编码器来动态检索示例，但在外部检索器和LLMs之间存在固有的表示能力差异。此外，优化示例选择是一项非平凡的任务，因为没有直接的方法可以在不进行成对推理的情况下评估示例的相对好处。为了解决这些问题，我们提出了DeTriever，这是一种新颖的演示检索框架，它学习了LLM隐藏状态的加权组合，其中编码了丰富的语义信息。为了训练模型，我们提出了一种代理分数，该分数基于输出查询之间的相似性来估计示例的相对好处。在两个流行的NL2SQL基准测试上的实验表明，我们的方法在一次性NL2SQL任务上显著优于最先进的基线。|\n", "2406.01265": "|**2024-07-27**|**The Dawn of Natural Language to SQL: Are We Fully Ready?**|Boyan Li et.al.|[2406.01265](http://arxiv.org/abs/2406.01265)|**[link](https://github.com/hkustdial/nl2sql360)**|**将用户的自然语言问题转换为SQL查询（即NL2SQL）显著降低了访问关系数据库的门槛。大型语言模型的出现为NL2SQL任务引入了新的范式，极大地增强了其能力。然而，这引发了一个关键问题：我们是否已经完全准备好将NL2SQL模型投入生产？ 为了解决这个问题，我们提出了一个多角度的NL2SQL评估框架NL2SQL360，以帮助研究人员设计和测试新的NL2SQL方法。通过NL2SQL360，我们在不同的应用场景下对领先的NL2SQL方法进行了详细比较，如不同的数据领域和SQL特性，为选择最适合特定需求的NL2SQL方法提供了宝贵的见解。此外，我们探索了NL2SQL的设计空间，利用NL2SQL360自动化地识别出针对用户特定需求的最佳NL2SQL解决方案。具体来说，NL2SQL360识别出一种有效的NL2SQL方法SuperSQL，在Spdier数据集上使用执行准确度指标表现出色。值得注意的是，SuperSQL在Spider和BIRD测试集上分别达到了87%和62.66%的执行准确度，表现出了竞争力。**|\n", "2405.00527": "|**2024-05-01**|**ChatBI: Towards Natural Language to Complex Business Intelligence SQL**|Jinqing Lian et.al.|[2405.00527](http://arxiv.org/abs/2405.00527)|null|自然语言到SQL（NL2SQL）技术为不熟悉数据库的非专家用户提供了一个使用SQL进行数据分析的机会。将自然语言转换为商业智能（NL2BI）是实际生产系统中NL2SQL的一个流行应用场景。与NL2SQL相比，NL2BI引入了更多的挑战。在这篇论文中，我们提出了ChatBI，一种全面且高效的技术来解决NL2BI任务。首先，我们分析了交互模式，这是NL2SQL和NL2BI在使用上一个重要的不同模块，并设计了一个更小、成本更低的模型以匹配这种交互模式。在BI场景中，表格包含大量的列，使得依赖大型语言模型（LLMs）进行模式链接的现有NL2SQL方法由于令牌限制而无法继续。BI场景中模糊列的比例更高也使模式链接变得更加困难。ChatBI结合了数据库社区现有的视图技术，首先将模式链接问题分解为单视图选择问题，然后使用一个更小、成本更低的机器学习模型来选择具有显著减少列数的单一视图。这个单一视图的列随后作为模式链接所需的列传递给LLM。最后，ChatBI提出了一种不同于现有流程的分阶段过程流，这使得ChatBI能够更准确地生成包含复杂语义和比较关系的SQL。我们已在百度的数据平台上部署了ChatBI，并将其集成到多条产品线中进行了大规模的生产任务评估。所获得的结果突出了其在实用性、通用性和效率方面的优越性。同时，在我们的真实BI场景数据表和查询下，与当前主流的NL2SQL技术相比，它也达到了最佳效果。|\n", "2403.20014": "|**2024-03-29**|**PURPLE: Making a Large Language Model a Better SQL Writer**|Tonghui Ren et.al.|[2403.20014](http://arxiv.org/abs/2403.20014)|null|\n", "2407.15186": "|**2024-11-07**|**A Survey on Employing Large Language Models for Text-to-SQL Tasks**|Liang Shi et.al.|[2407.15186](http://arxiv.org/abs/2407.15186)|null|随着关系数据库中数据量的不断增加以及编写SQL查询所需的专业知识，用户在访问和分析数据时面临挑战。Text-to-SQL（Text2SQL）通过利用自然语言处理（NLP）技术将自然语言转换为SQL查询来解决这些问题。随着大规模语言模型（LLMs）的发展，一系列基于LLM的Text2SQL方法应运而生。本综述全面回顾了基于LLM的Text2SQL任务中的基准数据集、提示工程方法、微调方法和基础模型。我们在每个部分都提供了见解，并讨论了该领域的未来方向。|\n"}, "AIOps": {}, "PPC": {"2411.04112": "|**2024-11-06**|**Fed-EC: Bandwidth-Efficient Clustering-Based Federated Learning For Autonomous Visual Robot Navigation**|Shreya Gummadi et.al.|[2411.04112](http://arxiv.org/abs/2411.04112)|null|\n", "2411.04002": "|**2024-11-06**|**Federated mixed effects logistic regression based on one-time shared summary statistics**|Marie Analiz April Limpoco et.al.|[2411.04002](http://arxiv.org/abs/2411.04002)|**[link](https://github.com/lizlimpocouhasselt/Mixed-effects-logistic-regression-from-summary-statistics)**|\n", "2411.03996": "|**2024-11-06**|**Towards Resource-Efficient Federated Learning in Industrial IoT for Multivariate Time Series Analysis**|Alexandros Gkillas et.al.|[2411.03996](http://arxiv.org/abs/2411.03996)|null|\n", "2411.03926": "|**2024-11-06**|**Act in Collusion: A Persistent Distributed Multi-Target Backdoor in Federated Learning**|Tao Liu et.al.|[2411.03926](http://arxiv.org/abs/2411.03926)|null|\n", "2411.03861": "|**2024-11-06**|**FedRISE: Rating Induced Sign Election of Gradients for Byzantine Tolerant Federated Aggregation**|Joseph Geo Benjamin et.al.|[2411.03861](http://arxiv.org/abs/2411.03861)|null|\n", "2411.03799": "|**2024-11-06**|**Overcoming label shift in targeted federated learning**|Edvin Listo Zec et.al.|[2411.03799](http://arxiv.org/abs/2411.03799)|null|\n", "2411.03746": "|**2024-11-06**|**Optimal Defenses Against Gradient Reconstruction Attacks**|Yuxiao Chen et.al.|[2411.03746](http://arxiv.org/abs/2411.03746)|**[link](https://github.com/cyx78/optimal_defenses_against_gradient_reconstruction_attacks)**|\n", "2411.03730": "|**2024-11-06**|**NeurIPS 2023 Competition: Privacy Preserving Federated Learning Document VQA**|Marlon Tobaben et.al.|[2411.03730](http://arxiv.org/abs/2411.03730)|null|\n", "2411.03636": "|**2024-11-06**|**Domain Generalization for Cross-Receiver Radio Frequency Fingerprint Identification**|Ying Zhang et.al.|[2411.03636](http://arxiv.org/abs/2411.03636)|null|\n", "2411.03569": "|**2024-11-06**|**Towards Personalized Federated Learning via Comprehensive Knowledge Distillation**|Pengju Wang et.al.|[2411.03569](http://arxiv.org/abs/2411.03569)|null|\n", "2411.04936": "|**2024-11-07**|**Fed-LDR: Federated Local Data-infused Graph Creation with Node-centric Model Refinement**|Jiechao Gao et.al.|[2411.04936](http://arxiv.org/abs/2411.04936)|null|\n", "2411.04692": "|**2024-11-07**|**Personalized Federated Learning for Cross-view Geo-localization**|Christos Anagnostopoulos et.al.|[2411.04692](http://arxiv.org/abs/2411.04692)|null|\n", "2411.04509": "|**2024-11-07**|**FedDP: Privacy-preserving method based on federated learning for histopathology image segmentation**|Liangrui Pan et.al.|[2411.04509](http://arxiv.org/abs/2411.04509)|null|\n", "2411.04159": "|**2024-11-06**|**Cooperation and Personalization on a Seesaw: Choice-based FL for Safe Cooperation in Wireless Networks**|Han Zhang et.al.|[2411.04159](http://arxiv.org/abs/2411.04159)|null|\n", "2411.05697": "|**2024-11-08**|**IPMN Risk Assessment under Federated Learning Paradigm**|Hongyi Pan et.al.|[2411.05697](http://arxiv.org/abs/2411.05697)|null|\n", "2411.05591": "|**2024-11-08**|**Network EM Algorithm for Gaussian Mixture Model in Decentralized Federated Learning**|Shuyuan Wu et.al.|[2411.05591](http://arxiv.org/abs/2411.05591)|null|\n", "2411.05260": "|**2024-11-08**|**QuanCrypt-FL: Quantized Homomorphic Encryption with Pruning for Secure Federated Learning**|Md Jueal Mia et.al.|[2411.05260](http://arxiv.org/abs/2411.05260)|null|\n", "2411.05173": "|**2024-11-07**|**DWFL: Enhancing Federated Learning through Dynamic Weighted Averaging**|Prakash Chourasia et.al.|[2411.05173](http://arxiv.org/abs/2411.05173)|null|\n", "2411.05167": "|**2024-11-07**|**EPIC: Enhancing Privacy through Iterative Collaboration**|Prakash Chourasia et.al.|[2411.05167](http://arxiv.org/abs/2411.05167)|null|\n", "2411.07224": "|**2024-11-11**|**TempCharBERT: Keystroke Dynamics for Continuous Access Control Based on Pre-trained Language Models**|Matheus Simão et.al.|[2411.07224](http://arxiv.org/abs/2411.07224)|null|\n", "2411.07182": "|**2024-11-11**|**Revisiting Ensembling in One-Shot Federated Learning**|Youssef Allouah et.al.|[2411.07182](http://arxiv.org/abs/2411.07182)|**[link](https://github.com/sacs-epfl/fens)**|\n", "2411.06881": "|**2024-11-11**|**WassFFed: Wasserstein Fair Federated Learning**|Zhongxuan Han et.al.|[2411.06881](http://arxiv.org/abs/2411.06881)|null|\n", "2411.06773": "|**2024-11-11**|**Model Partition and Resource Allocation for Split Learning in Vehicular Edge Networks**|Lu Yu et.al.|[2411.06773](http://arxiv.org/abs/2411.06773)|null|\n", "2411.06770": "|**2024-11-11**|**Sketched Adaptive Federated Deep Learning: A Sharp Convergence Analysis**|Zhijie Chen et.al.|[2411.06770](http://arxiv.org/abs/2411.06770)|null|\n", "2411.06721": "|**2024-11-11**|**Movable Antenna-Aided Federated Learning with Over-the-Air Aggregation: Joint Optimization of Positioning, Beamforming, and User Selection**|Yang Zhao et.al.|[2411.06721](http://arxiv.org/abs/2411.06721)|null|\n", "2411.06618": "|**2024-11-10**|**Using Diffusion Models as Generative Replay in Continual Federated Learning -- What will Happen?**|Yongsheng Mei et.al.|[2411.06618](http://arxiv.org/abs/2411.06618)|null|\n", "2411.06458": "|**2024-11-10**|**Protection against Source Inference Attacks in Federated Learning using Unary Encoding and Shuffling**|Andreas Athanasiou et.al.|[2411.06458](http://arxiv.org/abs/2411.06458)|null|\n", "2411.06352": "|**2024-11-10**|**Client Contribution Normalization for Enhanced Federated Learning**|Mayank Kumar Kundalwal et.al.|[2411.06352](http://arxiv.org/abs/2411.06352)|null|\n", "2411.06291": "|**2024-11-09**|**TinyML NLP Approach for Semantic Wireless Sentiment Classification**|Ahmed Y. Radwan et.al.|[2411.06291](http://arxiv.org/abs/2411.06291)|null|\n", "2411.07959": "|**2024-11-12**|**On the Convergence of Continual Federated Learning Using Incrementally Aggregated Gradients**|Satish Kumar Keshri et.al.|[2411.07959](http://arxiv.org/abs/2411.07959)|null|机器学习的圣杯是实现持续联邦学习(CFL)，以提高AI系统在处理流数据时的效率、隐私性和可扩展性。CFL系统的主要挑战是克服全局灾难性遗忘，即在全球模型上训练新任务时，在旧任务上的准确率会下降。在这项工作中，我们提出了一种基于重放缓存的联邦策略——具有聚合梯度的持续联邦学习(C-FLAG)，该策略包括在缓存上进行边缘端梯度更新以及在当前数据上进行梯度聚合。我们对C-FLAG方法进行了收敛性分析，该方法解决了遗忘和偏差问题，并在T轮通信中以O(1/√T)的速度收敛。我们还制定了一个优化子问题，旨在最小化灾难性遗忘，将CFL转化为一种具有自适应学习率的迭代算法，确保跨任务无缝学习。我们通过实验证明，在任务增量和类别增量设置下，C-FLAG在准确率和遗忘等指标上优于多个最先进基线方法。|\n", "2411.07889": "|**2024-11-12**|**A Stochastic Optimization Framework for Private and Fair Learning From Decentralized Data**|Devansh Gupta et.al.|[2411.07889](http://arxiv.org/abs/2411.07889)|**[link](https://github.com/justaguyalways/stochastic-federated-differentially-private-and-fair-learning)**|**机器学习模型通常在敏感数据（如医疗记录和种族/性别）上进行训练，这些数据分布在不同的“孤岛”中（如医院）。然后，这些联邦学习模型可能被用来做出重要的决策，比如分配医疗资源。在这种情况下出现了两个关键挑战：(i) 即使其他孤岛或有权限访问中央服务器的对手试图推断这些数据，也要保持每个人数据的隐私；(ii) 确保对不同人口群体（例如，种族/性别）的决策是公平的。在这篇论文中，我们开发了一种新的算法用于私密且公平的联邦学习(FL)。我们的算法满足跨孤岛记录级差分隐私(ISRL-DP)，这是一种强大的私密FL概念，要求每个孤岛i发送的消息对于所有i都满足记录级差分隐私。我们的框架可以用来促进不同的公平性概念，包括人口统计学上的平等和机会均等。我们证明了在损失函数具有温和平滑性的假设下，我们的算法能够收敛，而之前的工作则需要强凸性才能收敛。作为我们分析的一个副产品，我们获得了第一个针对ISRL-DP非凸-强凹min-max FL的收敛保证。实验表明，在不同的隐私级别下，我们的算法达到了最先进的公平性-准确性权衡。**|\n", "2411.07841": "|**2024-11-12**|**Federated Learning for Discrete Optimal Transport with Large Population under Incomplete Information**|Navpreet Kaur et.al.|[2411.07841](http://arxiv.org/abs/2411.07841)|null|最优传输是一个强大的框架，用于在源和目标之间高效分配资源。然而，传统模型在面对大规模且异构的人群时往往难以有效扩展。在这项工作中，我们引入了一个离散的最优传输框架，旨在处理具有类型分布特征的大规模、异构目标群体。我们针对两种情况进行研究：一种是目标类型的分布已知，另一种是未知。对于已知分布的情况，我们提出了一种完全分布式的算法来实现最优资源分配。在分布未知的情况下，我们开发了一种基于联邦学习的方法，该方法能够在保护隐私的同时有效地计算出最优传输方案。我们通过案例研究来评估我们学习算法的性能。|\n", "2411.07826": "|**2024-11-12**|**Efficient Federated Finetuning of Tiny Transformers with Resource-Constrained Devices**|Kilian Pfeiffer et.al.|[2411.07826](http://arxiv.org/abs/2411.07826)|null|近年来，通过Transformer结构的大型语言模型（LLMs）在许多机器学习任务中占据主导地位，尤其是在文本处理方面。然而，这些模型需要大量的训练数据，并且对资源要求很高，特别是在浮点运算次数（FLOPs）和所需内存方面。为了以参数高效的方式微调此类模型，已经开发了诸如Adapter或LoRA等技术。然而，我们观察到，在联邦学习（FL）中应用LoRA时，虽然仍然是参数高效的，但在内存和FLOP使用上效率不高。基于这一观察，我们开发了一种新的层微调方案，使跨设备FL中的设备能够在遵守给定资源约束的情况下利用预训练神经网络（NNs）。我们展示了所提出的方案在处理同构或异构计算和内存约束时优于当前最先进的方法，并且在有限通信方面与LoRA相当，从而在FL训练中实现了显著更高的准确性。|\n", "2411.07816": "|**2024-11-12**|**Dual-Criterion Model Aggregation in Federated Learning: Balancing Data Quantity and Quality**|Haizhou Zhang et.al.|[2411.07816](http://arxiv.org/abs/2411.07816)|null|联邦学习（FL）已成为一种关键的隐私保护协作学习方法，因为它能够在不交换本地数据的情况下传输模型。在FL框架中，聚合算法被认为是确保系统有效性和安全性最重要的组件之一。现有的平均聚合算法通常假设所有客户端训练的数据具有同等价值，或者权重仅基于每个客户端贡献的数据量。相比之下，其他方法则涉及在聚合后对模型进行本地训练以提高适应性。然而，这些方法从根本上忽略了不同客户端数据之间的固有异质性和聚合阶段数据变化的复杂性，可能导致次优的全局模型。为了解决这些问题，本研究提出了一种新的双准则加权聚合算法，该算法考虑了客户端节点数据的数量和质量。具体来说，我们量化用于训练的数据，并在一个专门的数据集上进行多轮本地模型推理精度评估，以评估每个客户端的数据质量。这两个因素作为权重应用于聚合过程中，通过这两个因素的动态加权求和来实现。这种方法使算法能够自适应地调整权重，确保每个客户端都能对全局模型做出贡献，无论其数据规模或初始质量如何。我们的实验表明，所提出的算法在通用开源数据集CIFAR-10和特定于视觉避障的数据集上均优于几种现有的最先进的聚合方法。|\n", "2411.07806": "|**2024-11-12**|**Federated Low-Rank Adaptation with Differential Privacy over Wireless Networks**|Tianqu Kang et.al.|[2411.07806](http://arxiv.org/abs/2411.07806)|null|在分布式边缘设备上微调大型预训练基础模型（FMs）面临着显著的计算和隐私挑战。联邦微调（FedFT）通过促进协作式模型训练而无需共享原始数据，从而缓解了一些隐私问题。为了减轻资源有限设备上的计算负担，将低秩适应（LoRA）与联邦学习结合，可以实现参数高效的微调。此外，分割FedFT架构在边缘设备和中央服务器之间划分FM，减少了在单个设备上完全部署模型的需要。然而，在敏感领域如医疗保健和金融中，FedFT中的隐私窃听攻击风险仍然令人担忧。在本文中，我们提出了一种基于无线网络并结合差分隐私（DP）的分割FedFT框架，该框架利用上行传输中的固有无线信道噪声来实现DP保证，而无需添加额外的人工噪声。我们将研究无线噪声对所提框架收敛性能的影响。我们还将展示，通过仅更新分割FedFT中的一个低秩矩阵来应用DP，所提方法可以缓解噪声放大效应。仿真结果表明，与基线方法相比，所提框架在严格的隐私预算下实现了更高的准确性。|\n", "2411.07752": "|**2024-11-12**|**ALANINE: A Novel Decentralized Personalized Federated Learning For Heterogeneous LEO Satellite Constellation**|Liang Zhao et.al.|[2411.07752](http://arxiv.org/abs/2411.07752)|null|\n", "2411.07523": "|**2024-11-12**|**Collaborative and Federated Black-box Optimization: A Bayesian Optimization Perspective**|Raed Al Kontar et.al.|[2411.07523](http://arxiv.org/abs/2411.07523)|null|\n", "2411.07391": "|**2024-11-11**|**Federated Learning Client Pruning for Noisy Labels**|Mahdi Morafah et.al.|[2411.07391](http://arxiv.org/abs/2411.07391)|**[link](https://github.com/mmorafah/clipfl)**|\n", "2411.08699": "|**2024-11-13**|**FedSub: Introducing class-aware Subnetworks Fusion to Enhance Personalized Federated Learning in Ubiquitous Systems**|Mattia Giovanni Campana et.al.|[2411.08699](http://arxiv.org/abs/2411.08699)|null|个性化联邦学习在AI驱动的无处不在的系统中至关重要，支持分布式开发能够适应多样化和不断变化的用户行为的模型，同时保护隐私。尽管现有的方法在协作模型训练中解决了用户数据分布异质性的问题，但它们往往在平衡个性化和泛化、简化用户相似性或过度依赖全局模型方面存在局限。在本文中，我们提出了一种名为FedSub的新颖联邦方法，旨在通过使用类感知原型和模型子网络来增强个性化。原型作为用户数据的紧凑表示，在服务器上进行聚类以基于特定标签模式识别相似性。同时，处理每个类所需的子网络在当地被提取，并由服务器根据这些集群融合，为每个用户生成高度定制的模型更新。这种细粒度的、针对类别的客户端模型聚合使FedSub能够捕捉到个体用户数据模式的独特特征。FedSub的有效性在三个现实场景中得到了验证，这些场景的特点是数据异质性高，源自人类活动识别和移动健康应用程序。实验评估表明，与现有技术相比，FedSub在性能上有所提高，并且在基于个人移动和可穿戴设备的无处不在的系统中显著推进了个性化水平。|\n", "2411.08607": "|**2024-11-13**|**Time-constrained Federated Learning (FL) in Push-Pull IoT Wireless Access**|Van Phuc Bui et.al.|[2411.08607](http://arxiv.org/abs/2411.08607)|null|在网络边缘训练高质量的联邦学习（FL）模型受到有限传输资源的挑战。尽管已经提出了各种设备调度策略，但在时间约束下，调度决策如何影响FL模型性能仍然不清楚。当无线介质被共享以允许具有不同通信模式的异构物联网（IoT）设备参与时，这一点尤为明显：(1) 一种调度（拉取）方案，选择具有有价值更新的设备；(2) 随机接入（推送），感兴趣的设备传输模型参数。推送数据的动机是改善自身数据分布在一个训练好的FL模型中的表示，从而提高泛化能力。调度策略会影响在接入阶段推送通信的传输机会，延长了模型收敛所需的通信轮数。本研究通过一个基于效用的分析模型，探讨了在通信机会有限的时间约束FL设置中推拉交互的作用。利用真实世界的数据集，我们提供了性能权衡分析，验证了几种实际设置下策略性设备调度在推拉无线接入下的重要性。仿真结果阐明了在时间约束下，设备采样策略对学习效率的影响。|\n", "2411.09267": "|**2024-11-14**|**Towards efficient compression and communication for prototype-based decentralized learning**|Pablo Fernández-Piñeiro et.al.|[2411.09267](http://arxiv.org/abs/2411.09267)|null|在基于原型的联邦学习中，客户端与主服务器之间交换模型参数的过程被传输数据样本的原型或量化版本所取代。一个完全去中心化的基于原型的学习部署，不需要中央聚合器来聚合原型，对于网络故障更具鲁棒性，并且能够更快地响应数据统计分布的变化，这表明它在动态学习任务中具有潜在优势和快速适应能力，例如当数据源是物联网设备或者数据是非独立同分布时。在这篇论文中，我们考虑了设计一种基于原型的通信高效去中心化学习系统的问题。为了解决原型冗余问题，我们采用了一种双重数据压缩技术，即仅当原型在信息理论上是有用时（通过Jensen-Shannon距离衡量）才发送更新消息，并通过对原型进行聚类来压缩用于闲聊协议的更新消息。此外，我们使用并行而非顺序的闲聊方式，并对其信息年龄(AoI)进行了分析。我们的实验结果表明，通过这些改进，在不降低学习算法收敛速度的前提下，可以大幅度减少通信负载。|\n", "2411.09055": "|**2024-11-13**|**SAFELOC: Overcoming Data Poisoning Attacks in Heterogeneous Federated Machine Learning for Indoor Localization**|Akhil Singampalli et.al.|[2411.09055](http://arxiv.org/abs/2411.09055)|null|基于机器学习（ML）的室内定位解决方案对许多新兴应用至关重要，但其有效性常常受到移动设备之间硬件/软件差异（即设备异构性）以及ML数据投毒攻击的威胁。针对这些挑战的传统方法在应对这些现象带来的不确定性方面表现出有限的韧性。为此，在本文中，我们引入了SAFELOC这一新框架，它不仅能够在这些具有挑战性的条件下最小化定位误差，还确保了模型紧凑性以便于高效部署到移动设备上。我们的框架针对的是一个分布式和协作式的学习环境，该环境使用联邦学习（FL）来保护用户数据隐私，并假设用户携带的是异构移动设备（就像大多数现实场景一样）。在这一异构FL背景下，SAFELOC提出了一种新颖的融合神经网络架构，该架构能够执行数据投毒检测与定位，同时保持低模型占用空间。此外，还设计了一种基于动态显著图的聚合策略，该策略可以根据检测到的数据投毒情况的严重程度进行调整。实验评估表明，与最先进的室内定位框架相比，SAFELOC在不同建筑平面图、移动设备及ML数据投毒攻击场景下，实现了高达5.9倍的平均定位误差改进、7.8倍的最大定位误差改进，以及2.1倍的模型推理延迟减少。|\n"}}