{"agent": {"2405.10255": "|**2024-05-16**|**When LLMs step into the 3D World: A Survey and Meta-Analysis of 3D Tasks via Multi-modal Large Language Models**|Xianzheng Ma et.al.|[2405.10255](http://arxiv.org/abs/2405.10255)|**[link](https://github.com/activevisionlab/awesome-llm-3d)**|\n", "2411.03817": "|**2024-11-06**|**From Novice to Expert: LLM Agent Policy Optimization via Step-wise Reinforcement Learning**|Zhirui Deng et.al.|[2411.03817](http://arxiv.org/abs/2411.03817)|null|\n", "2411.03519": "|**2024-11-05**|**AI Metropolis: Scaling Large Language Model-based Multi-Agent Simulation with Out-of-order Execution**|Zhiqiang Xie et.al.|[2411.03519](http://arxiv.org/abs/2411.03519)|null|\n", "2411.03284": "|**2024-11-05**|**SMoA: Improving Multi-agent Large Language Models with Sparse Mixture-of-Agents**|Dawei Li et.al.|[2411.03284](http://arxiv.org/abs/2411.03284)|**[link](https://github.com/david-li0406/smoa)**|\n", "2411.03252": "|**2024-11-05**|**Spontaneous Emergence of Agent Individuality through Social Interactions in LLM-Based Communities**|Ryosuke Takata et.al.|[2411.03252](http://arxiv.org/abs/2411.03252)|null|\n", "2411.02305": "|**2024-11-04**|**CRMArena: Understanding the Capacity of LLM Agents to Perform Professional CRM Tasks in Realistic Environments**|Kung-Hsiang Huang et.al.|[2411.02305](http://arxiv.org/abs/2411.02305)|**[link](https://github.com/salesforceairesearch/crmarena)**|\n", "2411.01747": "|**2024-11-04**|**DynaSaur: Large Language Agents Beyond Predefined Actions**|Dang Nguyen et.al.|[2411.01747](http://arxiv.org/abs/2411.01747)|null|\n", "2411.01643": "|**2024-11-03**|**EcoAct: Economic Agent Determines When to Register What Action**|Shaokun Zhang et.al.|[2411.01643](http://arxiv.org/abs/2411.01643)|null|\n", "2411.03346": "|**2024-11-03**|**Fixing Security Vulnerabilities with AI in OSS-Fuzz**|Yuntong Zhang et.al.|[2411.03346](http://arxiv.org/abs/2411.03346)|null|\n", "2411.01236": "|**2024-11-02**|**AutoPT: How Far Are We from the End2End Automated Web Penetration Testing?**|Benlong Wu et.al.|[2411.01236](http://arxiv.org/abs/2411.01236)|**[link](https://github.com/Dizzy-K/AutoPT)**|\n", "2411.01143": "|**2024-11-02**|**A Large-scale Time-aware Agents Simulation for Influencer Selection in Digital Advertising Campaigns**|Xiaoqing Zhang et.al.|[2411.01143](http://arxiv.org/abs/2411.01143)|null|\n", "2411.04329": "|**2024-11-12**|**CodeTree: Agent-guided Tree Search for Code Generation with Large Language Models**|Jierui Li et.al.|[2411.04329](http://arxiv.org/abs/2411.04329)|null|\n", "2411.05651": "|**2024-11-08**|**LightVA: Lightweight Visual Analytics with LLM Agent-Based Task Planning and Execution**|Yuheng Zhao et.al.|[2411.05651](http://arxiv.org/abs/2411.05651)|null|\n", "2411.05349": "|**2024-11-08**|**Enhancing Cluster Resilience: LLM-agent Based Autonomous Intelligent Cluster Diagnosis System and Evaluation Framework**|Honghao Shi et.al.|[2411.05349](http://arxiv.org/abs/2411.05349)|null|\n", "2411.05209": "|**2024-11-07**|**Alopex: A Computational Framework for Enabling On-Device Function Calls with LLMs**|Yide Ran et.al.|[2411.05209](http://arxiv.org/abs/2411.05209)|null|\n", "2411.05185": "|**2024-11-07**|**PentestAgent: Incorporating LLM Agents to Automated Penetration Testing**|Xiangmin Shen et.al.|[2411.05185](http://arxiv.org/abs/2411.05185)|null|\n", "2411.07228": "|**2024-11-11**|**Tooling or Not Tooling? The Impact of Tools on Language Agents for Chemistry Problem Solving**|Botao Yu et.al.|[2411.07228](http://arxiv.org/abs/2411.07228)|null|\n", "2411.06490": "|**2024-11-10**|**Hermes: A Large Language Model Framework on the Journey to Autonomous Networks**|Fadhel Ayed et.al.|[2411.06490](http://arxiv.org/abs/2411.06490)|null|\n", "2411.05990": "|**2024-11-12**|**Game-theoretic LLM: Agent Workflow for Negotiation Games**|Wenyue Hua et.al.|[2411.05990](http://arxiv.org/abs/2411.05990)|**[link](https://github.com/wenyueh/game_theory)**|\n", "2411.08449": "|**2024-11-18**|**Towards Evaluating Large Language Models for Graph Query Generation**|Siraj Munir et.al.|[2411.08449](http://arxiv.org/abs/2411.08449)|null|大型语言模型（LLMs）正在革新生成式人工智能（GenAI）的领域，基于LLM的创新解决方案迅速涌现。然而，在数据库技术中，特别是针对图数据库和知识图谱（KGs）的查询生成方面，LLMs仍然面临重大挑战。尽管关于LLM驱动的结构化查询语言（SQL）查询生成的研究已经存在，但针对图数据库的类似系统仍处于欠发展阶段。本文介绍了一项比较研究，旨在解决使用开放访问的LLMs生成Cypher查询这一强大语言与图数据库交互时所面临的挑战。我们通过设计少量学习提示和以思维链（CoT）推理支持的检索增强生成（RAG），严格评估了几个LLM代理（OpenAI ChatGPT 4.0、Claude Sonnet 3.5、Google Gemini Pro 1.5以及本地部署的Llama 3.1 8B）。我们的实证分析表明，在这一特定领域内，Claude Sonnet 3.5的表现优于其竞争对手。此外，我们还指出了未来有前景的研究方向，以解决已识别的局限性，并推动LLM驱动的图数据库查询生成技术的发展。|\n", "2411.08294": "|**2024-11-13**|**Collaborative Participatory Research with LLM Agents in South Asia: An Empirically-Grounded Methodological Initiative and Agenda from Field Evidence in Sri Lanka**|Xinjie Zhao et.al.|[2411.08294](http://arxiv.org/abs/2411.08294)|null|\n", "2411.09523": "|**2024-11-14**|**Navigating the Risks: A Survey of Security, Privacy, and Ethics Threats in LLM-Based Agents**|Yuyou Gan et.al.|[2411.09523](http://arxiv.org/abs/2411.09523)|null|随着大型语言模型（LLM）的不断发展，基于Transformer的模型在众多自然语言处理（NLP）任务中取得了突破性进展，催生了一系列以LLM作为控制中心的代理。尽管LLM在各种任务上取得了成功，但它们面临着众多安全和隐私威胁，在代理场景中这些威胁变得更加严重。为了提高基于LLM应用的可靠性，一系列研究从不同角度评估和缓解这些风险应运而生。为了帮助研究人员全面了解各种风险，本综述收集并分析了这些代理所面临的不同威胁。为了解决先前分类方法在处理跨模块和跨阶段威胁方面的挑战，我们提出了一种基于来源和影响的新分类框架。此外，我们确定了基于LLM代理的六个关键特征，并基于这些特征总结了当前的研究进展，分析了它们的局限性。随后，我们选择了四个具有代表性的代理作为案例研究，分析了它们在实际使用中可能面临的风险。最后，基于上述分析，我们从数据、方法论和政策的角度提出了未来的研究方向。|\n", "2411.10422": "|**2024-11-15**|**Evaluating Creativity and Deception in Large Language Models: A Simulation Framework for Multi-Agent Balderdash**|Parsa Hejabi et.al.|[2411.10422](http://arxiv.org/abs/2411.10422)|**[link](https://github.com/parsahejabi/simulation-framework-for-multi-agent-balderdash)**|**大型语言模型（LLM）在复杂任务和交互环境中的表现令人印象深刻，但其创造力仍待进一步探索。本文介绍了一个利用游戏Balderdash来评估LLM的创造力和逻辑推理能力的模拟框架。在Balderdash游戏中，玩家为生僻词创造虚构定义以欺骗其他玩家，并识别出正确的定义。我们的框架使多个LLM代理能够参与这个游戏，评估它们生成合理定义以及基于游戏规则和历史制定策略的能力。我们实现了一个中心化的游戏引擎，其中包含作为参与者的各种LLM和一个用于评估语义等价性的裁判LLM。通过一系列实验，我们分析了不同LLM的表现，考察了诸如真定义比率、欺骗比率和正确猜测比率等指标。研究结果提供了关于LLM的创造性和欺骗能力的见解，突出了它们的优点和需要改进的地方。具体而言，研究表明，输入中不常见的词汇会导致LLM在游戏规则和历史背景上的推理能力较差。**|\n", "2411.10213": "|**2024-11-15**|**An Empirical Study on LLM-based Agents for Automated Bug Fixing**|Xiangxin Meng et.al.|[2411.10213](http://arxiv.org/abs/2411.10213)|null|大型语言模型（LLM）和基于LLM的代理已经应用于自动修复漏洞，展示了通过与开发环境交互、迭代验证和代码修改来解决软件缺陷的能力。然而，对于这些代理和非代理系统的系统性分析仍然有限，尤其是在顶级性能系统之间的表现差异方面。在本文中，我们在SWE-bench Lite基准上评估了七个专有和开源系统在自动修复漏洞方面的表现。我们首先评估每个系统的整体性能，记录所有或没有系统可以解决的实例，并探讨为什么某些实例只能由特定类型的系统解决。我们还比较了文件级和行级的故障定位准确性，并评估了漏洞重现能力，识别出只有通过动态重现才能解决的实例。通过分析，我们得出结论，为了提高代理在修复漏洞方面的有效性，需要对LLM本身和代理流程设计进行进一步优化。|\n", "2411.10184": "|**2024-11-15**|**Agentic LLMs in the Supply Chain: Towards Autonomous Multi-Agent Consensus-Seeking**|Valeria Jannelli et.al.|[2411.10184](http://arxiv.org/abs/2411.10184)|null|本文探讨了大型语言模型（LLM）如何在供应链管理（SCM）中自动化达成共识，其中库存水平和交货时间等问题的频繁决策需要公司间的协调。传统的SCM依赖于人为共识来避免诸如牛鞭效应等突发问题。一些常规的共识过程，尤其是那些耗时且成本高昂的过程，可以实现自动化。现有的自动化协调解决方案由于高进入壁垒将中小企业排除在外、能力有限以及在复杂场景下的适应性不足而面临挑战。然而，生成式人工智能特别是LLM的最新进展显示出克服这些障碍的潜力。经过大规模数据集训练的LLM能够进行谈判、推理和规划，以最小的进入壁垒实现近乎人类水平的大规模共识。在本研究中，我们识别了现有方法的关键局限，并提出了自主LLM代理来解决这些差距。我们引入了一系列针对供应链特定的共识寻求框架，并通过一个库存管理案例研究验证了我们方法的有效性。为了加速SCM社区的进步，我们开源了代码，为基于LLM的自主供应链解决方案进一步发展提供了基础。|\n", "2411.11844": "|**2024-11-19**|**Generative World Explorer**|Taiming Lu et.al.|[2411.11844](http://arxiv.org/abs/2411.11844)|null|在具身AI中，基于部分观察的规划是一个核心挑战。大多数先前的工作通过开发能够在环境中物理探索以更新其对世界状态信念的智能体来应对这一挑战。相比之下，人类可以通过心理探索想象出看不见的世界部分，并通过想象中的观察来修正他们的信念。这种更新后的信念可以使他们在不总是需要物理探索世界的情况下做出更加明智的决定。为了实现这种类似人类的能力，我们引入了“生成式世界探索者（Genex）”，这是一种以自我为中心的世界探索框架，允许智能体在大规模3D世界（如城市场景）中进行心理探索，并获取想象中的观察来更新其信念。这种更新后的信念将帮助智能体在当前步骤做出更明智的决策。为了训练“Genex”，我们创建了一个合成的城市场景数据集Genex-DB。我们的实验结果表明，(1) “Genex”可以在长时间地探索大型虚拟物理世界过程中生成高质量且一致的观察；(2) 通过生成的观察更新的信念可以为现有的决策模型（例如，一个大语言模型代理）提供信息，使其能够制定更好的计划。|\n", "2411.11779": "|**2024-11-18**|**LLM-IE: A Python Package for Generative Information Extraction with Large Language Models**|Enshuo Hsu et.al.|[2411.11779](http://arxiv.org/abs/2411.11779)|null|尽管最近大型语言模型（LLMs）在生物医学信息提取中的应用日益广泛，但在提示工程和算法方面仍存在挑战，且没有专门的软件可用。为了解决这个问题，我们开发了LLM-IE：一个用于构建完整信息提取流水线的Python包。我们的主要创新是一个交互式的LLM代理，支持模式定义和提示设计。LLM-IE支持命名实体识别、实体属性提取和关系提取任务。我们在i2b2数据集上进行了基准测试并进行了系统评估。基于句子的提示算法表现最佳，但需要更长的推理时间。系统评估提供了直观的可视化结果。LLM-IE是根据医疗保健领域的实际NLP经验设计的，并已在内部项目中采用，对生物医学NLP社区应具有很大的价值。我们开发了一个Python包LLM-IE，它为构建稳健的信息提取流水线提供了基础组件。|\n", "2411.11581": "|**2024-11-18**|**OASIS: Open Agents Social Interaction Simulations on One Million Agents**|Ziyi Yang et.al.|[2411.11581](http://arxiv.org/abs/2411.11581)|null|近年来，人们对通过引入更真实的大型语言模型（LLM）代理来增强基于规则的社交媒体平台（例如X、Reddit）的代理基础模型（ABMs）越来越感兴趣，这使得对复杂系统的细致研究成为可能。因此，在过去的一年中提出了几种基于LLM的ABMs。虽然这些模型前景看好，但每个模拟器都是专门为研究特定场景而设计的，这使得使用相同的ABM探索其他现象既耗时又耗费资源。此外，这些模型仅能模拟有限数量的代理，而现实世界的社交媒体平台涉及数百万用户。为此，我们提出了OASIS，一个可扩展且通用的社交媒体模拟器。OASIS的设计基于现实世界的社交媒体平台，包括动态更新的环境（即动态社交网络和帖子信息）、多样的行动空间（如关注、评论）以及推荐系统（基于兴趣和热度评分）。此外，OASIS支持大规模用户模拟，能够建模多达一百万用户。凭借这些特性，OASIS可以轻松地扩展到不同的社交媒体平台，以研究大规模群体现象和行为。我们在X和Reddit平台上复制了多种社会现象，包括信息传播、群体极化和从众效应。而且，我们提供了不同规模代理群体的社会现象观察结果。观察发现，更大的代理群体规模导致更加显著的群体动态以及更加多样化和有益的代理意见。这些发现展示了OASIS作为研究数字环境中复杂系统强大工具的潜力。|\n", "2411.10670": "|**2024-11-16**|**IntentGPT: Few-shot Intent Discovery with Large Language Models**|Juan A. Rodriguez et.al.|[2411.10670](http://arxiv.org/abs/2411.10670)|null|在当今这个由数字驱动的世界中，对话系统在增强用户互动方面发挥着关键作用，从客户服务到虚拟助手无处不在。在这些对话中，自动识别用户的意图对于迅速解决他们的需求至关重要。这促使了能够执行意图识别的模型的集成。然而，用户的意图是多样化且动态变化的，这使得维护一套固定的预定义意图变得困难。因此，开发一种能够随着新意图的出现而识别它们的模型更为实用。我们关注的是意图发现这一挑战，这是近期研究工作中的一个热点领域。现有的方法需要大量的数据训练才能正确识别新意图，这对人力提出了很高的要求。为了解决这个问题，我们引入了IntentGPT，这是一种新颖的无需训练的方法，它能有效地通过极少的标记数据提示大型语言模型（如GPT-4）来发现新意图。IntentGPT包括一个“上下文提示生成器”，用于生成有助于上下文学习的信息提示；一个“意图预测器”，用于从话语中分类和发现用户意图；以及一个“语义少样本采样器”，负责选择相关的少样本示例，并将一组已知意图注入提示中。我们的实验表明，在包括CLINC和BANKING在内的多个流行基准测试中，IntentGPT的表现优于那些需要大量领域特定数据和微调的先前方法。|\n", "2411.12196": "|**2024-11-19**|**A More Advanced Group Polarization Measurement Approach Based on LLM-Based Agents and Graphs**|Zixin Liu et.al.|[2411.12196](http://arxiv.org/abs/2411.12196)|null|群体极化是社交媒体内容分析中的一个重要研究方向，吸引了许多研究人员探索这一领域。因此，如何有效地衡量群体极化已成为一个关键话题。在社交媒体上衡量群体极化存在几个挑战，而现有解决方案尚未解决这些问题。首先，社交媒体群体极化的测量涉及处理大量文本，这对信息提取构成了重大挑战。其次，社交媒体文本中经常包含难以理解的内容，包括讽刺、表情包和网络俚语。此外，群体极化研究侧重于整体分析，而文本通常是碎片化的。为了解决这些挑战，我们设计了一种基于多智能体系统的解决方案，并使用图结构的社区情感网络（CSN）来表示极化状态。此外，我们基于CSN开发了一个名为社区对立指数（COI）的指标来量化极化程度。最后，我们通过零样本立场检测任务测试了我们的多智能体系统，并取得了出色的结果。总之，所提出的方法在可用性、准确性和可解释性方面具有重要价值。|\n"}, "llm": {"2405.10255": "|**2024-05-16**|**When LLMs step into the 3D World: A Survey and Meta-Analysis of 3D Tasks via Multi-modal Large Language Models**|Xianzheng Ma et.al.|[2405.10255](http://arxiv.org/abs/2405.10255)|**[link](https://github.com/activevisionlab/awesome-llm-3d)**|\n", "2411.04118": "|**2024-11-06**|**Medical Adaptation of Large Language and Vision-Language Models: Are We Making Progress?**|Daniel P. Jeong et.al.|[2411.04118](http://arxiv.org/abs/2411.04118)|null|\n", "2411.04105": "|**2024-11-06**|**How Transformers Solve Propositional Logic Problems: A Mechanistic Analysis**|Guan Zhe Hong et.al.|[2411.04105](http://arxiv.org/abs/2411.04105)|null|\n", "2411.04032": "|**2024-11-06**|**Beemo: Benchmark of Expert-edited Machine-generated Outputs**|Ekaterina Artemova et.al.|[2411.04032](http://arxiv.org/abs/2411.04032)|null|\n", "2411.03964": "|**2024-11-06**|**What Really is Commonsense Knowledge?**|Quyet V. Do et.al.|[2411.03964](http://arxiv.org/abs/2411.03964)|null|\n", "2411.03962": "|**2024-11-06**|**How Does A Text Preprocessing Pipeline Affect Ontology Syntactic Matching?**|Zhangcheng Qiang et.al.|[2411.03962](http://arxiv.org/abs/2411.03962)|null|\n", "2411.03957": "|**2024-11-06**|**Fine-Grained Guidance for Retrievers: Leveraging LLMs' Feedback in Retrieval-Augmented Generation**|Yuhang Liu et.al.|[2411.03957](http://arxiv.org/abs/2411.03957)|null|\n", "2411.03948": "|**2024-11-06**|**Long-Form Text-to-Music Generation with Adaptive Prompts: A Case of Study in Tabletop Role-Playing Games Soundtracks**|Felipe Marra et.al.|[2411.03948](http://arxiv.org/abs/2411.03948)|null|\n", "2411.03884": "|**2024-11-06**|**Polynomial Composition Activations: Unleashing the Dynamics of Large Language Models**|Zhijian Zhuo et.al.|[2411.03884](http://arxiv.org/abs/2411.03884)|**[link](https://github.com/brycezhuo/polycom)**|\n", "2411.03883": "|**2024-11-06**|**MEG: Medical Knowledge-Augmented Large Language Models for Question Answering**|Laura Cabello et.al.|[2411.03883](http://arxiv.org/abs/2411.03883)|**[link](https://github.com/lautel/meg)**|\n", "2411.03881": "|**2024-11-06**|**Data Fusion of Synthetic Query Variants With Generative Large Language Models**|Timo Breuer et.al.|[2411.03881](http://arxiv.org/abs/2411.03881)|**[link](https://github.com/breuert/sigirap24)**|\n", "2411.05000": "|**2024-11-07**|**Needle Threading: Can LLMs Follow Threads through Near-Million-Scale Haystacks?**|Jonathan Roberts et.al.|[2411.05000](http://arxiv.org/abs/2411.05000)|null|\n", "2411.04997": "|**2024-11-07**|**LLM2CLIP: Powerful Language Model Unlock Richer Visual Representation**|Weiquan Huang et.al.|[2411.04997](http://arxiv.org/abs/2411.04997)|**[link](https://github.com/microsoft/LLM2CLIP)**|\n", "2411.04996": "|**2024-11-07**|**Mixture-of-Transformers: A Sparse and Scalable Architecture for Multi-Modal Foundation Models**|Weixin Liang et.al.|[2411.04996](http://arxiv.org/abs/2411.04996)|null|\n", "2411.04991": "|**2024-11-07**|**Rethinking Bradley-Terry Models in Preference-Based Reward Modeling: Foundations, Theory, and Alternatives**|Hao Sun et.al.|[2411.04991](http://arxiv.org/abs/2411.04991)|**[link](https://github.com/holarissun/rewardmodelingbeyondbradleyterry)**|\n", "2411.04981": "|**2024-11-07**|**Enhancing Reverse Engineering: Investigating and Benchmarking Large Language Models for Vulnerability Analysis in Decompiled Binaries**|Dylan Manuel et.al.|[2411.04981](http://arxiv.org/abs/2411.04981)|null|\n", "2411.04975": "|**2024-11-07**|**SuffixDecoding: A Model-Free Approach to Speeding Up Large Language Model Inference**|Gabriele Oliaro et.al.|[2411.04975](http://arxiv.org/abs/2411.04975)|null|\n", "2411.04965": "|**2024-11-07**|**BitNet a4.8: 4-bit Activations for 1-bit LLMs**|Hongyu Wang et.al.|[2411.04965](http://arxiv.org/abs/2411.04965)|null|\n", "2411.04962": "|**2024-11-07**|**Position Paper On Diagnostic Uncertainty Estimation from Large Language Models: Next-Word Probability Is Not Pre-test Probability**|Yanjun Gao et.al.|[2411.04962](http://arxiv.org/abs/2411.04962)|null|\n", "2411.04954": "|**2024-11-07**|**CAD-MLLM: Unifying Multimodality-Conditioned CAD Generation With MLLM**|Jingwei Xu et.al.|[2411.04954](http://arxiv.org/abs/2411.04954)|null|\n", "2411.04920": "|**2024-11-07**|**GPTKB: Building Very Large Knowledge Bases from Language Models**|Yujia Hu et.al.|[2411.04920](http://arxiv.org/abs/2411.04920)|**[link](https://github.com/Knowledge-aware-AI/GPTKB)**|\n", "2411.05787": "|**2024-11-08**|**Recycled Attention: Efficient inference for long-context language models**|Fangyuan Xu et.al.|[2411.05787](http://arxiv.org/abs/2411.05787)|null|\n", "2411.05775": "|**2024-11-08**|**Fact or Fiction? Can LLMs be Reliable Annotators for Political Truths?**|Veronica Chatrath et.al.|[2411.05775](http://arxiv.org/abs/2411.05775)|null|\n", "2411.05762": "|**2024-11-08**|**Multi-hop Evidence Pursuit Meets the Web: Team Papelo at FEVER 2024**|Christopher Malon et.al.|[2411.05762](http://arxiv.org/abs/2411.05762)|null|\n", "2411.05665": "|**2024-11-08**|**Unmasking the Limits of Large Language Models: A Systematic Evaluation of Masked Text Processing Ability through MskQA and MskCal**|Fuka Matsuzaki et.al.|[2411.05665](http://arxiv.org/abs/2411.05665)|**[link](https://github.com/isfhub/maskcode)**|\n", "2411.05653": "|**2024-11-08**|**The influence of persona and conversational task on social interactions with a LLM-controlled embodied conversational agent**|Leon O. H. Kroczek et.al.|[2411.05653](http://arxiv.org/abs/2411.05653)|null|\n", "2411.05651": "|**2024-11-08**|**LightVA: Lightweight Visual Analytics with LLM Agent-Based Task Planning and Execution**|Yuheng Zhao et.al.|[2411.05651](http://arxiv.org/abs/2411.05651)|null|\n", "2411.05641": "|**2024-11-08**|**Evaluating Large Language Model Capability in Vietnamese Fact-Checking Data Generation**|Long Truong To et.al.|[2411.05641](http://arxiv.org/abs/2411.05641)|null|\n", "2411.05609": "|**2024-11-08**|**A Two-Step Concept-Based Approach for Enhanced Interpretability and Trust in Skin Lesion Diagnosis**|Cristiano Patrício et.al.|[2411.05609](http://arxiv.org/abs/2411.05609)|**[link](https://github.com/cristianopatricio/2-step-concept-based-skin-diagnosis)**|\n", "2411.05593": "|**2024-11-08**|**Evaluating and Adapting Large Language Models to Represent Folktales in Low-Resource Languages**|JA Meaney et.al.|[2411.05593](http://arxiv.org/abs/2411.05593)|null|\n", "2411.05555": "|**2024-11-08**|**AcceLLM: Accelerating LLM Inference using Redundancy for Load Balancing and Data Locality**|Ilias Bournias et.al.|[2411.05555](http://arxiv.org/abs/2411.05555)|null|\n", "2411.07240": "|**2024-11-11**|**UTMath: Math Evaluation with Unit Test via Reasoning-to-Coding Thoughts**|Bo Yang et.al.|[2411.07240](http://arxiv.org/abs/2411.07240)|**[link](https://github.com/utmathgroup/utmath)**|\n", "2411.07228": "|**2024-11-11**|**Tooling or Not Tooling? The Impact of Tools on Language Agents for Chemistry Problem Solving**|Botao Yu et.al.|[2411.07228](http://arxiv.org/abs/2411.07228)|null|\n", "2411.07213": "|**2024-11-11**|**Comparing Bottom-Up and Top-Down Steering Approaches on In-Context Learning Tasks**|Madeline Brumley et.al.|[2411.07213](http://arxiv.org/abs/2411.07213)|null|\n", "2411.07205": "|**2024-11-11**|**DLCR: A Generative Data Expansion Framework via Diffusion for Clothes-Changing Person Re-ID**|Nyle Siddiqui et.al.|[2411.07205](http://arxiv.org/abs/2411.07205)|**[link](https://github.com/croitorualin/dlcr)**|\n", "2411.07191": "|**2024-11-11**|**The Super Weight in Large Language Models**|Mengxia Yu et.al.|[2411.07191](http://arxiv.org/abs/2411.07191)|**[link](https://github.com/mengxiayu/llmsuperweight)**|\n", "2411.07186": "|**2024-11-11**|**NatureLM-audio: an Audio-Language Foundation Model for Bioacoustics**|David Robinson et.al.|[2411.07186](http://arxiv.org/abs/2411.07186)|null|\n", "2411.07163": "|**2024-11-11**|**A Domain-Agnostic Neurosymbolic Approach for Big Social Data Analysis: Evaluating Mental Health Sentiment on Social Media during COVID-19**|Vedant Khandelwal et.al.|[2411.07163](http://arxiv.org/abs/2411.07163)|null|\n", "2411.07140": "|**2024-11-11**|**Chinese SimpleQA: A Chinese Factuality Evaluation for Large Language Models**|Yancheng He et.al.|[2411.07140](http://arxiv.org/abs/2411.07140)|null|\n", "2411.07133": "|**2024-11-11**|**Stronger Models are NOT Stronger Teachers for Instruction Tuning**|Zhangchen Xu et.al.|[2411.07133](http://arxiv.org/abs/2411.07133)|null|\n", "2411.07127": "|**2024-11-11**|**Benchmarking LLMs' Judgments with No Gold Standard**|Shengwei Xu et.al.|[2411.07127](http://arxiv.org/abs/2411.07127)|**[link](https://github.com/yx-lu/benchmarking-llms--judgments-with-no-gold-standard)**|\n", "2411.08028": "|**2024-11-12**|**Learning with Less: Knowledge Distillation from Large Language Models via Unlabeled Data**|Juanhui Li et.al.|[2411.08028](http://arxiv.org/abs/2411.08028)|null|\n", "2411.08027": "|**2024-11-12**|**LLMPhy: Complex Physical Reasoning Using Large Language Models and World Models**|Anoop Cherian et.al.|[2411.08027](http://arxiv.org/abs/2411.08027)|null|\n", "2411.08019": "|**2024-11-12**|**Language Models as Causal Effect Generators**|Lucius E. J. Bynum et.al.|[2411.08019](http://arxiv.org/abs/2411.08019)|**[link](https://github.com/lbynum/sequence-driven-scms)**|\n", "2411.08010": "|**2024-11-12**|**ExpressivityArena: Can LLMs Express Information Implicitly?**|Joshua Tint et.al.|[2411.08010](http://arxiv.org/abs/2411.08010)|null|\n", "2411.08003": "|**2024-11-12**|**Can adversarial attacks by large language models be attributed?**|Manuel Cebrian et.al.|[2411.08003](http://arxiv.org/abs/2411.08003)|null|\n", "2411.07990": "|**2024-11-12**|**Derivational Morphology Reveals Analogical Generalization in Large Language Models**|Valentin Hofmann et.al.|[2411.07990](http://arxiv.org/abs/2411.07990)|null|\n", "2411.07965": "|**2024-11-12**|**From General to Specific: Utilizing General Hallucation to Automatically Measure the Role Relationship Fidelity for Specific Role-Play Agents**|Chuyi Kong et.al.|[2411.07965](http://arxiv.org/abs/2411.07965)|null|\n", "2411.07942": "|**2024-11-12**|**Towards Low-bit Communication for Tensor Parallel LLM Inference**|Harry Dong et.al.|[2411.07942](http://arxiv.org/abs/2411.07942)|null|\n", "2411.07871": "|**2024-11-12**|**Leveraging Multimodal Models for Enhanced Neuroimaging Diagnostics in Alzheimer's Disease**|Francesco Chiumento et.al.|[2411.07871](http://arxiv.org/abs/2411.07871)|null|\n", "2411.07858": "|**2024-11-12**|**Verbosity $\\neq$ Veracity: Demystify Verbosity Compensation Behavior of Large Language Models**|Yusen Zhang et.al.|[2411.07858](http://arxiv.org/abs/2411.07858)|**[link](https://github.com/psunlpgroup/verbosityllm)**|\n", "2411.08870": "|**2024-11-13**|**The Limited Impact of Medical Adaptation of Large Language and Vision-Language Models**|Daniel P. Jeong et.al.|[2411.08870](http://arxiv.org/abs/2411.08870)|null|\n", "2411.08862": "|**2024-11-13**|**LLMStinger: Jailbreaking LLMs using RL fine-tuned LLMs**|Piyush Jha et.al.|[2411.08862](http://arxiv.org/abs/2411.08862)|null|\n", "2411.08794": "|**2024-11-13**|**Evaluating World Models with LLM for Decision Making**|Chang Yang et.al.|[2411.08794](http://arxiv.org/abs/2411.08794)|null|\n", "2411.08745": "|**2024-11-13**|**Separating Tongue from Thought: Activation Patching Reveals Language-Agnostic Concept Representations in Transformers**|Clément Dumas et.al.|[2411.08745](http://arxiv.org/abs/2411.08745)|**[link](https://github.com/butanium/llm-lang-agnostic)**|\n", "2411.08733": "|**2024-11-13**|**Dynamic Rewarding with Prompt Optimization Enables Tuning-free Self-Alignment of Language Models**|Somanshu Singla et.al.|[2411.08733](http://arxiv.org/abs/2411.08733)|**[link](https://github.com/Singla17/DRPO)**|\n", "2411.08671": "|**2024-11-13**|**Theoretical Analysis of Byte-Pair Encoding**|László Kozma et.al.|[2411.08671](http://arxiv.org/abs/2411.08671)|null|\n", "2411.08645": "|**2024-11-13**|**A System Level Performance Evaluation for Superconducting Digital Systems**|Joyjit Kundu et.al.|[2411.08645](http://arxiv.org/abs/2411.08645)|null|\n", "2411.08640": "|**2024-11-13**|**Towards Secure Intelligent O-RAN Architecture: Vulnerabilities, Threats and Promising Technical Solutions using LLMs**|Mojdeh Karbalaee Motalleb et.al.|[2411.08640](http://arxiv.org/abs/2411.08640)|null|\n", "2411.08574": "|**2024-11-13**|**Practitioners' Discussions on Building LLM-based Applications for Production**|Alina Mailach et.al.|[2411.08574](http://arxiv.org/abs/2411.08574)|null|\n", "2411.08563": "|**2024-11-13**|**Leveraging LLMs for Predictive Insights in Food Policy and Behavioral Interventions**|Micha Kaiser et.al.|[2411.08563](http://arxiv.org/abs/2411.08563)|null|\n", "2411.09688": "|**2024-11-14**|**Squeezed Attention: Accelerating Long Context Length LLM Inference**|Coleman Hooper et.al.|[2411.09688](http://arxiv.org/abs/2411.09688)|null|\n", "2411.09625": "|**2024-11-14**|**Local deployment of large-scale music AI models on commodity hardware**|Xun Zhou et.al.|[2411.09625](http://arxiv.org/abs/2411.09625)|null|\n", "2411.09613": "|**2024-11-14**|**PTR: Precision-Driven Tool Recommendation for Large Language Models**|Hang Gao et.al.|[2411.09613](http://arxiv.org/abs/2411.09613)|null|\n", "2411.09595": "|**2024-11-14**|**LLaMA-Mesh: Unifying 3D Mesh Generation with Language Models**|Zhengyi Wang et.al.|[2411.09595](http://arxiv.org/abs/2411.09595)|null|\n", "2411.09590": "|**2024-11-14**|**Adopting RAG for LLM-Aided Future Vehicle Design**|Vahid Zolfaghari et.al.|[2411.09590](http://arxiv.org/abs/2411.09590)|null|\n", "2411.09439": "|**2024-11-14**|**Spider: Any-to-Many Multimodal LLM**|Jinxiang Lai et.al.|[2411.09439](http://arxiv.org/abs/2411.09439)|null|\n", "2411.09580": "|**2024-11-14**|**Software Performance Engineering for Foundation Model-Powered Software (FMware)**|Haoxiang Zhang et.al.|[2411.09580](http://arxiv.org/abs/2411.09580)|null|\n", "2411.09539": "|**2024-11-14**|**A Practical Guide to Fine-tuning Language Models with Limited Data**|Márton Szép et.al.|[2411.09539](http://arxiv.org/abs/2411.09539)|null|\n", "2411.09523": "|**2024-11-14**|**Navigating the Risks: A Survey of Security, Privacy, and Ethics Threats in LLM-Based Agents**|Yuyou Gan et.al.|[2411.09523](http://arxiv.org/abs/2411.09523)|null|\n", "2411.09510": "|**2024-11-14**|**Communication Compression for Tensor Parallel LLM Inference**|Jan Hansen-Palmus et.al.|[2411.09510](http://arxiv.org/abs/2411.09510)|null|\n", "2411.10422": "|**2024-11-15**|**Evaluating Creativity and Deception in Large Language Models: A Simulation Framework for Multi-Agent Balderdash**|Parsa Hejabi et.al.|[2411.10422](http://arxiv.org/abs/2411.10422)|**[link](https://github.com/parsahejabi/simulation-framework-for-multi-agent-balderdash)**|\n", "2411.10351": "|**2024-11-15**|**Bias Unveiled: Investigating Social Bias in LLM-Generated Code**|Lin Ling et.al.|[2411.10351](http://arxiv.org/abs/2411.10351)|null|\n", "2411.10294": "|**2024-11-15**|**Static network structure cannot stabilize cooperation among Large Language Model agents**|Jin Han et.al.|[2411.10294](http://arxiv.org/abs/2411.10294)|null|\n", "2411.10272": "|**2024-11-15**|**Scaling Law for Post-training after Model Pruning**|Xiaodong Chen et.al.|[2411.10272](http://arxiv.org/abs/2411.10272)|null|\n", "2411.10213": "|**2024-11-15**|**An Empirical Study on LLM-based Agents for Automated Bug Fixing**|Xiangxin Meng et.al.|[2411.10213](http://arxiv.org/abs/2411.10213)|null|\n", "2411.10184": "|**2024-11-15**|**Agentic LLMs in the Supply Chain: Towards Autonomous Multi-Agent Consensus-Seeking**|Valeria Jannelli et.al.|[2411.10184](http://arxiv.org/abs/2411.10184)|null|\n", "2411.10168": "|**2024-11-15**|**Evaluating the role of `Constitutions' for learning from AI feedback**|Saskia Redgate et.al.|[2411.10168](http://arxiv.org/abs/2411.10168)|null|\n", "2411.10163": "|**2024-11-15**|**Compound-QA: A Benchmark for Evaluating LLMs on Compound Questions**|Yutao Hou et.al.|[2411.10163](http://arxiv.org/abs/2411.10163)|null|\n", "2411.10145": "|**2024-11-15**|**An Effective Framework to Help Large Language Models Handle Numeric-involved Long-context Tasks**|Yijiong Yu et.al.|[2411.10145](http://arxiv.org/abs/2411.10145)|null|\n", "2411.10137": "|**2024-11-15**|**Legal Evalutions and Challenges of Large Language Models**|Jiaqi Wang et.al.|[2411.10137](http://arxiv.org/abs/2411.10137)|null|\n", "2411.11829": "|**2024-11-18**|**Tackling prediction tasks in relational databases with LLMs**|Marek Wydmuch et.al.|[2411.11829](http://arxiv.org/abs/2411.11829)|null|\n", "2411.11795": "|**2024-11-18**|**Exploring adversarial robustness of JPEG AI: methodology, comparison and new methods**|Egor Kovalev et.al.|[2411.11795](http://arxiv.org/abs/2411.11795)|null|\n", "2411.11779": "|**2024-11-18**|**LLM-IE: A Python Package for Generative Information Extraction with Large Language Models**|Enshuo Hsu et.al.|[2411.11779](http://arxiv.org/abs/2411.11779)|null|\n", "2411.11752": "|**2024-11-18**|**sMoRe: Enhancing Object Manipulation and Organization in Mixed Reality Spaces with LLMs and Generative AI**|Yunhao Xing et.al.|[2411.11752](http://arxiv.org/abs/2411.11752)|null|\n", "2411.11745": "|**2024-11-18**|**BitMoD: Bit-serial Mixture-of-Datatype LLM Acceleration**|Yuzong Chen et.al.|[2411.11745](http://arxiv.org/abs/2411.11745)|null|\n", "2411.11731": "|**2024-11-18**|**Moral Persuasion in Large Language Models: Evaluating Susceptibility and Ethical Alignment**|Allison Huang et.al.|[2411.11731](http://arxiv.org/abs/2411.11731)|null|\n", "2411.11714": "|**2024-11-18**|**Semantic-Geometric-Physical-Driven Robot Manipulation Skill Transfer via Skill Library and Tactile Representation**|Mingchao Qi et.al.|[2411.11714](http://arxiv.org/abs/2411.11714)|**[link](https://github.com/mingchaoqi/skill_transfer)**|\n", "2411.11707": "|**2024-11-18**|**FedCoLLM: A Parameter-Efficient Federated Co-tuning Framework for Large and Small Language Models**|Tao Fan et.al.|[2411.11707](http://arxiv.org/abs/2411.11707)|null|\n", "2411.11694": "|**2024-11-18**|**Technical Report: Enhancing LLM Reasoning with Reward-guided Tree Search**|Jinhao Jiang et.al.|[2411.11694](http://arxiv.org/abs/2411.11694)|null|\n", "2411.11683": "|**2024-11-18**|**TrojanRobot: Backdoor Attacks Against Robotic Manipulation in the Physical World**|Xianlong Wang et.al.|[2411.11683](http://arxiv.org/abs/2411.11683)|null|\n", "2411.12736": "|**2024-11-19**|**ACING: Actor-Critic for Instruction Learning in Black-Box Large Language Models**|Salma Kharrat et.al.|[2411.12736](http://arxiv.org/abs/2411.12736)|**[link](https://github.com/salmakh1/ACING)**|**大型语言模型（LLMs）在解决任务时的有效性很大程度上取决于指令的质量，而这通常需要通过大量的人力进行微调。这突显了自动化指令优化的必要性；然而，当面对黑盒LLMs时，这种优化尤为困难，因为这些模型的参数和梯度是不可访问的。我们提出了ACING，这是一种特定于任务的提示优化方法，被构建为一个无状态连续动作强化学习（RL）问题，也称为连续带环境设置。ACING利用基于演员-评论家的方法来优化提示，从不可微分的奖励信号中学习。我们通过优化ChatGPT在30个基于指令的任务上的提示来验证ACING。ACING始终优于基线方法，实现了平均10个百分点的得分提升。此外，ACING不仅恢复了人类精心设计的专业指令，还在某些情况下超越了这些指令，与人类基准相比最高可达39个百分点的改进。**|\n", "2411.12701": "|**2024-11-19**|**When Backdoors Speak: Understanding LLM Backdoor Attacks Through Model-Generated Explanations**|Huaizhi Ge et.al.|[2411.12701](http://arxiv.org/abs/2411.12701)|null|大型语言模型（LLMs）容易受到后门攻击，其中隐藏的触发器可以恶意操纵模型行为。虽然已经提出了几种后门攻击方法，但后门功能在LLMs中的运作机制仍然未被充分探索。在这篇论文中，我们超越了对LLMs的攻击，通过自然语言解释的新视角来研究后门功能。具体来说，我们利用LLMs的生成能力来为其决策生成人类可理解的解释，从而比较干净样本和中毒样本的解释。我们探讨了多种后门攻击，并将后门嵌入到LLaMA模型中以执行多个任务。我们的实验表明，带有后门的模型为干净数据生成的解释质量更高，而为中毒数据生成的解释则比干净数据更一致。我们进一步分析了解释生成过程，发现从令牌层面来看，中毒样本的解释令牌仅出现在LLM的最后几层Transformer中。从句子层面来看，注意力动态显示，在生成解释时，中毒输入会将注意力从输入上下文中转移开。这些发现加深了我们对LLMs中后门攻击机制的理解，并提供了一个通过可解释性技术检测此类漏洞的框架，有助于开发更安全的LLMs。|\n", "2411.12593": "|**2024-11-19**|**AdaCM$^2$: On Understanding Extremely Long-Term Video with Adaptive Cross-Modality Memory Reduction**|Yuanbin Man et.al.|[2411.12593](http://arxiv.org/abs/2411.12593)|null|大型语言模型（LLM）的进步推动了通过将LLM与视觉模型结合来改进视频理解任务。然而，大多数现有的基于LLM的模型（如VideoLLaMA、VideoChat）仅限于处理短时长的视频。最近尝试通过提取并压缩视觉特征到固定内存大小来理解长时间视频。但是，这些方法仅利用视觉模态来合并视频标记，忽略了视觉和文本查询之间的关联性，导致难以有效处理复杂的问答任务。为了解决长视频和复杂提示带来的挑战，我们提出了AdaCM²，首次引入了一种自回归方式下在视频流中进行视频-文本对齐的适应性跨模态内存减少方法。我们在各种视频理解任务上的广泛实验，包括视频字幕生成、视频问答和视频分类，表明AdaCM²在多个数据集上达到了最先进的性能，同时显著减少了内存使用。值得注意的是，在LVU数据集中的多项任务上实现了4.5%的性能提升，并且GPU内存消耗最多减少了65%。|\n", "2411.12643": "|**2024-11-19**|**DLBacktrace: A Model Agnostic Explainability for any Deep Learning Models**|Vinay Kumar Sankarapu et.al.|[2411.12643](http://arxiv.org/abs/2411.12643)|**[link](https://github.com/aryaxai/dlbacktrace)**|**人工智能的快速发展催生了越来越复杂的深度学习模型，这些模型通常作为不透明的“黑盒”运行，其决策过程缺乏透明度。这种可解释性的缺乏在高风险应用中带来了相当大的挑战，因为在这些领域中，理解模型输出背后的理由与输出本身一样重要。本研究针对AI系统中对可解释性的迫切需求，强调了其在建立信任、确保责任和促进关键任务领域负责任部署中的作用。为了解决深度学习中的可解释性挑战，我们引入了由AryaXAI团队开发的一种创新技术DLBacktrace，该技术能够揭示从简单的多层感知机（MLPs）、卷积神经网络（CNNs）、大型语言模型（LLMs）到计算机视觉模型等多种领域的模型决策。我们提供了DLBacktrace算法的全面概述，并展示了基准测试结果，将其性能与已建立的可解释性方法如SHAP、LIME、GradCAM、集成梯度、SmoothGrad和注意力回溯等进行了比较，使用了多样化的基于任务的指标。所提出的DLBacktrace技术与各种用PyTorch和TensorFlow构建的模型架构兼容，支持诸如Llama 3.2、其他自然语言处理架构如BERT和LSTMs、计算机视觉模型如ResNet和U-Net以及用于表格数据的自定义深度神经网络（DNN）模型。这种灵活性突显了DLBacktrace在增强跨广泛应用程序模型透明度方面的适应性和有效性。该库是开源的，可以在https://github.com/AryaXAI/DLBacktrace 获取。**|\n", "2411.12641": "|**2024-11-19**|**Improving Controllability and Editability for Pretrained Text-to-Music Generation Models**|Yixiao Zhang et.al.|[2411.12641](http://arxiv.org/abs/2411.12641)|null|在AI辅助音乐创作领域已经取得了显著进展，但现有的系统往往难以满足迭代和细致音乐制作的需求。这些挑战包括对生成内容的充分控制以及灵活、精确的编辑能力。本论文针对这些问题，通过一系列逐步构建的改进，提高了文本到音乐生成模型的可控性和可编辑性。首先，我们引入了Loop Copilot系统，该系统试图解决音乐创作中迭代改进的需求。Loop Copilot利用大型语言模型（LLM）来协调多个专门的AI模型，使用户能够通过对话界面交互地生成和精炼音乐。该系统的核心是全局属性表，它记录并维护整个迭代过程中的关键音乐属性，确保任何阶段的修改都能保持音乐的整体一致性。尽管Loop Copilot擅长于组织音乐创作过程，但它并未直接解决对生成内容进行详细编辑的需求。  为克服这一局限，MusicMagus被提出作为一种进一步解决方案，用于编辑AI生成的音乐。MusicMagus引入了一种零样本文本到音乐编辑方法，允许修改特定的音乐属性，如流派、情绪和乐器编配，而无需重新训练模型。通过操控预训练扩散模型内的潜在空间，MusicMagus确保这些编辑在风格上是一致的，并且非目标属性保持不变。该系统在编辑过程中特别有效地保持了音乐结构的完整性，但在处理更复杂和现实世界的音频场景时遇到了挑战。|\n", "2411.12571": "|**2024-11-19**|**Large Language Models for Combinatorial Optimization of Design Structure Matrix**|Shuo Jiang et.al.|[2411.12571](http://arxiv.org/abs/2411.12571)|null|组合优化（CO）对于提高工程应用的效率和性能至关重要。随着问题规模的增大和依赖关系的复杂化，识别最优解变得越来越具有挑战性。在面对实际工程问题时，基于纯数学推理的算法存在局限性，无法捕捉到优化所需的上下文细微差别。本研究探讨了大型语言模型（LLMs）通过利用其推理能力和上下文知识来解决工程CO问题的潜力。我们提出了一种新颖的基于LLM的框架，该框架集成了网络拓扑结构和领域知识，以优化设计结构矩阵（DSM）的排序——这是一个常见的CO问题。我们在各种DSM案例上的实验表明，所提出的方法比基准方法实现了更快的收敛速度和更高的解决方案质量。此外，结果显示，即使选择不同的LLMs，结合上下文领域知识也能显著提升性能。这些发现突显了LLMs在结合语义和数学推理解决复杂的实际CO问题方面的潜力。这种方法为现实世界的组合优化开辟了新的范式。|\n", "2411.12498": "|**2024-11-19**|**Enhancing Reasoning Capabilities of LLMs via Principled Synthetic Logic Corpus**|Terufumi Morishita et.al.|[2411.12498](http://arxiv.org/abs/2411.12498)|**[link](https://github.com/hitachi-nlp/fld)**|**大型语言模型（LLMs）能够解决广泛的任务，但在推理方面仍存在困难。为了解决这个问题，我们提出了**附加逻辑训练（ALT）**，通过程序生成的逻辑推理样本来增强LLMs的推理能力。我们首先通过整合符号逻辑理论和先前的经验见解来建立设计高质量样本的原则。然后，基于这些原则，我们构建了一个名为**形式逻辑演绎多样化（FLD$^{\\times 2}$）**的合成语料库，其中包含大量多步骤演绎、未知事实、多样化的推理规则、多样化的语言表达以及具有挑战性的干扰项的样本。最后，我们通过实验证明，在FLD$^{\\times 2}$上进行ALT显著提升了包括LLaMA-3.1-70B在内的最先进LLMs的推理能力。改进包括在逻辑推理基准测试中最多提高了30分，在数学和编码基准测试中最多提高了10分，在基准测试套件BBH中提高了5分。**|\n", "2411.12469": "|**2024-11-19**|**AI Flow at the Network Edge**|Jiawei Shao et.al.|[2411.12469](http://arxiv.org/abs/2411.12469)|null|最近，大型语言模型（LLM）及其多模态变体在各个领域取得了显著进展，展示了令人印象深刻的能力和前所未有的潜力。在无处不在的连接时代，利用通信网络来分发智能是一种变革性的概念，预想将由AI驱动的服务扩展到网络边缘。然而，将大型模型从云端推送到资源受限的环境中面临着关键挑战。在低端设备上进行模型推理会导致过高的延迟和性能瓶颈，而通过带宽有限的网络传输原始数据则会造成高昂的通信开销。本文提出了AI Flow框架，该框架通过联合利用设备、边缘节点和云服务器上的异构资源，简化了推理过程，使智能在网络中流动。为了促进多个计算节点之间的协作，所提出的框架探索了一种通信网络系统设计的范式转变，即从传输信息流转变为传输智能流，在这种模式下，通信的目标是面向任务的，并被纳入推理过程中。实验结果通过图像字幕用例展示了所提框架的有效性，证明了其在减少响应延迟的同时保持高质量字幕的能力。本文作为一篇立场论文，旨在明确AI Flow的动机、挑战和原则。|\n", "2411.12460": "|**2024-11-19**|**Guide-to-Explain for Controllable Summarization**|Sangwon Ryu et.al.|[2411.12460](http://arxiv.org/abs/2411.12460)|null|最近，大型语言模型（LLM）在抽象性摘要任务中展示了卓越的性能。然而，可控摘要生成方面仍待进一步探索，这限制了它们根据特定用户偏好生成摘要的能力。在本文中，我们首先研究了LLM控制多种属性的能力，发现它们在数值属性（如长度和提取度）方面比语言属性面临更大的挑战。为了解决这一问题，我们提出了一种指导-解释框架（GTE），用于可控摘要生成。我们的GTE框架使模型能够识别初始草稿中的不一致属性，并引导其解释先前输出中的错误。基于这种反思，模型生成一个调整得当的摘要。因此，通过允许模型反思其不一致性，我们能够在比其他仅使用LLM的迭代方法更少的迭代次数内生成满足所需属性的摘要。|\n", "2411.12449": "|**2024-11-19**|**\\textsc{Neon}: News Entity-Interaction Extraction for Enhanced Question Answering**|Sneha Singhania et.al.|[2411.12449](http://arxiv.org/abs/2411.12449)|null|在近乎实时地捕捉新信息并用它来增强现有的大型语言模型（LLMs）对于生成最新、有根据且可靠的输出至关重要。当LLMs用于快速发展的领域中的信息任务时，这个问题变得尤为具有挑战性，例如与最近或正在发生的涉及实体的事件相关的网络搜索，要生成时间上相关性的响应需要访问最新的新闻来源。然而，由LLMs参数记忆建模的信息往往是过时的，而典型的检索系统的结果可能无法捕捉到最新相关信息，并且难以处理不断变化的新闻中的冲突报道。为了解决这一挑战，我们提出了NEON框架，旨在从新闻文章中提取新兴实体之间的互动——如事件或活动。NEON构建了一个以实体为中心的时间戳知识图谱，捕捉这些互动，从而增强了与新闻事件相关的问答能力。我们的框架通过将开放信息抽取（openIE）风格的元组集成到LLMs中进行上下文内检索增强生成，展示了在处理时间敏感、以实体为中心的搜索查询时显著提高了QA性能。借助NEON，LLMs能够提供更准确、可靠和最新的响应。|\n"}, "moe": {"2411.02115": "|**2024-11-04**|**FedMoE-DA: Federated Mixture of Experts via Domain Aware Fine-grained Aggregation**|Ziwei Zhan et.al.|[2411.02115](http://arxiv.org/abs/2411.02115)|null|\n", "2411.01457": "|**2024-11-03**|**Facet-Aware Multi-Head Mixture-of-Experts Model for Sequential Recommendation**|Mingrui Liu et.al.|[2411.01457](http://arxiv.org/abs/2411.01457)|null|\n", "2411.01433": "|**2024-11-06**|**HOBBIT: A Mixed Precision Expert Offloading System for Fast MoE Inference**|Peng Tang et.al.|[2411.01433](http://arxiv.org/abs/2411.01433)|null|\n", "2411.01288": "|**2024-11-07**|**HEXA-MoE: Efficient and Heterogeneous-aware MoE Acceleration with ZERO Computation Redundancy**|Shuqing Luo et.al.|[2411.01288](http://arxiv.org/abs/2411.01288)|**[link](https://github.com/unites-lab/hexa-moe)**|\n", "2411.01245": "|**2024-11-02**|**PMoL: Parameter Efficient MoE for Preference Mixing of LLM Alignment**|Dongxu Liu et.al.|[2411.01245](http://arxiv.org/abs/2411.01245)|null|\n", "2411.01016": "|**2024-11-01**|**MoE-I$^2$: Compressing Mixture of Experts Models through Inter-Expert Pruning and Intra-Expert Low-Rank Decomposition**|Cheng Yang et.al.|[2411.01016](http://arxiv.org/abs/2411.01016)|null|\n", "2411.02433": "|**2024-11-01**|**SLED: Self Logits Evolution Decoding for Improving Factuality in Large Language Models**|Jianyi Zhang et.al.|[2411.02433](http://arxiv.org/abs/2411.02433)|null|\n", "2411.00662": "|**2024-11-01**|**MoNTA: Accelerating Mixture-of-Experts Training with Network-Traffc-Aware Parallel Optimization**|Jingming Guo et.al.|[2411.00662](http://arxiv.org/abs/2411.00662)|**[link](https://github.com/enflametechnology/deepspeed)**|\n", "2411.00918": "|**2024-11-01**|**LIBMoE: A Library for comprehensive benchmarking Mixture of Experts in Large Language Models**|Nam V. Nguyen et.al.|[2411.00918](http://arxiv.org/abs/2411.00918)|**[link](https://github.com/Fsoft-AIC/LibMoE)**|\n", "2410.23836": "|**2024-10-31**|**Stereo-Talker: Audio-driven 3D Human Synthesis with Prior-Guided Mixture-of-Experts**|Xiang Deng et.al.|[2410.23836](http://arxiv.org/abs/2410.23836)|null|\n", "2411.06826": "|**2024-11-11**|**Adaptive Conditional Expert Selection Network for Multi-domain Recommendation**|Kuiyao Dong et.al.|[2411.06826](http://arxiv.org/abs/2411.06826)|null|混合专家（MOE）方法因其强大的表达能力，已成为多领域推荐（MDR）领域的实际标准。然而，这种基于MOE的方法通常为每个实例使用所有专家，导致可扩展性问题和领域与专家之间的低区分度。此外，常用的特定领域网络设计进一步加剧了可扩展性问题。为了解决这些问题，我们提出了一种名为CESAA的新方法，该方法包括条件专家选择（CES）模块和自适应专家聚合（AEA）模块来应对这些挑战。具体来说，CES首先结合稀疏门控策略与领域共享专家。然后，AEA利用互信息损失增强专家与特定领域之间的关联，并显著提高专家间的区分度。因此，对于每个实例，只有领域共享专家和选定的领域特定专家被激活，在计算效率和模型性能之间取得了平衡。在公共排名和工业检索数据集上的实验结果验证了我们的方法在MDR任务中的有效性。|\n", "2411.06056": "|**2024-11-09**|**Learning Mixtures of Experts with EM**|Quentin Fruytier et.al.|[2411.06056](http://arxiv.org/abs/2411.06056)|null|专家混合模型（MoE）是一种机器学习模型，它涉及将输入空间进行划分，并为每个划分训练一个独立的“专家”模型。最近，MoE 作为当今大型语言模型中的组件变得流行起来，以此作为减少训练和推理成本的一种手段。在那里，分区函数和专家都是通过梯度下降法在对数似然上共同学习的。本文重点研究了期望最大化（EM）算法在MoE模型训练中的效率。我们首先严格分析了线性或逻辑回归专家情况下EM的表现，表明EM等同于使用单位步长和KL散度正则化器的镜像下降。这一视角使我们能够推导出新的收敛结果，并基于信噪比（SNR）识别局部线性收敛的条件。在合成数据和小规模真实世界数据上的实验表明，EM在收敛速度和达到的准确性方面均优于梯度下降算法。|\n", "2411.08446": "|**2024-11-13**|**LSH-MoE: Communication-efficient MoE Training via Locality-Sensitive Hashing**|Xiaonan Nie et.al.|[2411.08446](http://arxiv.org/abs/2411.08446)|null|较大的Transformer模型在各种任务上总是表现更好，但扩大模型规模需要更高的成本。为了高效地扩大模型规模，广泛采用了混合专家（MoE）架构，该架构由一个门控网络和一系列专家组成，通过将输入数据路由到固定数量的专家而不是所有专家来保持训练成本不变。在现有的大规模MoE训练系统中，专家会被分布在不同的GPU上以实现并行化，因此输入数据需要额外的全对全通信才能访问目标专家并进行相应的计算。然而，在评估三种主流MoE模型在常用GPU集群上的训练过程时，我们发现全对全通信的比例平均约为45%，这显著阻碍了MoE模型训练的效率和可扩展性。在这篇论文中，我们提出了LSH-MoE，一种使用局部敏感哈希（LSH）的通信高效MoE训练框架。我们首先展示了现有系统中扩展MoE训练的问题，并强调了利用标记相似性促进数据压缩的潜力。接着，我们介绍了一种高效的基于LSH的压缩技术，该技术利用交叉多面体哈希进行快速聚类，并实施基于残差的误差补偿方案以减轻压缩带来的负面影响。为了验证我们方法的有效性，我们在预训练和微调任务中对语言模型（如RoBERTa、GPT和T5）和视觉模型（如Swin）进行了实验。结果表明，我们的方法在不同任务上显著优于其同类方法，速度提高了1.28倍至2.2倍。|\n", "2411.08212": "|**2024-11-12**|**PERFT: Parameter-Efficient Routed Fine-Tuning for Mixture-of-Expert Model**|Yilun Liu et.al.|[2411.08212](http://arxiv.org/abs/2411.08212)|null|混合专家（MoE）范式已成为一种强大的方法，通过改进资源利用来扩展Transformer模型。然而，高效微调MoE模型仍然很大程度上未被探索。受近期参数高效微调（PEFT）工作的启发，我们提出了一种将PEFT模块直接集成到MoE机制中的统一框架。该框架与MoE的核心原则和架构保持一致，涵盖了包括多种功能和组合策略在内的设计维度。通过在我们的框架内结合不同的设计选择，我们引入了参数高效路由微调（PERFT），这是一种灵活且可扩展的PEFT策略家族，专为MoE模型定制。通过对OLMoE-1B-7B和Mixtral-8x7B模型进行常识推理和算术推理任务的适应性实验，证明了PERFT的有效性、可扩展性和有趣的动态特性。此外，我们还提供了每个具体设计选择的经验结果，以促进MoE和PEFT更好的应用。|\n", "2411.08982": "|**2024-11-13**|**Lynx: Enabling Efficient MoE Inference through Dynamic Batch-Aware Expert Selection**|Vima Gupta et.al.|[2411.08982](http://arxiv.org/abs/2411.08982)|null|混合专家（MoE）架构最近在实现大型语言模型的高效扩展方面获得了广泛关注。然而，我们发现了一个根本性的矛盾：虽然MoE旨在选择性地激活专家，但生产环境中的请求批处理迫使所有专家都被激活，从而在解码阶段抵消了MoE的效率优势。我们提出了Lynx系统，该系统通过动态、批量感知的专家选择来实现高效的MoE推理。我们的关键见解是，在不同的标记和推理阶段，专家的重要性差异显著，这为运行时优化提供了机会。Lynx利用这一见解，通过一个轻量级框架动态减少活跃专家的数量，同时保持模型准确性。我们的评估表明，Lynx在复杂的代码生成和数学推理任务中实现了高达1.55倍的推理延迟减少，而与基线模型相比几乎没有准确性损失。|\n", "2411.08968": "|**2024-11-13**|**Sparse Upcycling: Inference Inefficient Finetuning**|Sasha Doubov et.al.|[2411.08968](http://arxiv.org/abs/2411.08968)|null|小型、高度训练的开源大型语言模型因其推理效率而被广泛使用，但进一步提高其质量仍然是一个挑战。稀疏升级是一种有前景的方法，它将预训练的密集模型转换为混合专家（MoE）架构，增加模型的参数数量和质量。在这项工作中，我们比较了不同模型大小、计算预算和预训练时长下，稀疏升级与持续预训练（CPT）的有效性。我们的实验表明，在某些情况下，稀疏升级可以实现更好的质量，相对于CPT提高了超过20%。然而，这伴随着显著的推理成本，在高需求推理设置中对于较大模型会导致40%的减速。我们的研究结果突显了模型质量和推理效率之间的权衡，为寻求平衡模型质量和部署约束的从业者提供了见解。|\n", "2411.10003": "|**2024-11-15**|**Pro-Prophet: Systematic Load Balancing Method for Efficient Parallel Training of Large-scale MoE Models**|Wei Wang et.al.|[2411.10003](http://arxiv.org/abs/2411.10003)|null|深度学习模型的规模一直在增加，以提高模型质量。随着模型大小线性增长的训练计算预算意味着训练一个极其大规模的模型将非常耗时。最近，专家混合（MoE）由于能够在保持稳定计算预算的情况下扩展模型到超大规模而受到广泛关注。然而，大规模MoE模型的低效分布式训练阻碍了其更广泛的应用。特别是在训练过程中，设备之间会出现显著的动态负载不平衡，大大降低了吞吐量。为了解决这一挑战，已经提出了几种负载均衡方案。系统级解决方案因其对硬件友好且不影响模型收敛性而比算法级方案更加受到关注。然而，它们面临着高通信成本和通信-计算重叠差的问题。为了解决这些挑战，我们提出了一种系统性的负载均衡方法Pro-Prophet，它由规划器和调度器组成，用于高效地并行训练大规模MoE模型。为了适应动态负载不平衡，我们收集训练统计数据，并基于这些数据设计了Pro-Prophet。为了减少通信量，Pro-Prophet规划器确定了一系列轻量级负载均衡策略，并根据统计数据高效搜索出一种通信效率高的训练方式。为了充分重叠通信与计算，Pro-Prophet调度器基于统计数据和操作特性来安排依赖于数据的操作，进一步提高了训练吞吐量。实验结果表明，与Deepspeed-MoE和FasterMoE相比，Pro-Prophet最高可达到2.66倍的速度提升。此外，与FasterMoE相比，Pro-Prophet在负载均衡方面实现了高达11.01倍的改进。|\n", "2411.11217": "|**2024-11-18**|**MoE-Lightning: High-Throughput MoE Inference on Memory-constrained GPUs**|Shiyi Cao et.al.|[2411.11217](http://arxiv.org/abs/2411.11217)|null|在资源受限的平台上高效部署大规模语言模型，特别是混合专家（MoE）模型，面临着显著的挑战，尤其是在计算效率和内存利用方面。MoE架构以其能够增加模型容量而不成比例地增加推理成本的能力而闻名，与密集模型相比，大大减少了令牌生成延迟。然而，由于模型体积庞大，使得没有高端GPU的人难以使用MoE模型。在这篇论文中，我们提出了一种高吞吐量的MoE批量推理系统——MoE-Lightning，该系统在性能上明显优于以往的工作。MoE-Lightning引入了一种新的CPU-GPU-I/O流水线调度方法CGOPipe，并采用了分页权重来实现高资源利用率。此外，基于我们提出的分层屋顶线模型HRM，可以帮助找到比现有系统具有更高吞吐量的策略。对于单个T4 GPU (16GB)上的Mixtral 8x7B模型，MoE-Lightning可以达到比最先进的支持卸载的LLM推理系统高达10.3倍的吞吐量。当理论系统吞吐量受到GPU内存限制时，MoE-Lightning能够在使用少2-3倍CPU内存的情况下达到吞吐量上限，从而显著提高了资源利用率。此外，MoE-Lightning还支持在多个低成本GPU（例如2-4个T4）上对更大的MoE模型（如Mixtral 8x22B和DBRX）进行高效的批量推理。|\n", "2411.10669": "|**2024-11-16**|**Awaker2.5-VL: Stably Scaling MLLMs with Parameter-Efficient Mixture of Experts**|Jinqiang Long et.al.|[2411.10669](http://arxiv.org/abs/2411.10669)|**[link](https://github.com/metabrainagi/awaker)**|**随着多模态大语言模型（MLLMs）研究的流行，先进的MLLM模型通常需要能够同时处理各种文本和视觉任务（如VQA、检测、OCR和ChartQA），以满足实际应用需求。然而，由于来自不同任务的数据在表示和分布上存在显著差异，简单地将所有任务的数据混合在一起会导致众所周知的“多任务冲突”问题，从而导致各任务性能下降。为了解决这个问题，我们提出了Awaker2.5-VL，这是一种适用于MLLM的专家混合（MoE）架构，通过多个稀疏激活的专家来获取多任务能力。为了加速Awaker2.5-VL的训练和推理，我们模型中的每个专家都设计为低秩适应（LoRA）结构。在多个最新基准上的广泛实验表明了Awaker2.5-VL的有效性。代码和模型权重已在我们的项目页面发布：https://github.com/MetabrainAGI/Awaker。**|\n", "2411.12364": "|**2024-11-19**|**Ultra-Sparse Memory Network**|Zihao Huang et.al.|[2411.12364](http://arxiv.org/abs/2411.12364)|null|众所周知，Transformer模型的性能与其参数数量和计算复杂度呈指数关系。尽管像专家混合（MoE）这样的方法可以将参数数量与计算复杂度解耦，但在推理过程中仍面临由于高内存访问成本带来的挑战。本文介绍了UltraMem，通过引入大规模、超稀疏的记忆层来解决这些限制。我们的方法显著降低了推理延迟，同时保持了模型性能。我们还研究了这种新架构的扩展规律，结果表明它不仅具有良好的扩展特性，而且优于传统模型。在实验中，我们训练了包含多达2000万个记忆槽的网络。结果显示，我们的方法在给定的计算预算内实现了最先进的推理速度和模型性能。|\n"}, "SSMs": {"2411.03855": "|**2024-11-06**|**MambaPEFT: Exploring Parameter-Efficient Fine-Tuning for Mamba**|Masakazu Yoshimura et.al.|[2411.03855](http://arxiv.org/abs/2411.03855)|null|基于Transformer的模型通过使用大量数据构建大型模型，已经建立了一个生态系统。参数高效微调（PEFT）是一项关键技术，它能够以最小的成本将这些模型部署到下游任务中，并实现有效的性能。最近，基于状态空间模型（SSM）的Mamba作为一种潜在的替代方案引起了关注。尽管已经提出了许多大规模的基于Mamba的模型，但如何高效地将预训练的Mamba模型适应到下游任务上仍然是一个未被充分探索的领域。在本文中，我们对Mamba的PEFT方法进行了探索性分析。我们研究了现有用于Transformer的PEFT方法在应用于Mamba时的有效性，并对这些方法进行了调整，使其更好地与Mamba架构对齐。此外，我们还提出了一些新的特定于Mamba的PEFT方法，这些方法利用了Mamba的独特结构。我们的实验表明，PEFT对于Mamba比对于Transformer更为有效。最后，我们展示了如何有效地组合多种PEFT方法，并提供了一个优于先前工作的框架。为了确保可复现性，我们将在论文发表后公开代码。|\n", "2411.02949": "|**2024-11-05**|**A scalable generative model for dynamical system reconstruction from neuroimaging data**|Eric Volkmann et.al.|[2411.02949](http://arxiv.org/abs/2411.02949)|null|基于观察到的时间序列推断生成动力学是机器学习和自然科学领域日益受到关注的话题。在神经科学中，这类方法有望减轻基于生物物理原理手工构建模型的需求，并能够自动化地推断大脑动力学中的个体间差异。最近，在针对动力系统重建（DSR）的训练技术方面取得的突破，使得即使是从较短时间序列中也能恢复出包括其几何（吸引子）和长期统计不变量在内的底层系统。这些技术基于控制论的思想，如现代变体的教师强迫（TF），以确保在训练过程中损失梯度的稳定传播。然而，目前这些技术并不直接适用于那些当前观测依赖于整个先前状态历史的数据模态，这是由于信号的滤波特性所导致的，这在神经科学（以及更广泛的生理学中）很常见。典型的例子包括功能性磁共振成像（fMRI）中的血氧水平依赖（BOLD）信号或Ca²⁺成像数据。这种类型的信号使状态空间模型（SSM）的解码器模型变得不可逆，而这正是以前基于TF的方法所需要的。本文利用了近期在训练SSM上的控制技术的成功，提出了一种新的算法来解决这个问题，并且该算法在模型维度和滤波长度上具有极好的可扩展性。我们通过从简短的BOLD时间序列中高效重建动力系统，包括其状态空间几何结构和长期时间属性，展示了该算法的有效性。|\n", "2411.02824": "|**2024-11-05**|**Layer-Adaptive State Pruning for Deep State Space Models**|Minseon Gwak et.al.|[2411.02824](http://arxiv.org/abs/2411.02824)|**[link](https://github.com/msgwak/last)**|\n", "2411.02217": "|**2024-11-04**|**Recursive Learning of Asymptotic Variational Objectives**|Alessandro Mastrototaro et.al.|[2411.02217](http://arxiv.org/abs/2411.02217)|null|\n", "2411.01030": "|**2024-11-07**|**Birdie: Advancing State Space Models with Reward-Driven Objectives and Curricula**|Sam Blouir et.al.|[2411.01030](http://arxiv.org/abs/2411.01030)|**[link](https://github.com/samblouir/birdie)**|\n", "2411.00233": "|**2024-10-31**|**SambaMixer: State of Health Prediction of Li-ion Batteries using Mamba State Space Models**|José Ignacio Olalde-Verano et.al.|[2411.00233](http://arxiv.org/abs/2411.00233)|**[link](https://github.com/sascha-kirch/samba-mixer)**|\n", "2411.00218": "|**2024-10-31**|**Nudging state-space models for Bayesian filtering under misspecified dynamics**|Fabian Gonzalez et.al.|[2411.00218](http://arxiv.org/abs/2411.00218)|null|\n", "2411.00151": "|**2024-10-31**|**NIMBA: Towards Robust and Principled Processing of Point Clouds With SSMs**|Nursena Köprücü et.al.|[2411.00151](http://arxiv.org/abs/2411.00151)|null|\n", "2410.23882": "|**2024-10-31**|**In-Context Learned Equalization in Cell-Free Massive MIMO via State-Space Models**|Zihang Song et.al.|[2410.23882](http://arxiv.org/abs/2410.23882)|null|\n", "2410.19382": "|**2024-10-28**|**Multi-Agent Reinforcement Learning with Selective State-Space Models**|Jemma Daniel et.al.|[2410.19382](http://arxiv.org/abs/2410.19382)|null|\n", "2411.04760": "|**2024-11-07**|**Zero-Shot Temporal Resolution Domain Adaptation for Spiking Neural Networks**|Sanja Karilanova et.al.|[2411.04760](http://arxiv.org/abs/2411.04760)|null|脉冲神经网络（SNNs）是一种受生物启发的深度神经网络，能够高效地提取时间信息，并在部署于神经形态设备上时，在能耗和延迟方面表现出显著的优势。然而，SNN模型参数对时间分辨率非常敏感，当边缘设备上的目标数据的时间分辨率与训练所用的预部署源数据的时间分辨率不同时，尤其是无法在边缘进行微调的情况下，会导致性能大幅下降。为了解决这一挑战，我们提出了三种新的域适应方法，以适应由于时间分辨率变化引起的神经元参数调整，而无需在目标时间分辨率下重新训练。这些方法基于SNN中的神经元动态与状态空间模型（SSMs）之间的映射关系，并适用于一般的神经元模型。我们在时空数据任务中评估了所提出的方法，包括音频关键词识别数据集SHD和MSWC以及图像分类NMINST数据集。我们的方法提供了一种替代现有参考方法（简单地缩放时间常数）的选择，并且在大多数情况下显著优于现有方法。此外，实验结果表明，通过在较低时间分辨率的数据上进行高效的训练并进行模型适应，可以实现对高时间分辨率数据的高精度处理。|\n", "2411.04165": "|**2024-11-06**|**Bio-xLSTM: Generative modeling, representation and in-context learning of biological and chemical sequences**|Niklas Schmidinger et.al.|[2411.04165](http://arxiv.org/abs/2411.04165)|**[link](https://github.com/ml-jku/chem-xlstm)**|**用于生物和化学序列的语言模型能够支持药物发现、蛋白质工程和精准医疗等关键应用。目前，这些语言模型主要基于Transformer架构。虽然Transformer已经取得了令人印象深刻的结果，但其运行时间对序列长度的二次依赖性使其在处理长基因组序列以及蛋白质和化学序列中的上下文学习时变得复杂。最近，递归xLSTM架构在自然语言领域中表现出优于Transformer和现代状态空间模型（SSM）架构的性能。与SSM类似，xLSTM对序列长度具有线性的运行时间依赖，并且在推理时允许常数内存解码，这使得它们成为建模生物和化学序列中长距离依赖关系的理想选择。在这项工作中，我们针对这些领域调整了xLSTM，并提出了一套称为Bio-xLSTM的架构变体。我们在基因组学、蛋白质和化学三个大领域进行了广泛的实验，以评估xLSTM建模生物和化学序列的能力。结果表明，基于Bio-xLSTM的模型a)可以作为DNA、蛋白质和化学序列的有效生成模型，b)能学习这些模式的丰富表示，c)能够在蛋白质和小分子上进行上下文学习。**|\n", "2411.06968": "|**2024-11-11**|**Mamba-based Decoder-Only Approach with Bidirectional Speech Modeling for Speech Recognition**|Yoshiki Masuyama et.al.|[2411.06968](http://arxiv.org/abs/2411.06968)|**[link](https://github.com/YoshikiMas/madeon-asr)**|**选择性状态空间模型（SSM）通过Mamba在各种任务中展示了其计算效率和良好的效果，包括自动语音识别（ASR）。Mamba已经应用于基于注意力机制的编码器-解码器框架中的ASR任务，其中保持了编码器和解码器之间的交叉注意力机制。本文探讨了Mamba作为仅解码器架构在ASR任务中的能力。我们提出的基于MAmba的仅解码器方法（MADEON）由一个单独的解码器组成，该解码器以语音标记为条件并以自回归方式预测文本标记。为了增强MADEON，我们进一步提出了对语音标记进行双向处理的语音前缀技术，这丰富了隐藏状态中的上下文信息。实验表明，MADEON显著优于非选择性的SSM。结合语音前缀技术和最近提出的Mamba-2，在大型数据集上取得了与基于Transformer的模型相当的性能。**|\n", "2411.06318": "|**2024-11-10**|**SEM-Net: Efficient Pixel Modelling for image inpainting with Spatially Enhanced SSM**|Shuang Chen et.al.|[2411.06318](http://arxiv.org/abs/2411.06318)|**[link](https://github.com/chrischen1023/sem-net)**|**图像修复旨在基于已知区域的信息修复部分损坏的图像。实现语义上合理的修复结果特别具有挑战性，因为它要求重建的区域展示出与语义一致区域相似的模式。这需要一个能够捕捉长距离依赖关系的强大模型。现有的模型在这方面表现不佳，因为基于卷积神经网络（CNN）的方法的感受野增长缓慢，而基于Transformer的方法在块级别进行交互，在捕捉长距离依赖关系方面效率低下。为此，我们提出了SEM-Net，一种新颖的视觉状态空间模型（SSM）视觉网络，该网络在像素级别对损坏图像进行建模，同时在状态空间中捕捉长距离依赖关系，实现了线性的计算复杂度。为了解决SSM固有的空间感知不足问题，我们引入了蛇曼巴块（SMB）和空间增强前馈网络。这些创新使SEM-Net在两个不同的数据集上超越了最先进的修复方法，显著提高了捕捉长距离依赖关系的能力和空间一致性。此外，SEM-Net在运动去模糊任务上也达到了最先进的性能，展示了其泛化能力。我们的源代码将在https://github.com/ChrisChen1023/SEM-Net发布。**|\n", "2411.07364": "|**2024-11-11**|**AEROMamba: An efficient architecture for audio super-resolution using generative adversarial networks and state space models**|Wallace Abreu et.al.|[2411.07364](http://arxiv.org/abs/2411.07364)|null|音频超分辨率旨在通过创建高频内容来增强低分辨率信号。在这项工作中，我们修改了AERO（该任务中的一种最先进系统）的架构，以实现音乐超分辨率。具体来说，我们将其原有的注意力和LSTM层替换为Mamba，这是一种状态空间模型（SSM），应用于所有网络层。Mamba能够有效地替代上述模块，因为它提供了一种类似于注意力机制的功能，同时也可以作为循环网络运行。所提出的AEROMamba在训练时所需的GPU内存减少了2-4倍，因为Mamba利用了卷积公式并利用了GPU内存层次结构。此外，在推理过程中，由于Mamba的递归特性，它在常数内存下运行，避免了与注意力机制相关的内存增长。这使得使用更少的GPU（5倍减少）实现了14倍的速度提升。主观听音测试（0到100分制）表明，所提出的模型优于AERO模型。在MUSDB数据集中，退化信号得分为38.22，而AERO和AEROMamba得分分别为60.03和66.74。对于PianoEval数据集，退化信号得分为72.92，AERO得分为76.89，AEROMamba得分为84.41。|\n", "2411.11843": "|**2024-11-18**|**Bi-Mamba: Towards Accurate 1-Bit State Space Models**|Shengkun Tang et.al.|[2411.11843](http://arxiv.org/abs/2411.11843)|null|典型的Mamba选择性状态空间模型解决了Transformer的一些局限性，如序列长度的二次计算复杂度以及由于键值缓存导致的推理时显著的内存需求。然而，随着Mamba模型规模的不断增大，训练和部署仍然面临挑战，并且由于大量能源消耗而引发环境问题。在本工作中，我们引入了Bi-Mamba，这是一种可扩展且强大的1比特Mamba架构，旨在为大规模语言模型提供更高效的解决方案，其大小涵盖7.8亿、13亿和27亿参数。Bi-Mamba模型从零开始训练，使用与常规大规模语言模型预训练相同的数据量，并采用自回归蒸馏损失函数。大量的实验结果表明，在语言建模方面，Bi-Mamba达到了与其全精度对应模型（例如FP16或BF16）相当的性能，且比后训练二值化（PTB）Mamba基线模型具有更高的准确性，同时与原始Mamba模型相比大幅减少了内存占用和能源消耗。我们的研究开创了一种新的低比特表示下的线性计算复杂度大规模语言模型框架，并促进了未来设计专门针对高效1比特Mamba基础的大规模语言模型硬件的发展。|\n", "2411.11576": "|**2024-11-18**|**Hybrid Data-Driven SSM for Interpretable and Label-Free mmWave Channel Prediction**|Yiyong Sun et.al.|[2411.11576](http://arxiv.org/abs/2411.11576)|null|准确预测毫米波时变信道对于缓解由于高用户移动性在复杂场景中出现的信道老化问题至关重要。现有的信道预测方法存在局限性：基于经典模型的方法往往因专家知识有限而难以跟踪高度非线性的信道动态，而新兴的数据驱动方法通常需要大量标记数据进行有效训练，并且常常缺乏可解释性。为了解决这些问题，本文提出了一种新的混合方法，该方法将数据驱动的神经网络集成到基于状态空间模型（SSM）的传统模型工作流程中，从数据中隐式地跟踪复杂的信道动态，而不需要精确的专家知识。此外，还开发了一种新颖的无监督学习策略，仅使用未标记的数据来训练嵌入的神经网络。通过理论分析和消融研究来解释这种混合集成带来的增强优势。基于3GPP毫米波信道模型的数值仿真验证了所提方法相比现有纯模型或纯数据驱动方法具有更优的预测精度。此外，广泛的实验验证了其对包括严重信道变化和高噪声水平在内的各种挑战因素的鲁棒性。|\n", "2411.10741": "|**2024-11-16**|**MetaLA: Unified Optimal Linear Approximation to Softmax Attention Map**|Yuhong Chou et.al.|[2411.10741](http://arxiv.org/abs/2411.10741)|null|各种线性复杂度模型，如线性Transformer（LinFormer）、状态空间模型（SSM）和线性RNN（LinRNN），已被提出以替代Transformer结构中的传统softmax注意力机制。然而，这些线性模型的最佳设计仍然是一个未解的问题。在这项工作中，我们试图从理论角度找到最佳的线性近似方法来逼近softmax注意力。我们首先将现有的线性复杂度模型统一为线性注意力形式，然后确定了最优线性注意力设计的三个条件：1）动态记忆能力；2）静态近似能力；3）最少参数近似。我们发现当前没有任何一种线性模型能够同时满足这三个条件，导致性能不佳。为此，我们提出了元线性注意力（MetaLA）作为解决方案，它能够满足上述所有条件。我们在多查询关联回忆（MQAR）任务、语言建模、图像分类以及长程竞技场（LRA）基准测试中的实验表明，MetaLA比现有的线性模型更有效。|\n"}, "Communication Intelligence": {"2410.03688": "|**2024-09-21**|**LLM Agents as 6G Orchestrator: A Paradigm for Task-Oriented Physical-Layer Automation**|Zhuoran Xiao et.al.|[2410.03688](http://arxiv.org/abs/2410.03688)|null|生成式预训练模型的快速发展正在推动技术进步从基础应用如聊天机器人向更复杂的基于代理的系统转变。将6G系统与大型语言模型（LLM）代理和数字孪生（DT）相结合，具有巨大的潜力和必要性，可以管理具有新出现特性（如原生AI服务和感知）的高度复杂通信系统。通过6G导向的代理，基站可以理解各种动态上层任务的传输需求，并自动编排最优系统工作流程。通过不断从6G DT获取反馈进行强化，代理最终能够相应地提高实际系统的性能。不同于为通用应用设计的现有LLM代理，6G导向的代理旨在利用大量的额外专业知识进行高度严谨和精确的规划，这不可避免地要求从模型训练到实施的特定系统设计。本文提出了一种构建面向任务的6G LLM代理的新综合方法。我们首先提出一个两阶段持续预训练和微调方案，以建立领域基础模型和多样化的专业专家模型，以满足各种应用场景的需求。此外，我们还提出了一种基于语义检索的新推理框架，以利用现有的通信相关功能。物理层任务分解等示例任务的实验结果表明了所提范式的可行性和有效性。|\n"}, "RAG": {"2411.03957": "|**2024-11-06**|**Fine-Grained Guidance for Retrievers: Leveraging LLMs' Feedback in Retrieval-Augmented Generation**|Yuhang Liu et.al.|[2411.03957](http://arxiv.org/abs/2411.03957)|null|\n", "2411.03920": "|**2024-11-06**|**RAGulator: Lightweight Out-of-Context Detectors for Grounded Text Generation**|Ian Poey et.al.|[2411.03920](http://arxiv.org/abs/2411.03920)|null|\n", "2411.03572": "|**2024-11-06**|**Advanced RAG Models with Graph Structures: Optimizing Complex Knowledge Reasoning and Text Generation**|Yuxin Dong et.al.|[2411.03572](http://arxiv.org/abs/2411.03572)|null|\n", "2411.03538": "|**2024-11-05**|**Long Context RAG Performance of Large Language Models**|Quinn Leng et.al.|[2411.03538](http://arxiv.org/abs/2411.03538)|null|\n", "2411.02959": "|**2024-11-05**|**HtmlRAG: HTML is Better Than Plain Text for Modeling Retrieved Knowledge in RAG Systems**|Jiejun Tan et.al.|[2411.02959](http://arxiv.org/abs/2411.02959)|**[link](https://github.com/plageon/HtmlRAG)**|\n", "2411.02937": "|**2024-11-06**|**Benchmarking Multimodal Retrieval Augmented Generation with Dynamic VQA Dataset and Self-adaptive Planning Agent**|Yangning Li et.al.|[2411.02937](http://arxiv.org/abs/2411.02937)|**[link](https://github.com/alibaba-nlp/omnisearch)**|\n", "2411.02850": "|**2024-11-05**|**WASHtsApp -- A RAG-powered WhatsApp Chatbot for supporting rural African clean water access, sanitation and hygiene**|Simon Kloker et.al.|[2411.02850](http://arxiv.org/abs/2411.02850)|null|\n", "2411.02832": "|**2024-11-06**|**PersianRAG: A Retrieval-Augmented Generation System for Persian Language**|Hossein Hosseini et.al.|[2411.02832](http://arxiv.org/abs/2411.02832)|null|\n", "2411.02657": "|**2024-11-04**|**Zebra-Llama: A Context-Aware Large Language Model for Democratizing Rare Disease Knowledge**|Karthik Soman et.al.|[2411.02657](http://arxiv.org/abs/2411.02657)|**[link](https://github.com/karthiksoman/zebra-Llama)**|\n", "2411.02617": "|**2024-11-04**|**TeleOracle: Fine-Tuned Retrieval-Augmented Generation with Long-Context Support for Network**|Nouf Alabbasi et.al.|[2411.02617](http://arxiv.org/abs/2411.02617)|**[link](https://github.com/Nouf-Alabbasi/oKUmura_AI_Telecom_challenge)**|\n", "2411.04952": "|**2024-11-07**|**M3DocRAG: Multi-modal Retrieval is What You Need for Multi-page Multi-document Understanding**|Jaemin Cho et.al.|[2411.04952](http://arxiv.org/abs/2411.04952)|null|\n", "2411.04476": "|**2024-11-07**|**LLM-R: A Framework for Domain-Adaptive Maintenance Scheme Generation Combining Hierarchical Agents and RAG**|Laifa Tao et.al.|[2411.04476](http://arxiv.org/abs/2411.04476)|null|\n", "2411.04473": "|**2024-11-07**|**ML-Promise: A Multilingual Dataset for Corporate Promise Verification**|Yohei Seki et.al.|[2411.04473](http://arxiv.org/abs/2411.04473)|null|\n", "2411.04459": "|**2024-11-07**|**GPT-Guided Monte Carlo Tree Search for Symbolic Regression in Financial Fraud Detection**|Prashank Kadam et.al.|[2411.04459](http://arxiv.org/abs/2411.04459)|null|\n", "2411.04341": "|**2024-11-07**|**Enhancing classroom teaching with LLMs and RAG**|Elizabeth A Mullins et.al.|[2411.04341](http://arxiv.org/abs/2411.04341)|null|\n", "2411.04284": "|**2024-11-06**|**Enhancing Security Control Production With Generative AI**|Chen Ling et.al.|[2411.04284](http://arxiv.org/abs/2411.04284)|null|\n", "2411.05764": "|**2024-11-08**|**FinDVer: Explainable Claim Verification over Long and Hybrid-Content Financial Documents**|Yilun Zhao et.al.|[2411.05764](http://arxiv.org/abs/2411.05764)|null|\n", "2411.05442": "|**2024-11-08**|**IntellBot: Retrieval Augmented LLM Chatbot for Cyber Threat Knowledge Delivery**|Dincy R. Arikkat et.al.|[2411.05442](http://arxiv.org/abs/2411.05442)|null|\n", "2411.05349": "|**2024-11-08**|**Enhancing Cluster Resilience: LLM-agent Based Autonomous Intelligent Cluster Diagnosis System and Evaluation Framework**|Honghao Shi et.al.|[2411.05349](http://arxiv.org/abs/2411.05349)|null|\n", "2411.05285": "|**2024-11-08**|**A Taxonomy of AgentOps for Enabling Observability of Foundation Model based Agents**|Liming Dong et.al.|[2411.05285](http://arxiv.org/abs/2411.05285)|null|\n", "2411.05185": "|**2024-11-07**|**PentestAgent: Incorporating LLM Agents to Automated Penetration Testing**|Xiangmin Shen et.al.|[2411.05185](http://arxiv.org/abs/2411.05185)|null|\n", "2411.05141": "|**2024-11-07**|**Audiobox TTA-RAG: Improving Zero-Shot and Few-Shot Text-To-Audio with Retrieval-Augmented Generation**|Mu Yang et.al.|[2411.05141](http://arxiv.org/abs/2411.05141)|null|\n", "2411.07238": "|**2024-11-11**|**OpenThaiGPT 1.5: A Thai-Centric Open Source Large Language Model**|Sumeth Yuenyong et.al.|[2411.07238](http://arxiv.org/abs/2411.07238)|null|\n", "2411.07156": "|**2024-11-11**|**A Primer on Word Embeddings: AI Techniques for Text Analysis in Social Work**|Brian E. Perron et.al.|[2411.07156](http://arxiv.org/abs/2411.07156)|null|\n", "2411.07091": "|**2024-11-11**|**Impact of LLM-based Review Comment Generation in Practice: A Mixed Open-/Closed-source User Study**|Doriane Olewicki et.al.|[2411.07091](http://arxiv.org/abs/2411.07091)|null|\n", "2411.07021": "|**2024-11-11**|**Invar-RAG: Invariant LLM-aligned Retrieval for Better Generation**|Ziwei Liu et.al.|[2411.07021](http://arxiv.org/abs/2411.07021)|null|\n", "2411.06805": "|**2024-11-11**|**AssistRAG: Boosting the Potential of Large Language Models with an Intelligent Information Assistant**|Yujia Zhou et.al.|[2411.06805](http://arxiv.org/abs/2411.06805)|**[link](https://github.com/smallporridge/assistrag)**|\n", "2411.06558": "|**2024-11-10**|**Region-Aware Text-to-Image Generation via Hard Binding and Soft Refinement**|Zhennan Chen et.al.|[2411.06558](http://arxiv.org/abs/2411.06558)|**[link](https://github.com/nju-pcalab/rag-diffusion)**|\n", "2411.06493": "|**2024-11-10**|**LProtector: An LLM-driven Vulnerability Detection System**|Ze Sheng et.al.|[2411.06493](http://arxiv.org/abs/2411.06493)|null|\n", "2411.06237": "|**2024-11-09**|**Leveraging Retrieval-Augmented Generation for University Knowledge Retrieval**|Arshia Hemmat et.al.|[2411.06237](http://arxiv.org/abs/2411.06237)|null|\n", "2411.06207": "|**2024-11-09**|**Exploring Knowledge Boundaries in Large Language Models for Retrieval Judgment**|Zhen Zhang et.al.|[2411.06207](http://arxiv.org/abs/2411.06207)|null|\n", "2411.06175": "|**2024-11-09**|**Clustering Algorithms and RAG Enhancing Semi-Supervised Text Classification with Large LLMs**|Shan Zhong et.al.|[2411.06175](http://arxiv.org/abs/2411.06175)|null|\n", "2411.07870": "|**2024-11-12**|**Trustful LLMs: Customizing and Grounding Text Generation with Knowledge Bases and Dual Decoders**|Xiaofeng Zhu et.al.|[2411.07870](http://arxiv.org/abs/2411.07870)|null|\n", "2411.07820": "|**2024-11-12**|**Query Optimization for Parametric Knowledge Refinement in Retrieval-Augmented Large Language Models**|Youan Cong et.al.|[2411.07820](http://arxiv.org/abs/2411.07820)|null|\n", "2411.07773": "|**2024-11-12**|**Likelihood as a Performance Gauge for Retrieval-Augmented Generation**|Tianyu Liu et.al.|[2411.07773](http://arxiv.org/abs/2411.07773)|**[link](https://github.com/lyutyuh/poptimizer)**|\n", "2411.07739": "|**2024-11-12**|**Unlocking Legal Knowledge with Multi-Layered Embedding-Based Retrieval**|João Alberto de Oliveira Lima et.al.|[2411.07739](http://arxiv.org/abs/2411.07739)|null|\n", "2411.07688": "|**2024-11-12**|**Enhancing Ultra High Resolution Remote Sensing Imagery Analysis with ImageRAG**|Zilun Zhang et.al.|[2411.07688](http://arxiv.org/abs/2411.07688)|null|\n", "2411.07404": "|**2024-11-11**|**Controllable Context Sensitivity and the Knob Behind It**|Julian Minder et.al.|[2411.07404](http://arxiv.org/abs/2411.07404)|**[link](https://github.com/kdu4108/context-vs-prior-finetuning)**|\n", "2411.07396": "|**2024-11-11**|**Toward Optimal Search and Retrieval for RAG**|Alexandria Leto et.al.|[2411.07396](http://arxiv.org/abs/2411.07396)|null|\n", "2411.07360": "|**2024-11-11**|**ChatGPT Inaccuracy Mitigation during Technical Report Understanding: Are We There Yet?**|Salma Begum Tamanna et.al.|[2411.07360](http://arxiv.org/abs/2411.07360)|null|\n", "2411.08574": "|**2024-11-13**|**Practitioners' Discussions on Building LLM-based Applications for Production**|Alina Mailach et.al.|[2411.08574](http://arxiv.org/abs/2411.08574)|null|\n", "2411.08469": "|**2024-11-13**|**Building Trustworthy AI: Transparent AI Systems via Large Language Models, Ontologies, and Logical Reasoning (TranspNet)**|Fadi Al Machot et.al.|[2411.08469](http://arxiv.org/abs/2411.08469)|null|\n", "2411.08449": "|**2024-11-13**|**Towards Evaluating Large Language Models for Graph Query Generation**|Siraj Munir et.al.|[2411.08449](http://arxiv.org/abs/2411.08449)|null|\n", "2411.08438": "|**2024-11-13**|**Towards Optimizing a Retrieval Augmented Generation using Large Language Model on Academic Data**|Anum Afzal et.al.|[2411.08438](http://arxiv.org/abs/2411.08438)|null|\n", "2411.08348": "|**2024-11-13**|**Refining Translations with LLMs: A Constraint-Aware Iterative Prompting Approach**|Shangfeng Chen et.al.|[2411.08348](http://arxiv.org/abs/2411.08348)|null|\n", "2411.08324": "|**2024-11-13**|**Are LLMs Prescient? A Continuous Evaluation using Daily News as the Oracle**|Hui Dai et.al.|[2411.08324](http://arxiv.org/abs/2411.08324)|null|\n", "2411.08275": "|**2024-11-13**|**A Large-Scale Study of Relevance Assessments with Large Language Models: An Initial Look**|Shivani Upadhyay et.al.|[2411.08275](http://arxiv.org/abs/2411.08275)|null|\n", "2411.08249": "|**2024-11-12**|**Retrieval Augmented Time Series Forecasting**|Kutay Tire et.al.|[2411.08249](http://arxiv.org/abs/2411.08249)|**[link](https://github.com/kutaytire/retrieval-augmented-time-series-forecasting)**|\n", "2411.08148": "|**2024-11-12**|**Adaptive Meta-Learning for Robust Deepfake Detection: A Multi-Agent Framework to Data Drift and Model Generalization**|Dinesh Srivasthav P et.al.|[2411.08148](http://arxiv.org/abs/2411.08148)|**[link](https://github.com/dineshsrivasthav/adaptive_meta_learning_with_multi_agent_framework)**|\n", "2411.09607": "|**2024-11-14**|**Initial Nugget Evaluation Results for the TREC 2024 RAG Track with the AutoNuggetizer Framework**|Ronak Pradeep et.al.|[2411.09607](http://arxiv.org/abs/2411.09607)|null|\n", "2411.09590": "|**2024-11-14**|**Adopting RAG for LLM-Aided Future Vehicle Design**|Vahid Zolfaghari et.al.|[2411.09590](http://arxiv.org/abs/2411.09590)|null|\n", "2411.09269": "|**2024-11-14**|**Harnessing multiple LLMs for Information Retrieval: A case study on Deep Learning methodologies in Biodiversity publications**|Vamsi Krishna Kommineni et.al.|[2411.09269](http://arxiv.org/abs/2411.09269)|**[link](https://github.com/fusion-jena/information-retrieval-using-multiple-llm-and-rag)**|\n", "2411.09213": "|**2024-11-14**|**Comprehensive and Practical Evaluation of Retrieval-Augmented Generation Systems for Medical Question Answering**|Nghia Trung Ngo et.al.|[2411.09213](http://arxiv.org/abs/2411.09213)|null|\n", "2411.11323": "|**2024-11-18**|**SayComply: Grounding Field Robotic Tasks in Operational Compliance through Retrieval-Based Language Models**|Muhammad Fadhil Ginting et.al.|[2411.11323](http://arxiv.org/abs/2411.11323)|null|本文解决了机器人在现实环境中必须遵守操作手册的任务规划问题。在需要遵循特定领域知识的领域中，符合这些约束的任务规划对于实现自主机器人操作至关重要。当前生成机器人目标和计划的方法依赖于大型语言模型中编码的常识知识。然而，这些模型缺乏将机器人计划与特定领域知识相结合的能力，并且不易在具有不同合规需求的多个站点或客户之间转移。在这项工作中，我们提出了SayComply，它通过基于检索的语言模型使机器人任务规划与操作合规性相结合。我们设计了一个包含操作、环境和机器人实体手册及程序的分层数据库，以便在语言模型有限的上下文长度下高效检索相关上下文。然后，我们使用基于树的检索增强生成（RAG）技术设计了一个任务规划器，以生成既遵循用户指令又同时遵守数据库中领域知识的机器人任务。我们通过模拟和硬件实验展示了我们的方法在需要跨各种类型上下文进行精确检索的真实场景中的优势，表现优于标准RAG方法。我们的方法填补了部署始终遵循操作协议的机器人的空白，为确保在多样化和复杂的真实环境中合规提供了一种可扩展且可在边缘部署的解决方案。项目网站：saycomply.github.io。|\n", "2411.11090": "|**2024-11-17**|**ForPKG-1.0: A Framework for Constructing Forestry Policy Knowledge Graph and Application Analysis**|Jingyun Sun et.al.|[2411.11090](http://arxiv.org/abs/2411.11090)|null|政策知识图谱可以为项目合规性、政策分析和智能问答等任务提供决策支持，也可以作为外部知识库辅助相关大型语言模型的推理过程。尽管已经有很多关于知识图谱的相关研究，但目前在政策知识图谱构建方法方面还缺乏研究。本文以林业领域为例，设计了一个完整的政策知识图谱构建框架，包括：首先提出一种细粒度的林业政策领域本体；然后提出一种无监督的政策信息抽取方法；最后构建了一个完整的林业政策知识图谱。实验结果表明，本文提出的本体具有良好的表达能力和可扩展性，且本文提出的政策信息抽取方法比其他无监督方法取得了更好的效果。此外，通过分析该知识图谱在大型语言模型检索增强生成任务中的应用，证实了知识图谱在大型语言模型时代具有实际应用价值。该知识图谱资源将在开源平台上发布，可以作为林业政策相关智能系统的基础知识库，并可用于学术研究。此外，本研究还可以为其他领域的政策知识图谱构建提供参考和指导。|\n", "2411.11033": "|**2024-11-17**|**REACCEPT: Automated Co-evolution of Production and Test Code Based on Dynamic Validation and Large Language Models**|Jianlei Chi et.al.|[2411.11033](http://arxiv.org/abs/2411.11033)|null|在软件开发生命周期中，同步生产和测试代码（即PT协同进化）对于软件质量至关重要。现有的自动PT协同进化方法要么利用预定义的启发式规则，要么依赖于简单的机器学习技术应用。由于底层技术的限制，现有方法要么只能部分自动化PT协同进化（例如，仅能自动化识别过时的测试代码），要么准确率较低。在这篇论文中，我们提出了一种新的方法REACCEPT，该方法利用大规模语言模型和动态验证来完全自动化PT协同进化（即能够同时识别和更新过时的测试用例）。REACCEPT依靠基于经验的提示模板生成、动态验证和检索增强生成技术来实现自动化PT协同进化。为了评估REACCEPT的有效性，我们在包含537个Java项目的数据集上进行了广泛的实验，并将REACCEPT的性能与几种最先进的方法进行了比较。结果显示，REACCEPT在正确识别出的过时测试代码上的更新准确率达到60.16%，比最先进的技术CEPROT高出90%。这证实了REACCEPT可以有效帮助开发人员维护测试代码，提高整体软件质量和减少维护工作量。|\n", "2411.10918": "|**2024-11-17**|**LLM-assisted Physical Invariant Extraction for Cyber-Physical Systems Anomaly Detection**|Danial Abshari et.al.|[2411.10918](http://arxiv.org/abs/2411.10918)|null|现代工业基础设施严重依赖于信息物理系统（CPS），但这些系统容易受到网络攻击，可能导致灾难性后果。为了降低这些风险，基于物理不变量的异常检测方法已经被开发出来。然而，这些方法通常需要领域特定的专业知识来手动定义不变量，使其成本高昂且难以扩展。为了解决这一限制，我们提出了一种从CPS测试平台中提取物理不变量以进行异常检测的新方法。我们的见解是，CPS设计文档通常包含丰富的物理过程语义描述，可以描绘系统组件之间的相互关联动态。利用最近生成式AI模型内置的物理和工程知识，我们旨在自动化这一传统上手动的过程，提高可扩展性并降低成本。这项工作重点在于设计和优化一个针对CPS文档定制的检索增强生成（RAG）工作流程，能够准确地从复杂、多模态的内容中提取语义信息并推断物理不变量。然后，我们并没有直接将推断出的不变量用于异常检测，而是引入了一种创新的基于统计的学习方法，将这些不变量整合到训练数据集中。这种方法解决了诸如幻觉和概念漂移等问题，增强了模型的可靠性。我们在一个包含86个数据点和58个攻击案例的真实世界公开CPS安全数据集上评估了我们的方法。结果显示，我们的方法达到了0.923的高精度，能够准确检测异常同时最小化误报。|\n", "2411.10878": "|**2024-11-16**|**Empowering Meta-Analysis: Leveraging Large Language Models for Scientific Synthesis**|Jawad Ibn Ahad et.al.|[2411.10878](http://arxiv.org/abs/2411.10878)|null|\n", "2411.12644": "|**2024-11-19**|**CodeXEmbed: A Generalist Embedding Model Family for Multiligual and Multi-task Code Retrieval**|Ye Liu et.al.|[2411.12644](http://arxiv.org/abs/2411.12644)|null|尽管文本检索在许多自然语言处理任务中取得了成功，但代码检索仍然是一个很大程度上未被充分探索的领域。大多数文本检索系统都是为自然语言查询量身定制的，常常忽略了检索代码时面临的特定挑战。这种差距使得现有模型无法有效捕捉不同领域内编程语言和任务的多样性，突显了对代码检索进行更专注研究的需求。为此，我们引入了CodeXEmbed，这是一个包含从4亿到70亿参数的大规模代码嵌入模型系列。我们新颖的训练流程统一了多种编程语言，并将各种与代码相关的任务转换为一个通用的检索框架，增强了模型的泛化能力和检索性能。我们的70亿参数模型在CoIR基准测试中创下了新的最先进水平，比之前的领先模型Voyage-Code高出20%以上。除了在代码检索方面表现出色外，我们的模型在广泛采用的BeIR文本检索基准测试中也展示了竞争性的性能，提供了跨领域的多功能性。实验结果表明，提高检索性能显著提升了针对代码相关任务的端到端检索增强生成（RAG）性能。|\n", "2411.12449": "|**2024-11-19**|**\\textsc{Neon}: News Entity-Interaction Extraction for Enhanced Question Answering**|Sneha Singhania et.al.|[2411.12449](http://arxiv.org/abs/2411.12449)|null|在近乎实时地捕获最新信息并用其增强现有的大型语言模型（LLMs）对于生成最新、有根据且可靠的输出至关重要。当LLMs用于快速发展的领域中的信息任务时，这一问题变得尤为突出，例如与最近或正在发生的涉及实体的事件相关的网络搜索，生成时间相关的响应需要访问最新的新闻来源。然而，LLMs参数化记忆中建模的信息往往是过时的，而典型的检索系统可能无法捕捉到最新的相关信息，并且难以处理不断变化的新闻中的冲突报告。为了解决这一挑战，我们提出了NEON框架，旨在从新闻文章中提取新出现的实体交互——如事件或活动。NEON构建了一个以实体为中心的时间戳知识图谱，该图谱捕捉了这些交互，从而增强了与新闻事件相关的问答能力。我们的框架通过将开放式信息抽取（openIE）风格的元组集成到LLMs中，实现了上下文检索增强生成。这种集成在处理时间敏感的实体中心搜索查询时显著提高了问答性能。通过NEON，LLMs可以提供更准确、可靠和及时的响应。|\n", "2411.12287": "|**2024-11-19**|**CUE-M: Contextual Understanding and Enhanced Search with Multimodal Large Language Model**|Dongyoung Go et.al.|[2411.12287](http://arxiv.org/abs/2411.12287)|null|检索增强生成（RAG）与多模态大语言模型（MLLMs）的结合扩展了多模态查询解析的范围。然而，当前系统在意图理解、信息检索和安全过滤方面存在困难，限制了其有效性。本文介绍了一种新的多模态搜索管道——具有上下文理解和增强搜索功能的MLLM（CUE-M），该框架通过图像上下文丰富、意图细化、上下文查询生成、外部API集成和基于相关性的过滤等多个阶段来解决这些挑战。CUE-M结合了一个强大的安全框架，包括基于图像、文本和多模态的分类器，能够动态适应实例和类别特定的风险。在多模态问答数据集和公共安全基准上的评估表明，CUE-M在准确性、知识整合和安全性方面优于基线方法，提升了多模态检索系统的能力。|\n", "2411.12280": "|**2024-11-19**|**Large Language Models for Material Property Predictions: elastic constant tensor prediction and materials design**|Siyu Liu et.al.|[2411.12280](http://arxiv.org/abs/2411.12280)|null|有效且准确地预测材料性质对于推动材料设计和应用至关重要。大型语言模型（LLMs）的迅速发展为材料性质预测提供了新的机遇，可以补充实验测量和多尺度计算方法。我们以弹性常数张量预测作为案例研究，开发了领域特定的LLM，用于预测弹性常数并发现新材料。所提出的ElaTBot LLM能够同时预测弹性常数张量、有限温度下的体积模量，并生成具有目标特性的新材料。此外，通过与通用LLM（GPT-4o）和检索增强生成（RAG）集成，ElaTBot的能力得到了进一步增强。一种专门的变体ElaTBot-DFT，专为0 K弹性常数张量预测设计，在相同数据集上训练时，其预测误差比领域特定的材料科学LLM（Darwin）减少了33.1%。这种基于自然语言的方法降低了计算材料科学的门槛，并突显了LLM在材料性质预测和逆向设计中的更广泛潜力。|\n", "2411.12078": "|**2024-11-18**|**Molecule Generation with Fragment Retrieval Augmentation**|Seul Lee et.al.|[2411.12078](http://arxiv.org/abs/2411.12078)|null|基于片段的药物发现，通过将分子片段组装成具有理想生物化学性质的新分子，已经取得了巨大成功。然而，许多基于片段的分子生成方法仅限于数据库中现有片段的重新组装或轻微修改，探索范围有限。为了解决这个问题，我们提出了一种新的带有检索增强的基于片段的分子生成框架，称为片段检索-增强生成（f-RAG）。f-RAG基于一个预训练的分子生成模型，该模型从输入片段中提出额外的片段来完成并生成新分子。给定一个片段词汇表，f-RAG检索两种类型的片段：(1)硬片段，作为构建块明确包含在新生成的分子中；(2)软片段，作为参考通过可训练的片段注入模块指导新片段的生成。为了超越现有的片段，f-RAG通过迭代精炼过程用生成的片段更新片段词汇表，并通过后验遗传片段修改进一步增强。f-RAG通过维护一个片段池并通过强大的生成先验扩展高质量的新片段，实现了改进的探索-利用平衡。|\n", "2411.11913": "|**2024-11-17**|**On-Board Vision-Language Models for Personalized Autonomous Vehicle Motion Control: System Design and Real-World Validation**|Can Cui et.al.|[2411.11913](http://arxiv.org/abs/2411.11913)|null|个性化驾驶指的是自动驾驶车辆能够调整其驾驶行为或控制策略以匹配每个用户的偏好和驾驶风格，同时保持安全和舒适的标准。然而，现有的工作要么无法精确捕捉每个个体的偏好，要么在用户基数扩大时变得计算效率低下。视觉-语言模型（VLMs）通过其自然语言理解和场景推理能力为这一领域提供了有前景的解决方案。在这项工作中，我们提出了一种轻量级但高效的车载VLM框架，该框架能够在保持强大推理能力的同时提供低延迟的个性化驾驶性能。我们的解决方案结合了一个基于检索增强生成（RAG）的记忆模块，该模块能够通过人类反馈持续学习个体的驾驶偏好。通过全面的实际车辆部署和实验，我们的系统展示了在各种场景下提供安全、舒适和个性化驾驶体验的能力，并显著降低了接管率，最高可达76.9%。据我们所知，这项工作代表了现实世界中首个端到端的基于VLM的运动控制系统。|\n"}, "text2sql": {"2411.02948": "|**2024-11-05**|**Grounding Natural Language to SQL Translation with Data-Based Self-Explanations**|Yuankai Fan et.al.|[2411.02948](http://arxiv.org/abs/2411.02948)|**[link](https://github.com/Kaimary/CycleSQL)**|**自然语言接口使非技术用户能够使用自然语言（NL）与数据库进行交互。先进的方法通常利用神经序列到序列模型或更近期的复杂大规模语言模型，以端到端的方式实现从自然语言到SQL（NL2SQL）的翻译。然而，像人类一样，这些端到端翻译模型并不总是在第一次尝试时就能生成最佳的SQL输出。在本文中，我们提出了CycleSQL，这是一种迭代框架，旨在让端到端翻译模型通过自我评估自主生成最佳输出。CycleSQL的主要思想是引入基于数据的查询结果自然语言解释作为自我提供的反馈，并利用该反馈来迭代验证翻译的正确性，从而提高整体翻译准确性。为了研究CycleSQL，我们在五个广泛使用的基准测试上对七个现有的翻译模型进行了广泛的实验，包括定量和定性的评估。结果显示：1) 在CycleSQL中引入的反馈循环可以一致地提高现有模型的性能，特别是将CycleSQL应用于REDSQL时，在Spider基准的验证集上获得了82.0% (+2.6%) 的翻译准确率，在测试集上获得了81.6% (+3.2%) 的翻译准确率；2) 生成的自然语言解释还可以为用户提供有价值的见解，帮助理解翻译结果，从而增强NL2SQL翻译的可解释性。**|\n", "2410.22925": "|**2024-10-30**|**BIS: NL2SQL Service Evaluation Benchmark for Business Intelligence Scenarios**|Bora Caglayan et.al.|[2410.22925](http://arxiv.org/abs/2410.22925)|**[link](https://github.com/boracaglayan/bis-nl2sql)**|**近年来，自然语言到结构化查询语言（NL2SQL）的转换在商业智能（BI）应用中得到了广泛应用。然而，现有的NL2SQL基准并不适用于生产环境中的BI场景，因为它们并不是为常见的商业智能问题而设计的。为了解决这一问题，我们开发了一个新的基准，专注于工业BI场景中的典型自然语言问题。我们讨论了构建以BI为重点的基准所面临的挑战以及现有基准的不足之处。此外，我们介绍了我们的基准中反映常见BI询问的问题类别。最后，我们提出了两种新的语义相似性评估指标，用于评估BI应用程序和服务中的NL2SQL能力。**|\n", "2410.11457": "|**2024-10-15**|**LR-SQL: A Supervised Fine-Tuning Method for Text2SQL Tasks under Low-Resource Scenarios**|Wen Wuzhenghong et.al.|[2410.11457](http://arxiv.org/abs/2410.11457)|**[link](https://github.com/hongwin/lr-sql)**|**大型语言模型通过监督微调革新了Text2SQL，但一个关键的限制被忽视了：数据库的复杂性导致上下文长度增加，从而增加了模型微调所需的GPU内存需求。为了解决这个问题，我们提出了LR-SQL。LR-SQL包含两个监督微调模型：schema_link模型和SQL_generation模型，其中schema_link模型是简化整个过程的关键。在对schema_link模型进行微调时，LR-SQL将完整的数据库分解成具有可调节数量的表的灵活组合，使模型能够从这些分散的片段中学习整个数据库中的关系。此外，为了增强模型在推理过程中感知各种离散片段之间关系的能力，LR-SQL训练了模型的Chain-of-Thought能力以完成此任务。实验结果表明，与现有的微调方法相比，LR-SQL可以减少40%的总GPU内存使用量，而仅在schema_link任务中损失2%的表预测准确性。对于整体的Text2SQL任务，执行准确率下降了0.6%。我们的项目现在可以在https://github.com/hongWin/LR-SQL上找到。**|\n", "2408.14717": "|**2024-08-27**|**Text2SQL is Not Enough: Unifying AI and Databases with TAG**|Asim Biswal et.al.|[2408.14717](http://arxiv.org/abs/2408.14717)|**[link](https://github.com/tag-research/tag-bench)**|**能够通过自然语言问题查询数据库的人工智能系统有望释放巨大的价值。这类系统能够让用户利用语言模型（LMs）强大的推理和知识能力，同时结合数据管理系统可扩展的计算能力。这些综合能力将使用户能够对自定义数据源提出任意的自然语言问题。然而，现有的方法和基准测试对此设置的探索不足。Text2SQL方法仅关注可以用关系代数表达的自然语言问题，这仅代表了真实用户希望提出的少量问题。同样地，检索增强生成（RAG）考虑的是可以通过对数据库中一个或几个数据记录进行点查找来回答的有限子集查询。我们提出了表增强生成（TAG），这是一种统一且通用的方法，用于回答基于数据库的自然语言问题。TAG模型代表了LM与数据库之间广泛互动的可能性，这是之前未被充分探索的领域，并为利用LM在数据上的世界知识和推理能力创造了令人兴奋的研究机会。我们系统地开发了基准测试来研究TAG问题，并发现标准方法正确回答的问题不超过20%，这证实了该领域需要进一步研究。我们在https://github.com/TAG-Research/TAG-Bench上发布了基准测试代码。**|\n", "2408.05109": "|**2024-11-03**|**A Survey of NL2SQL with Large Language Models: Where are we, and where are we going?**|Xinyu Liu et.al.|[2408.05109](http://arxiv.org/abs/2408.05109)|**[link](https://github.com/hkustdial/nl2sql_handbook)**|**将用户的自然语言查询（NL）转换为SQL查询（即NL2SQL）可以显著降低访问关系数据库的障碍，并支持各种商业应用。随着大型语言模型（LLMs）的出现，NL2SQL的性能得到了极大的提升。在这篇综述中，我们全面回顾了由LLMs驱动的NL2SQL技术，涵盖了从以下四个方面看其整个生命周期：(1) 模型：NL2SQL翻译技术不仅处理自然语言的模糊性和不明确性，还正确地将自然语言与数据库模式和实例映射；(2) 数据：从训练数据的收集、由于训练数据稀缺而进行的数据合成，到NL2SQL基准测试；(3) 评估：使用不同的度量标准和粒度从多个角度评估NL2SQL方法；(4) 错误分析：分析NL2SQL错误以找到根本原因，并指导NL2SQL模型的发展。此外，我们为开发NL2SQL解决方案提供了一条经验法则。最后，我们讨论了在LLMs时代NL2SQL的研究挑战和开放问题。**|\n", "2407.21040": "|**2024-07-21**|**Towards Automated Data Sciences with Natural Language and SageCopilot: Practices and Lessons Learned**|Yuan Liao et.al.|[2407.21040](http://arxiv.org/abs/2407.21040)|null|尽管自然语言转SQL（NL2SQL）领域在将自然语言指令转换为可执行的SQL脚本以进行数据查询和处理方面取得了显著进展，但在更广泛的数据科学管道中实现全自动化——包括数据查询、分析、可视化和报告——仍然是一个复杂的挑战。本研究介绍了一种先进的工业级系统SageCopilot，该系统通过集成大型语言模型（LLMs）、自主代理（AutoAgents）和语言用户界面（LUIs），实现了数据科学管道的自动化。具体而言，SageCopilot采用两阶段设计：在线组件通过上下文学习（ICL）细化用户输入为可执行脚本，并运行这些脚本来报告结果及可视化；离线组件则准备在线阶段ICL请求所需的演示示例。一系列流行策略如思维链和提示调整已被用于增强SageCopilot的性能。通过严格的测试和与基于提示解决方案的比较分析，SageCopilot已在生成或执行脚本以及提供带有可视化的结果方面被实证验证具有优越的端到端性能，这得到了真实世界数据集的支持。我们深入的消融研究表明了SageCopilot所使用各种组件和策略对数据科学端到端正确性的单独贡献。|\n", "2406.07913": "|**2024-06-12**|**DeTriever: Decoder-representation-based Retriever for Improving NL2SQL In-Context Learning**|Yuxi Feng et.al.|[2406.07913](http://arxiv.org/abs/2406.07913)|null|尽管上下文学习（ICL）已被证明是提高大型语言模型（LLMs）在多种复杂任务中性能的有效技术，特别是在将自然语言问题转换为结构化查询语言（NL2SQL）方面，如何选择最有益的示例仍然是一个开放的研究问题。虽然之前的工作通常采用现成的编码器来动态检索示例，但外部检索器与LLMs之间在表示能力上存在固有的差异。此外，优化示例选择是一个非平凡的任务，因为没有直接的方法可以在不进行成对推理的情况下评估示例的相对益处。为了解决这些不足，我们提出了DeTriever，这是一种新颖的演示检索框架，该框架学习了LLM隐藏状态的加权组合，在其中编码了丰富的语义信息。为了训练模型，我们提出了一种代理分数，该分数基于输出查询之间的相似性来估计示例的相对益处。在两个流行的NL2SQL基准上的实验表明，我们的方法在一击NL2SQL任务上显著优于最先进的基线。|\n", "2406.01265": "|**2024-07-27**|**The Dawn of Natural Language to SQL: Are We Fully Ready?**|Boyan Li et.al.|[2406.01265](http://arxiv.org/abs/2406.01265)|**[link](https://github.com/hkustdial/nl2sql360)**|**将用户的自然语言问题转换为SQL查询（即NL2SQL）显著降低了访问关系数据库的门槛。大型语言模型的出现为NL2SQL任务引入了新的范式，极大地提升了能力。然而，这引发了一个关键问题：我们是否已经完全准备好将NL2SQL模型部署到生产环境中？为了回答这个问题，我们提出了一个多角度的NL2SQL评估框架NL2SQL360，以帮助研究人员设计和测试新的NL2SQL方法。通过NL2SQL360，我们对领先的NL2SQL方法在不同应用场景下进行了详细比较，如不同的数据领域和SQL特征，提供了有价值的见解，以便根据特定需求选择最合适的NL2SQL方法。此外，我们探索了NL2SQL设计空间，利用NL2SQL360自动识别针对用户特定需求的最佳NL2SQL解决方案。具体来说，NL2SQL360确定了一种有效的NL2SQL方法SuperSQL，在Spdier数据集上使用执行准确率指标脱颖而出。值得注意的是，SuperSQL在Spider和BIRD测试集上分别达到了87%和62.66%的竞争性执行准确率。**|\n", "2405.00527": "|**2024-05-01**|**ChatBI: Towards Natural Language to Complex Business Intelligence SQL**|Jinqing Lian et.al.|[2405.00527](http://arxiv.org/abs/2405.00527)|null|自然语言转SQL（NL2SQL）技术为不熟悉数据库的非专家用户提供了一个使用SQL进行数据分析的机会。将自然语言转换为商业智能（NL2BI）是实际生产系统中NL2SQL的一个流行应用场景。与NL2SQL相比，NL2BI引入了更多的挑战。在本文中，我们提出了ChatBI，这是一种全面且高效的技术，用于解决NL2BI任务。首先，我们分析了交互模式，这是NL2SQL和NL2BI在使用上一个重要但不同的模块，并设计了一个更小、成本更低的模型来匹配这种交互模式。在BI场景中，表包含大量的列，这使得现有的依赖大型语言模型（LLMs）进行模式链接的NL2SQL方法由于令牌限制而无法继续。此外，BI场景中模糊列的比例较高也使模式链接变得困难。ChatBI结合了数据库社区中现有的视图技术，首先将模式链接问题分解为单个视图选择问题，然后使用一个更小、成本更低的机器学习模型来选择具有显著减少列数的单一视图。这个单一视图的列随后作为模式链接所需列传递给LLM。最后，ChatBI提出了一种不同于现有流程的分阶段流程，使ChatBI能够更准确地生成包含复杂语义和比较关系的SQL。我们将ChatBI部署到了百度的数据平台上，并将其集成到多条产品线中进行了大规模生产任务评估。所获得的结果突显了其在实用性、通用性和效率方面的优越性。同时，在我们的真实BI场景数据表和查询下，与当前主流的NL2SQL技术相比，它也取得了最佳结果。|\n", "2403.20014": "|**2024-03-29**|**PURPLE: Making a Large Language Model a Better SQL Writer**|Tonghui Ren et.al.|[2403.20014](http://arxiv.org/abs/2403.20014)|null|\n", "2407.15186": "|**2024-11-07**|**A Survey on Employing Large Language Models for Text-to-SQL Tasks**|Liang Shi et.al.|[2407.15186](http://arxiv.org/abs/2407.15186)|null|随着关系数据库中数据量的不断增加以及编写SQL查询所需的专业知识，用户在访问和分析数据时面临挑战。Text-to-SQL（Text2SQL）通过利用自然语言处理（NLP）技术将自然语言转换为SQL查询来解决这些问题。随着大型语言模型（LLMs）的发展，一系列基于LLM的Text2SQL方法应运而生。本综述全面回顾了基于LLM的Text2SQL任务。我们回顾了基准数据集、提示工程方法、微调方法和基础模型。我们在每个部分提供了见解，并讨论了该领域的未来方向。|\n"}, "AIOps": {}, "PPC": {"2411.04112": "|**2024-11-06**|**Fed-EC: Bandwidth-Efficient Clustering-Based Federated Learning For Autonomous Visual Robot Navigation**|Shreya Gummadi et.al.|[2411.04112](http://arxiv.org/abs/2411.04112)|null|\n", "2411.04002": "|**2024-11-06**|**Federated mixed effects logistic regression based on one-time shared summary statistics**|Marie Analiz April Limpoco et.al.|[2411.04002](http://arxiv.org/abs/2411.04002)|**[link](https://github.com/lizlimpocouhasselt/Mixed-effects-logistic-regression-from-summary-statistics)**|\n", "2411.03996": "|**2024-11-06**|**Towards Resource-Efficient Federated Learning in Industrial IoT for Multivariate Time Series Analysis**|Alexandros Gkillas et.al.|[2411.03996](http://arxiv.org/abs/2411.03996)|null|\n", "2411.03926": "|**2024-11-06**|**Act in Collusion: A Persistent Distributed Multi-Target Backdoor in Federated Learning**|Tao Liu et.al.|[2411.03926](http://arxiv.org/abs/2411.03926)|null|\n", "2411.03861": "|**2024-11-06**|**FedRISE: Rating Induced Sign Election of Gradients for Byzantine Tolerant Federated Aggregation**|Joseph Geo Benjamin et.al.|[2411.03861](http://arxiv.org/abs/2411.03861)|null|\n", "2411.03799": "|**2024-11-06**|**Overcoming label shift in targeted federated learning**|Edvin Listo Zec et.al.|[2411.03799](http://arxiv.org/abs/2411.03799)|null|\n", "2411.03746": "|**2024-11-06**|**Optimal Defenses Against Gradient Reconstruction Attacks**|Yuxiao Chen et.al.|[2411.03746](http://arxiv.org/abs/2411.03746)|**[link](https://github.com/cyx78/optimal_defenses_against_gradient_reconstruction_attacks)**|\n", "2411.03730": "|**2024-11-06**|**NeurIPS 2023 Competition: Privacy Preserving Federated Learning Document VQA**|Marlon Tobaben et.al.|[2411.03730](http://arxiv.org/abs/2411.03730)|null|\n", "2411.03636": "|**2024-11-06**|**Domain Generalization for Cross-Receiver Radio Frequency Fingerprint Identification**|Ying Zhang et.al.|[2411.03636](http://arxiv.org/abs/2411.03636)|null|\n", "2411.03569": "|**2024-11-06**|**Towards Personalized Federated Learning via Comprehensive Knowledge Distillation**|Pengju Wang et.al.|[2411.03569](http://arxiv.org/abs/2411.03569)|null|\n", "2411.04936": "|**2024-11-07**|**Fed-LDR: Federated Local Data-infused Graph Creation with Node-centric Model Refinement**|Jiechao Gao et.al.|[2411.04936](http://arxiv.org/abs/2411.04936)|null|\n", "2411.04692": "|**2024-11-07**|**Personalized Federated Learning for Cross-view Geo-localization**|Christos Anagnostopoulos et.al.|[2411.04692](http://arxiv.org/abs/2411.04692)|null|\n", "2411.04509": "|**2024-11-07**|**FedDP: Privacy-preserving method based on federated learning for histopathology image segmentation**|Liangrui Pan et.al.|[2411.04509](http://arxiv.org/abs/2411.04509)|null|\n", "2411.04159": "|**2024-11-06**|**Cooperation and Personalization on a Seesaw: Choice-based FL for Safe Cooperation in Wireless Networks**|Han Zhang et.al.|[2411.04159](http://arxiv.org/abs/2411.04159)|null|\n", "2411.05697": "|**2024-11-08**|**IPMN Risk Assessment under Federated Learning Paradigm**|Hongyi Pan et.al.|[2411.05697](http://arxiv.org/abs/2411.05697)|null|\n", "2411.05591": "|**2024-11-08**|**Network EM Algorithm for Gaussian Mixture Model in Decentralized Federated Learning**|Shuyuan Wu et.al.|[2411.05591](http://arxiv.org/abs/2411.05591)|null|\n", "2411.05260": "|**2024-11-08**|**QuanCrypt-FL: Quantized Homomorphic Encryption with Pruning for Secure Federated Learning**|Md Jueal Mia et.al.|[2411.05260](http://arxiv.org/abs/2411.05260)|null|\n", "2411.05173": "|**2024-11-07**|**DWFL: Enhancing Federated Learning through Dynamic Weighted Averaging**|Prakash Chourasia et.al.|[2411.05173](http://arxiv.org/abs/2411.05173)|null|\n", "2411.05167": "|**2024-11-07**|**EPIC: Enhancing Privacy through Iterative Collaboration**|Prakash Chourasia et.al.|[2411.05167](http://arxiv.org/abs/2411.05167)|null|\n", "2411.07224": "|**2024-11-11**|**TempCharBERT: Keystroke Dynamics for Continuous Access Control Based on Pre-trained Language Models**|Matheus Simão et.al.|[2411.07224](http://arxiv.org/abs/2411.07224)|null|\n", "2411.07182": "|**2024-11-11**|**Revisiting Ensembling in One-Shot Federated Learning**|Youssef Allouah et.al.|[2411.07182](http://arxiv.org/abs/2411.07182)|**[link](https://github.com/sacs-epfl/fens)**|\n", "2411.06881": "|**2024-11-11**|**WassFFed: Wasserstein Fair Federated Learning**|Zhongxuan Han et.al.|[2411.06881](http://arxiv.org/abs/2411.06881)|null|\n", "2411.06773": "|**2024-11-11**|**Model Partition and Resource Allocation for Split Learning in Vehicular Edge Networks**|Lu Yu et.al.|[2411.06773](http://arxiv.org/abs/2411.06773)|null|\n", "2411.06770": "|**2024-11-11**|**Sketched Adaptive Federated Deep Learning: A Sharp Convergence Analysis**|Zhijie Chen et.al.|[2411.06770](http://arxiv.org/abs/2411.06770)|null|\n", "2411.06721": "|**2024-11-11**|**Movable Antenna-Aided Federated Learning with Over-the-Air Aggregation: Joint Optimization of Positioning, Beamforming, and User Selection**|Yang Zhao et.al.|[2411.06721](http://arxiv.org/abs/2411.06721)|null|\n", "2411.06618": "|**2024-11-10**|**Using Diffusion Models as Generative Replay in Continual Federated Learning -- What will Happen?**|Yongsheng Mei et.al.|[2411.06618](http://arxiv.org/abs/2411.06618)|null|\n", "2411.06458": "|**2024-11-10**|**Protection against Source Inference Attacks in Federated Learning using Unary Encoding and Shuffling**|Andreas Athanasiou et.al.|[2411.06458](http://arxiv.org/abs/2411.06458)|null|\n", "2411.06352": "|**2024-11-10**|**Client Contribution Normalization for Enhanced Federated Learning**|Mayank Kumar Kundalwal et.al.|[2411.06352](http://arxiv.org/abs/2411.06352)|null|\n", "2411.06291": "|**2024-11-09**|**TinyML NLP Approach for Semantic Wireless Sentiment Classification**|Ahmed Y. Radwan et.al.|[2411.06291](http://arxiv.org/abs/2411.06291)|null|\n", "2411.07959": "|**2024-11-12**|**On the Convergence of Continual Federated Learning Using Incrementally Aggregated Gradients**|Satish Kumar Keshri et.al.|[2411.07959](http://arxiv.org/abs/2411.07959)|null|\n", "2411.07889": "|**2024-11-12**|**A Stochastic Optimization Framework for Private and Fair Learning From Decentralized Data**|Devansh Gupta et.al.|[2411.07889](http://arxiv.org/abs/2411.07889)|**[link](https://github.com/justaguyalways/stochastic-federated-differentially-private-and-fair-learning)**|\n", "2411.07841": "|**2024-11-12**|**Federated Learning for Discrete Optimal Transport with Large Population under Incomplete Information**|Navpreet Kaur et.al.|[2411.07841](http://arxiv.org/abs/2411.07841)|null|\n", "2411.07826": "|**2024-11-12**|**Efficient Federated Finetuning of Tiny Transformers with Resource-Constrained Devices**|Kilian Pfeiffer et.al.|[2411.07826](http://arxiv.org/abs/2411.07826)|null|\n", "2411.07816": "|**2024-11-12**|**Dual-Criterion Model Aggregation in Federated Learning: Balancing Data Quantity and Quality**|Haizhou Zhang et.al.|[2411.07816](http://arxiv.org/abs/2411.07816)|null|\n", "2411.07806": "|**2024-11-12**|**Federated Low-Rank Adaptation with Differential Privacy over Wireless Networks**|Tianqu Kang et.al.|[2411.07806](http://arxiv.org/abs/2411.07806)|null|\n", "2411.07752": "|**2024-11-12**|**ALANINE: A Novel Decentralized Personalized Federated Learning For Heterogeneous LEO Satellite Constellation**|Liang Zhao et.al.|[2411.07752](http://arxiv.org/abs/2411.07752)|null|\n", "2411.07523": "|**2024-11-12**|**Collaborative and Federated Black-box Optimization: A Bayesian Optimization Perspective**|Raed Al Kontar et.al.|[2411.07523](http://arxiv.org/abs/2411.07523)|null|\n", "2411.07391": "|**2024-11-11**|**Federated Learning Client Pruning for Noisy Labels**|Mahdi Morafah et.al.|[2411.07391](http://arxiv.org/abs/2411.07391)|**[link](https://github.com/mmorafah/clipfl)**|\n", "2411.08699": "|**2024-11-13**|**FedSub: Introducing class-aware Subnetworks Fusion to Enhance Personalized Federated Learning in Ubiquitous Systems**|Mattia Giovanni Campana et.al.|[2411.08699](http://arxiv.org/abs/2411.08699)|null|\n", "2411.08607": "|**2024-11-13**|**Time-constrained Federated Learning (FL) in Push-Pull IoT Wireless Access**|Van Phuc Bui et.al.|[2411.08607](http://arxiv.org/abs/2411.08607)|null|\n", "2411.09267": "|**2024-11-14**|**Towards efficient compression and communication for prototype-based decentralized learning**|Pablo Fernández-Piñeiro et.al.|[2411.09267](http://arxiv.org/abs/2411.09267)|null|\n", "2411.09055": "|**2024-11-13**|**SAFELOC: Overcoming Data Poisoning Attacks in Heterogeneous Federated Machine Learning for Indoor Localization**|Akhil Singampalli et.al.|[2411.09055](http://arxiv.org/abs/2411.09055)|null|\n", "2411.10383": "|**2024-11-15**|**Framework for Co-distillation Driven Federated Learning to Address Class Imbalance in Healthcare**|Suraj Racha et.al.|[2411.10383](http://arxiv.org/abs/2411.10383)|**[link](https://github.com/humairafirdowse/codistillation)**|\n", "2411.10255": "|**2024-11-15**|**Artificial Intelligence in Pediatric Echocardiography: Exploring Challenges, Opportunities, and Clinical Applications with Explainable AI and Federated Learning**|Mohammed Yaseen Jabarulla et.al.|[2411.10255](http://arxiv.org/abs/2411.10255)|null|\n", "2411.10212": "|**2024-11-15**|**Embedding Byzantine Fault Tolerance into Federated Learning via Virtual Data-Driven Consistency Scoring Plugin**|Youngjoon Lee et.al.|[2411.10212](http://arxiv.org/abs/2411.10212)|**[link](https://github.com/NAVER-INTEL-Co-Lab/gaudi-byzantine)**|\n", "2411.10071": "|**2024-11-15**|**Evidential Federated Learning for Skin Lesion Image Classification**|Rutger Hendrix et.al.|[2411.10071](http://arxiv.org/abs/2411.10071)|null|\n", "2411.09842": "|**2024-11-14**|**FedRewind: Rewinding Continual Model Exchange for Decentralized Federated Learning**|Luca Palazzo et.al.|[2411.09842](http://arxiv.org/abs/2411.09842)|null|\n", "2411.11793": "|**2024-11-18**|**A Potential Game Perspective in Federated Learning**|Kang Liu et.al.|[2411.11793](http://arxiv.org/abs/2411.11793)|**[link](https://github.com/DCN-FAU-AvH/FL-Potential-Game)**|**联邦学习（FL）是一种新兴的跨分布式客户端训练机器学习模型的范式。传统上，在FL设置中，中心服务器为客户分配训练任务（或策略）。然而，从市场导向的角度来看，客户可能基于理性的自我利益独立选择他们的训练努力。为此，我们提出了一个潜在博弈框架，其中每个客户的收益由其个人努力和服务器提供的奖励决定。奖励受到所有客户共同努力的影响，并可以通过一个奖励因子进行调节。我们的研究首先建立了纳什均衡（NEs）的存在性，然后在同质设置下调查了唯一性。我们证明了在一个关键奖励因子处，客户的训练努力显著提高，并将其确定为服务器的最佳选择。此外，我们证明了最佳响应算法可以收敛以计算我们FL博弈中的NEs。最后，我们将特定NEs得出的训练努力应用于现实世界的FL场景，验证了所识别的最佳奖励因子的有效性。**|\n", "2411.11764": "|**2024-11-19**|**Freezing of Gait Detection Using Gramian Angular Fields and Federated Learning from Wearable Sensors**|Shovito Barua Soumma et.al.|[2411.11764](http://arxiv.org/abs/2411.11764)|null|步态冻结（FOG）是帕金森病（PD）的一种致残症状，会损害患者的移动能力和安全性。传统的检测方法由于患者内部和患者之间的变异性而面临挑战，而且大多数系统都在受控环境中进行测试，限制了它们在实际环境中的应用。为了解决这些问题，我们提出了FOGSense，这是一种新型的FOG检测系统，专为不受控制的自由生活条件设计。它使用Gramian Angular Field (GAF) 变换和联邦深度学习来捕捉传统方法可能错过的时序和空间步态模式。我们使用公共PD数据集'tdcsfog'对FOGSense系统进行了评估。FOGSense相比单轴加速度计提高了10.4%的准确性，减少了多传感器系统的失效点，并且对缺失值表现出鲁棒性。联邦架构允许个性化模型适应，并在非高峰时段实现高效的智能手机同步，使其适用于长期监测不断变化的症状。总体而言，FOGSense在F1分数上比现有最先进方法提高了22.2%，并且增强了FOG事件检测的敏感性。代码可在此处获取：https://github.com/shovito66/FOGSense。|\n", "2411.11713": "|**2024-11-18**|**FLMarket: Enabling Privacy-preserved Pre-training Data Pricing for Federated Learning**|Zhenyu Wen et.al.|[2411.11713](http://arxiv.org/abs/2411.11713)|null|联邦学习（FL）作为一种主流的隐私保护机器学习范式，为医疗保健和金融等对隐私要求极高的领域提供了有前景的解决方案。尽管学术界和工业界都投入了大量努力来改进基础的联邦学习，但很少有工作关注数据定价机制。与直接从训练过程中获取信息的简单的事后定价技术不同，我们研究了一个更为困难的问题——在没有直接来自学习过程的信息的情况下进行预训练定价。我们提出了FLMarket，它结合了一个两阶段、基于拍卖的定价机制和一个安全协议来解决效用-隐私冲突。通过全面的实验，我们展示了根据FLMarket进行客户端选择可以在随后的联邦学习训练中比最先进的方法实现超过10%的准确率提升。此外，它比基于训练中的基线方法提高了超过2%的准确率，并且运行时间加快了3倍。|\n", "2411.11304": "|**2024-11-18**|**Toward Personalized Federated Node Classification in One-shot Communication**|Guochen Yan et.al.|[2411.11304](http://arxiv.org/abs/2411.11304)|null|联邦图学习（FGL）已成为在分布式和私有图数据上进行协作训练的一种有前景的范式。一次性联邦学习（OFL）能够在单次通信轮次中实现协作，大大减少了通信成本和潜在的安全问题。然而，现有的OFL方法不是为图数据设计的，而现有的FGL方法在一次通信轮次下，在数据和模型异质性条件下效果不佳。为了缩小这一差距，我们首次提出了一种用于节点分类的一次性个性化联邦图学习方法，该方法也与安全聚合方案兼容。我们估计并聚合类别特征分布的统计信息，以在服务器上生成全局伪图，这可以用来训练全局图模型。此外，我们揭示了现有个性化FGL方法中存在的一个未被充分探讨的问题，即它们的个性化模型存在偏差，忽视了对少数群体的泛化能力。为了同时实现更好的个性化和泛化，我们提出了一种两阶段的个性化训练方法，自适应地利用来自本地数据的个人信息和来自全局伪图的全局信息。在8个多尺度图数据集上的综合实验，以及在不同分区和各种设置下的结果表明，我们的方法在性能上优于最先进的基线。|\n", "2411.11159": "|**2024-11-17**|**Federated Learning for UAV-Based Spectrum Sensing: Enhancing Accuracy Through SNR-Weighted Model Aggregation**|Kürşat Tekbıyık et.al.|[2411.11159](http://arxiv.org/abs/2411.11159)|null|\n", "2411.11044": "|**2024-11-17**|**Efficient Federated Unlearning with Adaptive Differential Privacy Preservation**|Yu Jiang et.al.|[2411.11044](http://arxiv.org/abs/2411.11044)|null|\n", "2411.11039": "|**2024-11-17**|**FedUHB: Accelerating Federated Unlearning via Polyak Heavy Ball Method**|Yu Jiang et.al.|[2411.11039](http://arxiv.org/abs/2411.11039)|null|\n", "2411.10673": "|**2024-11-16**|**How to Defend Against Large-scale Model Poisoning Attacks in Federated Learning: A Vertical Solution**|Jinbo Wang et.al.|[2411.10673](http://arxiv.org/abs/2411.10673)|null|\n", "2411.10619": "|**2024-11-15**|**Electrical Load Forecasting in Smart Grid: A Personalized Federated Learning Approach**|Ratun Rahman et.al.|[2411.10619](http://arxiv.org/abs/2411.10619)|null|\n", "2411.10595": "|**2024-11-15**|**FedAli: Personalized Federated Learning with Aligned Prototypes through Optimal Transport**|Sannara Ek et.al.|[2411.10595](http://arxiv.org/abs/2411.10595)|null|\n", "2411.12697": "|**2024-11-19**|**Attribute Inference Attacks for Federated Regression Tasks**|Francesco Diana et.al.|[2411.12697](http://arxiv.org/abs/2411.12697)|null|联邦学习（FL）使多个客户端，如手机和物联网设备，能够在保持数据本地化的同时协作训练全局机器学习模型。然而，最近的研究表明，FL的训练阶段容易受到重构攻击，例如属性推断攻击（AIA），其中对手利用交换的消息和辅助公共信息来揭示目标客户端的敏感属性。虽然这些攻击在分类任务中已经得到了广泛研究，但它们对回归任务的影响仍然很大程度上未被探索。在本文中，我们通过提出专门针对FL环境中回归任务的新型基于模型的AIA来填补这一空白。我们的方法考虑了对手可以监听交换消息或直接干扰训练过程的场景。我们使用真实世界的数据集将所提出的攻击与最先进的方法进行基准测试。结果表明，在异构客户端数据集中，重构准确性显著提高，这是FL中的常见场景。我们基于模型的AIA的有效性使其成为经验量化联邦回归任务隐私泄露的更好选择。|\n", "2411.12377": "|**2024-11-19**|**Non-IID data in Federated Learning: A Systematic Review with Taxonomy, Metrics, Methods, Frameworks and Future Directions**|Daniel M. Jimenez G. et.al.|[2411.12377](http://arxiv.org/abs/2411.12377)|null|近期机器学习的进步突显了联邦学习（FL）作为一种有前景的方法，它能够让多个分布式的用户（称为客户端）在不共享其私有数据的情况下共同训练机器学习模型。尽管这种保护隐私的方法显示出潜力，但在客户端间的数据不是独立同分布（非IID）时会遇到困难。后者仍然是一个未解决的挑战，可能导致模型性能较差和训练时间更长。尽管非IID数据在联邦学习中的重要性，研究者们对于其分类和量化尚未达成共识。本系统综述旨在通过提供详细的非IID数据分类法、划分协议以及度量数据异质性的指标来填补这一空白。此外，我们还描述了处理非IID数据的流行解决方案及在具有异质数据的联邦学习中使用的标准化框架。基于我们对最新技术的回顾，我们总结了关键的经验教训，并提出了有前景的未来研究方向。|\n", "2411.12244": "|**2024-11-19**|**Hyper-parameter Optimization for Federated Learning with Step-wise Adaptive Mechanism**|Yasaman Saadati et.al.|[2411.12244](http://arxiv.org/abs/2411.12244)|null|联邦学习（FL）是一种去中心化的学习方法，通过利用本地模型参数而非共享客户端的原始数据集来保护敏感信息。尽管这种隐私保护方法在各种应用中被广泛采用，但仍需要大量的开发和优化。自动机器学习（Auto-ML）已被用于减少手动调整的需求。先前的研究探索了将AutoML与不同的FL算法集成，以评估其在增强FL设置中的有效性。然而，自动化FL（Auto-FL）由于涉及大量客户端和客户端与服务器之间的全局训练轮次，面临着额外的挑战，这使得调参过程耗时且几乎不可能在资源受限的边缘设备（如物联网设备）上进行。本文研究了两种轻量级超参数优化（HPO）工具Raytune和Optuna在FL环境中的部署和集成。还设计了一种逐步反馈机制，以加速超参数调优过程，并协调AutoML工具包与FL服务器。为此，集成了局部和全局反馈机制，以限制搜索空间并加快HPO过程。此外，引入了一种新的客户端选择技术，以减轻Auto-FL中的拖尾效应。所选的超参数调优工具使用两个基准数据集FEMNIST和CIFAR10进行了评估。进一步地，论文讨论了成功的HPO工具的关键属性、与FL管道的集成机制以及由FL环境的分布式和异构性质带来的挑战。|\n", "2411.12220": "|**2024-11-19**|**DeTrigger: A Gradient-Centric Approach to Backdoor Attack Mitigation in Federated Learning**|Kichang Lee et.al.|[2411.12220](http://arxiv.org/abs/2411.12220)|null|联邦学习（FL）能够在分布式设备上进行协作模型训练，同时保护本地数据隐私，使其非常适合移动和嵌入式系统。然而，FL的去中心化特性也使其容易受到模型中毒攻击，特别是后门攻击，攻击者通过植入触发模式来操纵模型预测。在本文中，我们提出了DeTrigger，这是一种可扩展且高效的抗后门联邦学习框架，它借鉴了对抗性攻击方法的见解。通过采用带有温度缩放的梯度分析，DeTrigger能够检测并隔离后门触发器，从而实现精确剪枝与后门激活相关的模型权重，而不会牺牲良性模型的知识。在四个广泛使用的数据集上的广泛评估表明，DeTrigger的检测速度比传统方法快达251倍，并且可以将后门攻击的影响降低高达98.9%，对全局模型准确性的负面影响极小。我们的研究结果证明了DeTrigger作为抵御复杂后门威胁的鲁棒且可扩展解决方案的有效性。|\n", "2411.12098": "|**2024-11-18**|**Federated Contrastive Learning of Graph-Level Representations**|Xiang Li et.al.|[2411.12098](http://arxiv.org/abs/2411.12098)|null|图级别的表示（以及基于这些表示的聚类/分类）在多种应用中都是必需的。例如，识别恶意网络流量、预测蛋白质属性等。由于隐私问题、各方之间缺乏信任、法规限制或数据量过大难以快速共享等多种原因，数据通常需要保留在孤立的本地系统中（即不能集中共享进行分析）。这表明了对图级别表示的联邦学习的需求，尤其是在无监督设置下，这一话题尚未得到充分探索。为了解决这个问题，本文提出了一种新的框架，我们称之为联邦对比学习图级别表示（FCLG）。顾名思义，我们的方法基于对比学习。然而，独特之处在于我们在两个层面应用了对比学习。第一层是用于局部无监督的图表示学习。第二层则是解决结合局部模型时遇到的数据分布变化挑战（即“非独立同分布问题”）。通过广泛的实验，在图级别聚类的下游任务上，我们证明了FCLG显著优于现有基线（即将现有的联邦方法应用于现有的图级别聚类方法）。|\n", "2411.11912": "|**2024-11-17**|**F$^3$OCUS -- Federated Finetuning of Vision-Language Foundation Models with Optimal Client Layer Updating Strategy via Multi-objective Meta-Heuristics**|Pramit Saha et.al.|[2411.11912](http://arxiv.org/abs/2411.11912)|null|在资源受限的客户端设备上通过联邦学习（FL）有效训练大型视觉-语言模型（VLMs）需要使用参数高效的微调（PEFT）策略。为此，我们展示了两个因素的影响：客户特定层重要性评分，该评分选择最重要的VLM层进行微调；以及跨客户层多样性评分，该评分鼓励在不同客户端之间选择多样化的层以实现最优的VLM层选择。首先，我们从理论上论证并利用了层间神经切线核的主要特征值大小，并展示了其作为客户特定层重要性评分的有效性。接下来，我们提出了一种新的层更新策略F³OCUS，该策略通过在服务器端采用无数据、多目标、元启发式优化来联合优化层重要性和多样性因素。我们探索了5种不同的元启发式算法，并比较了它们在选择模型层和适配器层方面针对PEFT-FL的有效性。此外，我们发布了一个新的MedVQA-FL数据集，包含总共707,962个VQA三元组和9个模态特异性客户端，并利用它来训练和评估我们的方法。总体而言，我们在涉及58个医学图像数据集和4种不同大小的VLM架构的6种视觉-语言FL任务设置中进行了超过10,000次客户端级别的实验，以证明所提方法的有效性。|\n"}}