{"agent": {"2405.10255": "|**2024-05-16**|**When LLMs step into the 3D World: A Survey and Meta-Analysis of 3D Tasks via Multi-modal Large Language Models**|Xianzheng Ma et.al.|[2405.10255](http://arxiv.org/abs/2405.10255)|**[link](https://github.com/activevisionlab/awesome-llm-3d)**|\n", "2411.03817": "|**2024-11-06**|**From Novice to Expert: LLM Agent Policy Optimization via Step-wise Reinforcement Learning**|Zhirui Deng et.al.|[2411.03817](http://arxiv.org/abs/2411.03817)|null|大型语言模型（LLMs）的卓越能力使其成为各种自主代理系统中的关键组件。虽然传统方法依赖于未经微调的LLMs的内在知识，但更近期的方法转向了强化学习策略，以进一步增强代理在与环境和工具进行复杂交互任务中的能力。然而，先前的方法受到稀疏奖励问题的限制，现有的数据集仅为每个多步推理链提供一个最终的标量奖励，这可能导致策略学习的无效性和低效率。在本文中，我们介绍了StepAgent，它利用逐步骤奖励来优化代理的强化学习过程。借鉴新手到专家理论的精神，我们首先比较专家与代理的行为，自动生成中间奖励以实现精细化优化。此外，我们提出了隐式奖励和逆向强化学习技术，以促进代理反思和策略调整。进一步的理论分析表明，经过多个训练周期后，代理的动作分布可以收敛到专家动作分布。在多个数据集上的实验结果表明，StepAgent的表现优于现有的基线方法。|\n", "2411.03519": "|**2024-11-05**|**AI Metropolis: Scaling Large Language Model-based Multi-Agent Simulation with Out-of-order Execution**|Zhiqiang Xie et.al.|[2411.03519](http://arxiv.org/abs/2411.03519)|null|随着自然语言理解和推理能力的提升，由大型语言模型（LLM）驱动的代理越来越多地在模拟环境中执行复杂任务、与其他代理互动，并展现出与社会科学和游戏相关的新兴行为。然而，当前的多代理仿真经常由于虚假依赖关系导致的有限并行性而效率低下，从而产生性能瓶颈。在这篇论文中，我们介绍了AI Metropolis，这是一种通过引入乱序执行调度来提高LLM代理仿真效率的仿真引擎。通过动态跟踪代理之间的实际依赖关系，AI Metropolis最小化了虚假依赖关系，增强了并行性，并实现了高效的硬件利用。我们的评估表明，AI Metropolis相比使用全局同步的标准并行仿真，在不同情况下实现了1.3倍到4.15倍的速度提升，随着代理数量的增加，其性能接近最优。|\n", "2411.03284": "|**2024-11-05**|**SMoA: Improving Multi-agent Large Language Models with Sparse Mixture-of-Agents**|Dawei Li et.al.|[2411.03284](http://arxiv.org/abs/2411.03284)|**[link](https://github.com/david-li0406/smoa)**|**尽管多智能体系统已被证明能显著提高大型语言模型（LLMs）在各种任务和应用中的性能，但智能体之间密集的交互可能会妨碍其效率和多样性。为了解决这些挑战，我们从稀疏混合专家（SMoE）中汲取灵感，提出了一种稀疏混合智能体（SMoA）框架，以提高多智能体LLMs的效率和多样性。与完全连接的结构不同，SMoA引入了新颖的响应选择和提前停止机制，来稀疏化各个LLM智能体之间的信息流，在性能和效率之间取得平衡。此外，受到SMoE框架中专家多样性原则启发，为了实现工作负载平衡，我们给每个LLM智能体分配了不同的角色描述，促进多样化和发散性思维。在推理、对齐和公平性基准上的大量实验表明，SMoA在保持与传统混合智能体方法相当的性能的同时，计算成本显著降低。进一步分析显示，SMoA更加稳定，具有更大的扩展能力，并通过超参数优化展现出巨大潜力。代码和数据将可在以下网址获取：https://github.com/David-Li0406/SMoA。**|\n", "2411.03252": "|**2024-11-05**|**Spontaneous Emergence of Agent Individuality through Social Interactions in LLM-Based Communities**|Ryosuke Takata et.al.|[2411.03252](http://arxiv.org/abs/2411.03252)|null|我们通过使用基于大型语言模型（LLM）的代理来研究从零开始出现的能动性。在以往对基于LLM的代理的研究中，每个代理的特征，包括个性和记忆，通常是预先定义好的。我们专注于如何从一个未分化的状态中区分出个体性，如行为、个性和记忆。当前的LLM代理在一个群体模拟中进行合作交流，以自然语言交换基于上下文的消息。通过对这一多代理模拟的分析，我们报告了关于社会规范、合作和个人特质如何自发产生的有价值的新见解。本文展示了自主交互的LLM驱动代理通过生成幻觉和标签来维持交流，这反过来增加了它们互动中的词汇多样性。每个代理的情绪通过交流发生变化，随着形成社区，代理们的个性也随之出现并相应地演变。这种计算建模方法及其发现将为分析集体人工智能提供一种新方法。|\n", "2411.02305": "|**2024-11-04**|**CRMArena: Understanding the Capacity of LLM Agents to Perform Professional CRM Tasks in Realistic Environments**|Kung-Hsiang Huang et.al.|[2411.02305](http://arxiv.org/abs/2411.02305)|**[link](https://github.com/salesforceairesearch/crmarena)**|**客户关系管理系统（CRM）对于现代企业至关重要，为管理客户互动和数据提供了基础。将AI代理集成到CRM系统中可以自动化常规流程并增强个性化服务。然而，由于缺乏反映真实世界CRM任务复杂性的现实基准，部署和评估这些代理具有挑战性。为了解决这个问题，我们推出了CRMArena，这是一个旨在评估基于专业工作环境中的现实任务的AI代理的新基准。在CRM专家和行业最佳实践的指导下，我们设计了CRMArena，包括九项客户服务任务，分布在三个角色上：服务代理、分析师和经理。该基准包含了16种常用的工业对象（如账户、订单、知识文章、案例），这些对象之间高度互联，并且包含潜在变量（如投诉习惯、政策违规）来模拟现实的数据分布。实验结果表明，即使使用ReAct提示方法，最先进的大语言模型代理在不到40%的任务中取得成功；即便拥有函数调用能力，成功率也低于55%。我们的发现强调了在实际工作环境中部署前，需要增强代理在函数调用和规则遵循方面的能力。CRMArena向社区发起了一个公开挑战：能够可靠完成任务的系统在流行的工作环境中展示了直接的商业价值。**|\n", "2411.01747": "|**2024-11-04**|**DynaSaur: Large Language Agents Beyond Predefined Actions**|Dang Nguyen et.al.|[2411.01747](http://arxiv.org/abs/2411.01747)|null|现有的LLM代理系统通常在每一步从一个固定且预定义的动作集合中选择动作。虽然这种方法在封闭且范围狭窄的环境中是有效的，但我们认为，在将LLM代理部署到现实世界场景时，它存在两个主要挑战：(1) 从固定的动作集中选择极大地限制了LLM代理的规划和行动能力；(2) 这种方法需要大量的人力来列举并实现所有可能的动作，这在具有大量潜在动作的复杂环境中变得不切实际。在这项工作中，我们提出了一种LLM代理框架，该框架能够在在线方式下动态创建和组合动作。在此框架中，代理通过在每一步生成并执行用通用编程语言编写的程序与环境交互。此外，随着时间的推移生成的动作会被累积起来供将来重用。我们在GAIA基准测试上的广泛实验表明，这一框架提供了显著更大的灵活性，并优于先前的方法。值得注意的是，它允许LLM代理在没有相关动作存在于预定义集合中或现有动作因未预见的边缘情况而失败的情况下恢复。在撰写本文时，我们在GAIA公共排行榜上名列前茅。我们的代码可以在https://github.com/adobe-research/dynasaur找到。|\n", "2411.01643": "|**2024-11-03**|**EcoAct: Economic Agent Determines When to Register What Action**|Shaokun Zhang et.al.|[2411.01643](http://arxiv.org/abs/2411.01643)|null|最近的进展使大型语言模型（LLMs）能够作为代理，利用外部工具执行操作。这需要注册，即将工具信息整合到LLM的上下文中，然后才能采取行动。目前的方法不加选择地将所有候选工具都整合进代理的上下文中，并在多个推理步骤中保留它们。这一过程对LLM代理来说是不透明的，并且没有集成到其推理程序中，导致由于无关工具增加了上下文长度而产生效率低下。为了解决这个问题，我们引入了EcoAct，这是一种工具使用算法，允许LLMs根据需要选择性地注册工具，从而优化上下文使用。通过将工具注册过程整合进推理程序，EcoAct在多步骤推理任务中减少了超过50%的计算成本，同时保持了性能，这一点通过广泛的实验得到了证明。此外，只需对提示进行少量修改，它就可以插入任何推理管道中，使其适用于当前和未来的LLM代理。|\n", "2411.03346": "|**2024-11-03**|**Fixing Security Vulnerabilities with AI in OSS-Fuzz**|Yuntong Zhang et.al.|[2411.03346](http://arxiv.org/abs/2411.03346)|null|关键的开源软件系统会经历长时间的模糊测试活动。这些模糊测试通常会在程序输入域中进行有偏随机搜索，以找到导致软件系统崩溃的输入。这种模糊测试对于增强软件系统的安全性非常有用，因为即使是闭源软件也可能使用开源组件。因此，测试开源软件至关重要。目前，OSS-Fuzz是最重要且广泛使用的基础设施，用于对开源系统进行持续验证。不幸的是，尽管OSS-Fuzz已经识别出超过10,000个漏洞，涉及1,000多个软件项目，但检测到的漏洞可能仍然未被修复，因为在实践中漏洞修复通常是手动完成的。在这项工作中，我们依靠大型语言模型（LLM）代理在自动程序改进方面的最新进展，包括自动修复安全漏洞。我们将著名的AutoCodeRover代理定制为修复安全漏洞。这是因为像AutoCodeRover这样的LLM代理通过代码搜索从问题描述中修复错误。相反，在安全修补方面，我们依赖于利用输入的测试执行来提取与修复相关的代码元素。我们在OSS-Fuzz漏洞数据上的经验表明，LLM代理的自主性对于成功的安全修补是有用的，这与Agentless方法不同，后者固定了控制流。更重要的是，我们的发现表明，不能仅通过补丁与参考代码之间的代码相似度（如VulMaster中使用的CodeBLEU分数）来衡量补丁的质量，因为具有高CodeBLEU分数的补丁仍然可能无法通过给定的利用输入。我们的研究结果表明，安全补丁的正确性需要考虑动态属性，如测试执行，而不仅仅是依赖标准的文本/代码相似度指标。|\n", "2411.01236": "|**2024-11-02**|**AutoPT: How Far Are We from the End2End Automated Web Penetration Testing?**|Benlong Wu et.al.|[2411.01236](http://arxiv.org/abs/2411.01236)|**[link](https://github.com/Dizzy-K/AutoPT)**|**渗透测试对于确保网络安全至关重要，可以提前检测和修复漏洞，防止数据泄露和严重后果。大型语言模型（LLM）强大的推理能力在各个领域取得了显著进展，基于LLM的代理的发展潜力可以彻底改变网络安全渗透测试行业。在这项工作中，我们建立了一个全面的端到端渗透测试基准，使用真实世界的渗透测试环境来探索基于LLM的代理在此领域的性能。我们的结果表明，这些代理熟悉渗透测试任务的框架，但在生成准确命令和执行完整流程方面仍面临限制。因此，我们总结了当前的挑战，包括难以维护整个消息历史记录以及代理容易陷入停滞的问题。基于上述见解，我们提出了一个渗透测试状态机（PSM），利用有限状态机（FSM）方法论来解决这些限制。然后，我们介绍了AutoPT，这是一种基于PSM原则并由LLM驱动的自动化渗透测试代理，它利用了LLM固有的推理能力和状态机的约束框架。我们的评估结果显示，与基线框架ReAct相比，AutoPT在GPT-4o mini模型上的任务完成率从22%提高到了41%。与基线框架和手动工作相比，AutoPT还进一步减少了时间和经济成本。因此，我们的AutoPT促进了自动化渗透测试的发展，并对学术界和工业界产生了重大影响。**|\n", "2411.01143": "|**2024-11-02**|**A Large-scale Time-aware Agents Simulation for Influencer Selection in Digital Advertising Campaigns**|Xiaoqing Zhang et.al.|[2411.01143](http://arxiv.org/abs/2411.01143)|null|\n", "2411.04329": "|**2024-11-07**|**CodeTree: Agent-guided Tree Search for Code Generation with Large Language Models**|Jierui Li et.al.|[2411.04329](http://arxiv.org/abs/2411.04329)|null|在大量的代码和文本数据上进行预训练后，大型语言模型（LLMs）在执行代码生成任务方面展示了卓越的能力。通过增加基于执行的反馈，这些模型可以作为具有自我改进和优化生成代码能力的代理。然而，在面对具有极大搜索空间的复杂编码任务时，现有的代理方法在多阶段规划、生成和调试方面仍然存在困难。为了解决这个问题，我们提出了CodeTree框架，帮助LLM代理在代码生成过程的不同阶段高效探索搜索空间。具体来说，我们采用了一种统一的树结构来明确地探索不同的编码策略，生成相应的编码解决方案，并随后对这些方案进行改进。在每个阶段，探索过程中的关键决策（排序、终止、扩展）都由环境提供的基于执行的反馈以及LLM代理生成的反馈共同指导。我们在7个代码生成基准测试中全面评估了CodeTree，并展示了CodeTree相对于强大基线的显著性能提升。使用GPT-4o作为基础模型，我们在HumanEval上持续获得95.1的最高分，在MBPP上获得98.7的分数，在CodeContests上获得43.0的分数。在挑战性的SWEBench基准测试中，我们的方法带来了显著的性能提升。|\n"}, "llm": {"2405.10255": "|**2024-05-16**|**When LLMs step into the 3D World: A Survey and Meta-Analysis of 3D Tasks via Multi-modal Large Language Models**|Xianzheng Ma et.al.|[2405.10255](http://arxiv.org/abs/2405.10255)|**[link](https://github.com/activevisionlab/awesome-llm-3d)**|\n", "2411.04118": "|**2024-11-06**|**Medical Adaptation of Large Language and Vision-Language Models: Are We Making Progress?**|Daniel P. Jeong et.al.|[2411.04118](http://arxiv.org/abs/2411.04118)|null|\n", "2411.04105": "|**2024-11-06**|**How Transformers Solve Propositional Logic Problems: A Mechanistic Analysis**|Guan Zhe Hong et.al.|[2411.04105](http://arxiv.org/abs/2411.04105)|null|\n", "2411.04032": "|**2024-11-06**|**Beemo: Benchmark of Expert-edited Machine-generated Outputs**|Ekaterina Artemova et.al.|[2411.04032](http://arxiv.org/abs/2411.04032)|null|\n", "2411.03964": "|**2024-11-06**|**What Really is Commonsense Knowledge?**|Quyet V. Do et.al.|[2411.03964](http://arxiv.org/abs/2411.03964)|null|\n", "2411.03962": "|**2024-11-06**|**How Does A Text Preprocessing Pipeline Affect Ontology Syntactic Matching?**|Zhangcheng Qiang et.al.|[2411.03962](http://arxiv.org/abs/2411.03962)|null|\n", "2411.03957": "|**2024-11-06**|**Fine-Grained Guidance for Retrievers: Leveraging LLMs' Feedback in Retrieval-Augmented Generation**|Yuhang Liu et.al.|[2411.03957](http://arxiv.org/abs/2411.03957)|null|\n", "2411.03948": "|**2024-11-06**|**Long-Form Text-to-Music Generation with Adaptive Prompts: A Case of Study in Tabletop Role-Playing Games Soundtracks**|Felipe Marra et.al.|[2411.03948](http://arxiv.org/abs/2411.03948)|null|\n", "2411.03884": "|**2024-11-06**|**Polynomial Composition Activations: Unleashing the Dynamics of Large Language Models**|Zhijian Zhuo et.al.|[2411.03884](http://arxiv.org/abs/2411.03884)|**[link](https://github.com/brycezhuo/polycom)**|\n", "2411.03883": "|**2024-11-06**|**MEG: Medical Knowledge-Augmented Large Language Models for Question Answering**|Laura Cabello et.al.|[2411.03883](http://arxiv.org/abs/2411.03883)|**[link](https://github.com/lautel/meg)**|\n", "2411.03881": "|**2024-11-06**|**Data Fusion of Synthetic Query Variants With Generative Large Language Models**|Timo Breuer et.al.|[2411.03881](http://arxiv.org/abs/2411.03881)|**[link](https://github.com/breuert/sigirap24)**|\n", "2411.05000": "|**2024-11-07**|**Needle Threading: Can LLMs Follow Threads through Near-Million-Scale Haystacks?**|Jonathan Roberts et.al.|[2411.05000](http://arxiv.org/abs/2411.05000)|null|随着大型语言模型（LLMs）的上下文限制不断增加，其应用范围和下游功能也在不断扩大。在许多现实世界的任务中，决策依赖于分散在多份文档中的细节，而这些文档往往包含大量不相关的信息。长上下文LLMs似乎非常适合这种复杂的信息检索和推理任务，而这些任务传统上被认为成本高且耗时。然而，尽管近年来长上下文模型的发展迅速，但我们对其如何有效利用上下文的理解却没有跟上步伐。为了解决这个问题，我们进行了一系列检索实验，旨在评估17个领先的LLMs的能力，例如它们在上下文窗口中追踪信息线索的能力。令人惊讶的是，我们发现许多模型具有显著的线程安全性：能够在同时追踪多条信息线索时而不显著降低性能。不过，对于许多模型来说，有效的上下文限制明显短于支持的上下文长度，随着上下文窗口的增长，准确性会下降。我们的研究还强调了一个重要观点，即来自不同分词器的标记计数不应直接比较——它们通常对应着书面字符数量上的巨大差异。我们发布了我们的代码和长上下文实验数据。|\n", "2411.04997": "|**2024-11-07**|**LLM2CLIP: Powerful Language Model Unlock Richer Visual Representation**|Weiquan Huang et.al.|[2411.04997](http://arxiv.org/abs/2411.04997)|**[link](https://github.com/microsoft/LLM2CLIP)**|**CLIP是当今最重要的多模态基础模型之一。是什么赋予了CLIP强大的能力？自然语言提供的丰富监督信号，作为人类知识的载体，塑造了一个强大的跨模态表示空间。然而，随着像GPT-4和LLaMA这样的大型语言模型（LLMs）的迅速发展，语言理解和生成的边界不断被推进。这引发了一个有趣的问题：是否可以利用LLMs的能力进一步改进多模态表示学习？将LLMs融入CLIP中的潜在好处显而易见。LLMs强大的文本理解能力从根本上提高了CLIP处理图像标题的能力，极大地增强了其处理长且复杂文本的能力——这是原始CLIP众所周知的一个局限。此外，LLMs是在庞大的文本语料库上训练的，拥有开放世界的知识。这使得它们能够在训练过程中扩展标题信息，提高学习过程的效率。在本文中，我们提出了一种新的方法LLM2CLIP，该方法充分利用LLMs的力量来释放CLIP的潜力。通过对LLM在标题空间内进行对比学习微调，我们将其文本能力提取到输出嵌入中，显著提高了输出层的文本区分性。然后，我们设计了一个高效的训练过程，在这个过程中，微调后的LLM充当CLIP视觉编码器的强大教师。得益于LLM的存在，我们现在可以整合更长、更复杂的标题，而不受原始CLIP文本编码器上下文窗口和能力限制的约束。我们的实验表明，这种方法在跨模态任务上带来了显著的改进。**|\n", "2411.04996": "|**2024-11-07**|**Mixture-of-Transformers: A Sparse and Scalable Architecture for Multi-Modal Foundation Models**|Weixin Liang et.al.|[2411.04996](http://arxiv.org/abs/2411.04996)|null|大型语言模型（LLM）的发展已经扩展到了能够在一个统一框架内处理文本、图像和语音的多模态系统。与仅处理文本的LLM相比，训练这些模型需要更大规模的数据集和计算资源。为了解决扩展挑战，我们引入了混合变压器（MoT），这是一种稀疏的多模态变压器架构，可以显著降低预训练的计算成本。MoT通过模态解耦模型中的非嵌入参数——包括前馈网络、注意力矩阵和层归一化——允许针对特定模态进行处理，并在整个输入序列上执行全局自注意力。我们在多种设置和模型规模下对MoT进行了评估。在变色龙7B设置（自动回归文本与图像生成）中，MoT仅使用55.8%的FLOPs就达到了密集基线性能。当扩展到包含语音时，MoT仅用37.2%的FLOPs就达到了与密集基线相当的语音性能。在输血设置中，其中文本和图像是以不同的目标训练的，一个7B MoT模型以三分之一的FLOPs匹配了密集基线的图像模态性能；而一个760M MoT模型在关键图像生成指标上超过了1.4B密集基线。系统分析进一步突显了MoT的实际好处，在AWS p4de.24xlarge实例上的NVIDIA A100 GPU测试表明，MoT达到密集基线图像质量所需的时间仅为47.2%，达到文本质量所需时间为75.6%。|\n", "2411.04991": "|**2024-11-07**|**Rethinking Bradley-Terry Models in Preference-Based Reward Modeling: Foundations, Theory, and Alternatives**|Hao Sun et.al.|[2411.04991](http://arxiv.org/abs/2411.04991)|**[link](https://github.com/holarissun/rewardmodelingbeyondbradleyterry)**|**Bradley-Terry (BT) 模型是大型语言模型（LLM）对齐中奖励建模的一种常见且成功的实践。然而，尚不清楚为什么最初为多人随机游戏匹配开发的该模型可以被用来将成对响应比较转换为奖励值并进行预测。特别是在只有有限数量的提示-响应对与其他对稀疏比较的情况下。在本文中，我们首先回顾了使用BT模型进行奖励建模的基础，并基于深度神经网络和嵌入建立了BT奖励模型的收敛率，为其使用提供了理论基础。尽管理论上合理，但我们认为从下游优化的角度来看，BT模型并不是必需的选择。这是因为奖励模型只需要通过真实奖励的单调变换来保持正确的排名预测。我们强调了奖励建模中的顺序一致性这一关键概念，并展示了BT模型具有这种属性。因此，我们提出了一种简单直接的上界算法，该算法与现成的二元分类器兼容，作为替代的顺序一致奖励建模目标。为了提供实际见解，我们使用6个基础LLM、2个数据集以及多样化的注释设计（这些设计在数量、质量和偏好注释的配对选择上有所不同），在超过12,000个实验设置中实证评估了这些不同的奖励建模方法的表现。**|\n", "2411.04981": "|**2024-11-07**|**Enhancing Reverse Engineering: Investigating and Benchmarking Large Language Models for Vulnerability Analysis in Decompiled Binaries**|Dylan Manuel et.al.|[2411.04981](http://arxiv.org/abs/2411.04981)|null|安全专家通过逆向工程（反编译）二进制代码来识别关键的安全漏洞。在重要系统中，如固件、驱动程序和用于关键基础设施的专有软件，由于源代码访问受限，使得对二进制级别的分析尤为重要。即使可以访问源代码，在编译后源代码与处理器执行的二进制代码之间仍然存在语义差距，这可能阻碍源代码中的漏洞检测。尽管如此，当前关于大型语言模型（LLM）的研究往往忽略了反编译二进制文件在这一领域的重要性，而仅仅关注于源代码。在这项工作中，我们首次实证揭示了最先进的LLM在分析反编译二进制文件中的漏洞时存在的显著语义局限性，这主要是由于相关数据集的缺乏。为了解决这个问题，我们引入了DeBinVul，这是一个新的反编译二进制代码漏洞数据集。我们的数据集支持多种架构和多级优化，并且专注于C/C++语言，因为它们在关键基础设施中广泛使用并且与许多漏洞有关。具体来说，我们收集了150,872个易受攻击和不易受攻击的反编译二进制代码样本，用于完成以下任务：(i) 识别；(ii) 分类；(iii) 描述漏洞；以及(iv) 在反编译二进制领域恢复函数名称。随后，我们使用DeBinVul微调了最先进的LLM，并报告CodeLlama、Llama3和CodeGen2在检测二进制代码漏洞方面的能力分别提高了19%、24%和21%。此外，利用DeBinVul，我们在漏洞分类任务上达到了80-90%的高性能。同时，我们在函数名恢复和漏洞描述任务上的表现也有所提高。|\n", "2411.04975": "|**2024-11-07**|**SuffixDecoding: A Model-Free Approach to Speeding Up Large Language Model Inference**|Gabriele Oliaro et.al.|[2411.04975](http://arxiv.org/abs/2411.04975)|null|我们提出了一种名为SuffixDecoding的新方法，这是一种无需模型的加速大型语言模型（LLM）推理的技术，通过推测性解码实现。与依赖草稿模型或专门解码头的现有方法不同，SuffixDecoding利用从先前生成输出构建的后缀树来高效预测候选标记序列。我们的方法支持灵活的树状结构推测，而无需维护和协调额外模型。SuffixDecoding通过基于经验标记频率的原则性评分机制，构建并动态更新后缀树以捕捉生成文本中的模式，从而构造推测树。SuffixDecoding仅需CPU内存，在典型的LLM服务节点上这种资源丰富且未充分利用。我们展示了在包括开放域聊天、代码生成和文本到SQL任务在内的多样化工作负载中，SuffixDecoding相比基于模型的方法实现了具有竞争力的速度提升。对于开放式聊天和代码生成功能，SuffixDecoding比SpecInfer实现了高达1.4倍的输出吞吐量，并且每令牌时间（TPOT）延迟降低了1.1倍。在一个专有的多LLM文本到SQL应用程序中，SuffixDecoding相比推测性解码达到了高达2.9倍的输出吞吐量和3倍的更低延迟。我们的评估表明，即使参考语料库只有256个示例，SuffixDecoding也能保持高接受率，同时随着更多历史输出被纳入继续提高性能。|\n", "2411.04965": "|**2024-11-07**|**BitNet a4.8: 4-bit Activations for 1-bit LLMs**|Hongyu Wang et.al.|[2411.04965](http://arxiv.org/abs/2411.04965)|null|近期关于1比特大型语言模型（LLMs），如BitNet b1.58的研究，为降低LLMs推理成本同时保持其性能提供了有前景的方向。在这项工作中，我们引入了BitNet a4.8，使1比特LLMs能够使用4比特激活。BitNet a4.8采用混合量化和稀疏化策略来减轻由异常通道引入的量化误差。具体来说，我们对注意力层和前馈网络层的输入使用4比特激活，同时对中间状态进行稀疏化处理并随后进行8比特量化。广泛的实验表明，BitNet a4.8在等效训练成本下达到了与BitNet b1.58相当的性能，并且通过启用4比特（INT4/FP4）内核，在推理时速度更快。此外，BitNet a4.8仅激活55%的参数，并支持3比特KV缓存，进一步提高了大规模LLM部署和推理的效率。|\n", "2411.04962": "|**2024-11-07**|**Position Paper On Diagnostic Uncertainty Estimation from Large Language Models: Next-Word Probability Is Not Pre-test Probability**|Yanjun Gao et.al.|[2411.04962](http://arxiv.org/abs/2411.04962)|null|大型语言模型（LLMs）正在被探索用于诊断决策支持，但它们在估计临床决策中至关重要的预测试概率方面的能力仍然有限。本研究使用结构化的电子健康记录数据评估了两种大型语言模型Mistral-7B和Llama3-70B在三个诊断任务中的表现。我们考察了三种当前从大型语言模型中提取概率估计的方法，并揭示了这些方法的局限性。我们的目标是强调改进大型语言模型置信度估计技术的必要性。|\n", "2411.04954": "|**2024-11-07**|**CAD-MLLM: Unifying Multimodality-Conditioned CAD Generation With MLLM**|Jingwei Xu et.al.|[2411.04954](http://arxiv.org/abs/2411.04954)|null|本文旨在设计一个统一的计算机辅助设计（CAD）生成系统，该系统能够根据用户的文本描述、图像、点云甚至它们的组合轻松生成CAD模型。为此，我们引入了CAD-MLLM，这是第一个能够在多模态输入条件下生成参数化CAD模型的系统。具体来说，在CAD-MLLM框架中，我们利用CAD模型的命令序列，并使用先进的大型语言模型（LLM）来对齐这些多样化的多模态数据和CAD模型的向量化表示之间的特征空间。为了促进模型训练，我们设计了一个全面的数据构建和标注流程，为每个CAD模型配备相应的多模态数据。我们的结果数据集名为Omni-CAD，是第一个包含文本描述、多视角图像、点云和每个CAD模型的命令序列的多模态CAD数据集。它包含大约45万个实例及其CAD构造序列。为了全面评估我们生成的CAD模型的质量，我们在当前主要关注重建质量的评估指标之外，还引入了评估拓扑质量和表面封闭程度的额外指标。广泛的实验结果表明，CAD-MLLM在性能上显著优于现有的条件生成方法，并且对噪声和缺失点具有很高的鲁棒性。项目页面和更多可视化内容可以在以下网址找到：https://cad-mllm.github.io/|\n", "2411.04920": "|**2024-11-07**|**GPTKB: Building Very Large Knowledge Bases from Language Models**|Yujia Hu et.al.|[2411.04920](http://arxiv.org/abs/2411.04920)|null|通用领域的知识库（KB），特别是“三大”——Wikidata、Yago和DBpedia，是许多智能应用的支柱。尽管这三者一直在稳步发展，但大规模的知识库构建整体上却鲜有新的尝试。在这项工作中，我们提议完全从大型语言模型（LLM）构建一个大型通用领域知识库。我们展示了从LLM进行大规模知识库构建的可行性，同时强调了实体识别、实体和属性规范化以及分类法构建方面的特定挑战。作为原型，我们使用GPT-4o-mini构建了GPTKB，其中包含超过290万个实体的1.05亿条三元组，成本比之前的KBC项目低100倍。我们的工作对两个领域都是里程碑式的：对于自然语言处理（NLP），它首次提供了关于LLM知识（或信念）的建设性见解；对于语义网，它为长期存在的通用领域知识库构建挑战展示了新的前进方向。GPTKB可在https://gptkb.org访问。|\n"}, "moe": {"2411.02115": "|**2024-11-04**|**FedMoE-DA: Federated Mixture of Experts via Domain Aware Fine-grained Aggregation**|Ziwei Zhan et.al.|[2411.02115](http://arxiv.org/abs/2411.02115)|null|联邦学习（FL）是一种协作式的机器学习方法，它使多个客户端能够在不共享其私有数据的情况下训练模型。随着深度学习的兴起，大规模模型因其出色的性能而受到了广泛关注。然而，在联邦学习中，计算和通信资源受限的客户端成为部署这些大型模型的关键挑战。混合专家（MoE）架构通过其稀疏激活特性解决了这一问题，在推理和更新过程中减少了计算工作量和通信需求。此外，MoE 通过允许每个专家专注于数据分布的不同子集，从而促进了更好的个性化。为了减轻服务器与客户端之间的通信负担，我们提出了 FedMoE-DA，这是一种新的联邦学习模型训练框架，该框架利用了 MoE 架构，并结合了一种新颖的领域感知、细粒度聚合策略，以同时增强鲁棒性、个性化能力和通信效率。具体来说，我们利用了客户端内专家模型之间以及客户端间数据异质性的相关性。此外，我们利用客户端间的点对点（P2P）通信进行选择性的专家模型同步，从而显著减少了服务器与客户端之间的传输。实验表明，我们的 FedMoE-DA 在实现优异性能的同时，减轻了服务器的通信压力。|\n", "2411.01457": "|**2024-11-03**|**Facet-Aware Multi-Head Mixture-of-Experts Model for Sequential Recommendation**|Mingrui Liu et.al.|[2411.01457](http://arxiv.org/abs/2411.01457)|null|序列推荐（SR）系统通过利用用户的交互历史来捕捉用户动态的偏好，表现出色。大多数现有的SR系统为每个项目分配一个单一的嵌入向量来表示其特征，并采用各种类型的模型将这些项目嵌入组合成序列表示向量以捕捉用户意图。然而，我们认为这种表示方法不足以捕捉项目的多方面特性（例如，电影类型、主演演员）。此外，用户在这些方面经常表现出复杂且多样的偏好（例如，在类型方面既喜欢动作片也喜欢音乐剧），这很难被完全表示。为了解决上述问题，我们提出了一种新的结构，称为面向方面的多头混合专家模型用于序列推荐（FAME）。我们利用最后一层多头注意力中的每个头的子嵌入分别预测下一个项目。这种方法能够在不增加模型复杂性的情况下捕捉项目的潜在多方面性质。一种门控机制整合了来自每个头的推荐并动态确定它们的重要性。此外，我们在每个注意力头中引入了一个混合专家（MoE）网络，以分解每个方面内的各种用户偏好。MoE中的每个专家专注于特定的偏好。采用可学习的路由网络来计算每个专家的重要性权重并进行聚合。我们在四个公开的序列推荐数据集上进行了广泛的实验，结果表明我们的方法比现有基线模型更有效。|\n", "2411.01433": "|**2024-11-06**|**HOBBIT: A Mixed Precision Expert Offloading System for Fast MoE Inference**|Peng Tang et.al.|[2411.01433](http://arxiv.org/abs/2411.01433)|null|混合专家（MoE）架构在大型语言模型（LLMs）时代展示了显著的优势，提供了增强的能力并降低了推理成本。然而，由于其巨大的内存需求，在内存受限的边缘设备上部署基于MoE的LLMs仍然具有挑战性。虽然现有的专家卸载方法可以缓解内存需求，但它们通常会带来显著的专家加载成本或牺牲模型准确性。我们提出了HOBBIT，这是一个混合精度的专家卸载系统，旨在实现灵活高效的MoE推理。我们的关键洞察是，通过动态地用低精度版本替换不太重要的缓存未命中专家，可以大幅减少专家加载延迟同时保持模型准确性。HOBBIT引入了三种创新技术，映射了MoE计算的自然层次结构：(1) 令牌级别的动态专家加载机制，(2) 层级别的自适应专家预取技术，以及(3) 序列级别的多维专家缓存策略。这些创新充分利用了混合精度专家推理的优势。通过在著名的LLM推理框架Llama.cpp之上实现HOBBIT，我们在不同的边缘设备上使用代表性的MoE模型对其性能进行了评估。结果表明，与最先进的MoE卸载系统相比，HOBBIT在解码速度上最高可达到9.93倍的提升。|\n", "2411.01288": "|**2024-11-07**|**HEXA-MoE: Efficient and Heterogeneous-aware MoE Acceleration with ZERO Computation Redundancy**|Shuqing Luo et.al.|[2411.01288](http://arxiv.org/abs/2411.01288)|null|混合专家（MoE）已成为一种实用的方法，用于扩展Transformer模型的参数以实现更好的泛化能力，同时保持计算开销的亚线性增长。目前的MoE模型主要基于分布式设备上的专家并行构建。然而，这种方法通常依赖于同构设备进行部署，并且存在严重的通信开销和计算冗余问题。在本文中，我们探索开发了一个名为**HEXA-MoE**的异构感知专家分配框架，该框架显著提高了计算效率。它包含两个组件：(1) **专家特定算子**。我们用自定义算子替换了典型的通用矩阵乘法或分组矩阵乘法接口，使得计算能够以零冗余的方式就地执行。(2) 针对不同工作负载规模的**自适应数据和模型中心配置**。具体来说，我们在每个设备上引入了管道共享缓存，以解决现有数据中心MoE库中的高内存消耗问题。通过对Swin-MoE基准测试的全面实验，一致显示了我们的HEXA-MoE框架的有效性，即相比当前最先进的MoE库，减少了10%~48%的内存消耗，并实现了0.5~4.3倍的速度提升。此外，我们还研究了HEXA-MoE在异构设备上的数据和模型中心设置。有希望的结果表明，在异构设备上使用HEXA-MoE的最佳并行配置可以显著减少整体延迟。代码可从https://github.com/UNITES-Lab/HEXA-MoE获取。|\n", "2411.01245": "|**2024-11-02**|**PMoL: Parameter Efficient MoE for Preference Mixing of LLM Alignment**|Dongxu Liu et.al.|[2411.01245](http://arxiv.org/abs/2411.01245)|null|强化学习从人类反馈（RLHF）已被证明是有效的方法，用于大型语言模型（LLMs）的偏好对齐，并广泛应用于LLMs的后训练过程中。然而，RLHF在处理多个竞争性偏好时遇到困难，这导致LLMs与人类偏好的对齐度下降。为了解决这个问题，我们从模型架构的角度提出了偏好混合LoRAs（PMoL），它可以适应任意数量偏好的混合。PMoL结合了专家混合（MoE）和低秩适配器（LoRA）。这种架构创新地应用于偏好对齐的研究中，并取得了显著的性能提升。通过使用专家组软损失，使MoE具备了混合偏好的能力。经过奖励模型和GPT-4o的全面评估，实验结果表明，相比于基线方法，PMoL具有更优越的偏好混合能力，并且以更低的训练成本实现了更好的偏好对齐。|\n", "2411.01016": "|**2024-11-01**|**MoE-I$^2$: Compressing Mixture of Experts Models through Inter-Expert Pruning and Intra-Expert Low-Rank Decomposition**|Cheng Yang et.al.|[2411.01016](http://arxiv.org/abs/2411.01016)|null|混合专家（MoE）大语言模型的出现显著推动了语言模型的发展。与传统的大语言模型相比，MoE大语言模型在激活参数明显减少的情况下实现了更高的性能。尽管如此，其庞大的参数规模仍然导致部署成本高昂。在本文中，我们提出了一种针对MoE的两阶段压缩方法，以减小模型大小并降低计算成本。首先，在专家间剪枝阶段，我们分析了每一层的重要性，并提出了基于层的遗传搜索和块级KT-感受野的非均匀剪枝比例来剪枝单个专家。其次，在专家内分解阶段，我们应用低秩分解进一步压缩剩余专家中的参数。在Qwen1.5-MoE-A2.7B、DeepSeek-V2-Lite和Mixtral-8×7B上的大量实验表明，我们提出的方法可以在保持各种零样本任务性能的同时，既减少模型大小又提高推理效率。代码将在https://github.com/xiaochengsky/MoEI-2.git 上公开。|\n", "2411.02433": "|**2024-11-01**|**SLED: Self Logits Evolution Decoding for Improving Factuality in Large Language Models**|Jianyi Zhang et.al.|[2411.02433](http://arxiv.org/abs/2411.02433)|null|大型语言模型（LLMs）展示了卓越的能力，但其输出有时可能不可靠或事实不准确。为了解决这个问题，我们引入了一种新的解码框架——自对数进化解码（SLED），该框架无需依赖外部知识库或进一步微调即可增强LLMs的真实性。从优化的角度来看，我们的SLED框架通过对比最终层与早期层的输出对数，利用嵌入在LLM中的潜在知识。然后，它采用近似梯度方法，使潜在知识能够指导输出的自我完善，从而有效提高事实准确性。我们在既定基准上进行了广泛的实验，涵盖了多种模型家族（如LLaMA 2、LLaMA 3、Gemma）和规模（从2B到70B），包括更先进的架构配置，如专家混合（MoE）。我们的评估涵盖了广泛的任务，包括多选题、开放式生成以及适应链式思维推理任务。结果表明，与现有的解码方法相比，SLED始终将事实准确性提高了最多20%，同时保持了自然语言的流畅性和可忽略不计的延迟开销。此外，它可以灵活地与其他解码方法结合使用，以进一步提高它们的性能。|\n", "2411.00662": "|**2024-11-01**|**MoNTA: Accelerating Mixture-of-Experts Training with Network-Traffc-Aware Parallel Optimization**|Jingming Guo et.al.|[2411.00662](http://arxiv.org/abs/2411.00662)|**[link](https://github.com/enflametechnology/deepspeed)**|**混合专家（MoE）是一种先进的模型架构，它将来自不同领域的多个专业模型组合成一个超级模型。这种方法使得模型在不显著增加训练和推理计算成本的情况下实现扩展，并最大化模型性能。然而，当前的分布式训练框架并未考虑到通信的最终优化，特别是对于大型基础模型而言。本文提出了一种网络流量感知的并行优化方法，该方法基于通信量以及训练集群内的节点间和节点内网络拓扑选择最优的并行策略。与DeepSpeed相比，在8卡张量并行下，MoNTA实现了AllToAll通信性能8倍的提升。与基线相比，使用16张A800显卡训练一个2x70B模型，序列长度为8K时，总体延迟性能提高了13%。项目页面：https://github.com/EnflameTechnology/DeepSpeed。**|\n", "2411.00918": "|**2024-11-01**|**LIBMoE: A Library for comprehensive benchmarking Mixture of Experts in Large Language Models**|Nam V. Nguyen et.al.|[2411.00918](http://arxiv.org/abs/2411.00918)|**[link](https://github.com/Fsoft-AIC/LibMoE)**|**专家混合模型（MoEs）在开发更高效和有效的大规模语言模型（LLMs）中发挥着重要作用。由于巨大的资源需求，研究大规模MoE算法对许多研究人员来说仍然难以触及。本工作开发了*LibMoE*，这是一个全面且模块化的框架，旨在简化MoE算法的研究、训练和评估过程。基于三个核心原则：(i) 模块化设计，(ii) 高效训练；(iii) 全面评估，LibMoE通过标准化训练和评估流程，使LLM中的MoE更容易被广大研究人员所使用。利用LibMoE，我们广泛地基准测试了五种最先进的MoE算法，在三种不同的LLM上以及11个数据集上的零样本设置下进行了对比。结果显示，尽管每种MoE算法都有其独特性，但在广泛的跨任务平均性能上，所有MoE算法表现大致相似。凭借其模块化设计和广泛的评估，我们相信LibMoE将为研究人员朝着下一代MoE和LLMs的发展做出有意义的进步提供宝贵的支持。项目页面: https://fsoft-aic.github.io/fsoft-LibMoE.github.io**|\n", "2410.23836": "|**2024-10-31**|**Stereo-Talker: Audio-driven 3D Human Synthesis with Prior-Guided Mixture-of-Experts**|Xiang Deng et.al.|[2410.23836](http://arxiv.org/abs/2410.23836)|null|本文介绍了一种名为Stereo-Talker的新颖一次性音频驱动的人体视频合成系统，该系统能够生成具有精确唇形同步、富有表现力的身体手势、时间一致的照片级真实感质量和连续视角控制的3D说话视频。整个过程分为两个阶段。在第一阶段，系统将音频输入映射为高保真的动作序列，包括上半身的手势和面部表情。为了丰富动作的多样性和真实性，我们整合了大语言模型（LLM）先验与文本对齐的语义音频特征，利用LLM跨模态泛化能力来提高动作质量。在第二阶段，我们通过引入一种基于先验指导的混合专家（MoE）机制改进了基于扩散的视频生成模型：视图引导的MoE专注于视图特定属性，而掩码引导的MoE增强了区域渲染稳定性。此外，还设计了一个掩码预测模块，从运动数据中提取人体掩码，以增强掩码的稳定性和准确性，并在推理过程中实现掩码引导。我们还发布了一个包含2,203个身份的全面人体视频数据集，涵盖了多样的身体手势和详细注释，促进了广泛的泛化能力。代码、数据和预训练模型将被公开用于研究目的。|\n"}, "SSMs": {"2411.03855": "|**2024-11-06**|**MambaPEFT: Exploring Parameter-Efficient Fine-Tuning for Mamba**|Masakazu Yoshimura et.al.|[2411.03855](http://arxiv.org/abs/2411.03855)|null|基于Transformer的模型生态系统通过使用大量数据构建大型模型而建立。参数高效的微调（PEFT）是将这些模型以最小成本部署到下游任务并实现有效性能的关键技术。最近，基于状态空间模型（SSM）的Mamba作为一种可能替代Transformer的模型受到了关注。虽然已经提出了许多大规模的基于Mamba的模型，但如何高效地将预训练的Mamba模型适应于下游任务仍未被充分探索。在本文中，我们对Mamba的PEFT方法进行了探索性分析。我们研究了现有用于Transformer的PEFT方法在应用于Mamba时的有效性，并对这些方法进行了修改以更好地与Mamba架构对齐。此外，我们还提出了新的特定于Mamba的PEFT方法，这些方法利用了Mamba的独特结构。我们的实验表明，对于Mamba而言，PEFT比对Transformer更有效。最后，我们展示了如何有效地结合多种PEFT方法，并提供了一个优于先前工作的框架。为了确保可重复性，我们将在论文发表后公开代码。|\n", "2411.02949": "|**2024-11-05**|**A scalable generative model for dynamical system reconstruction from neuroimaging data**|Eric Volkmann et.al.|[2411.02949](http://arxiv.org/abs/2411.02949)|null|基于观察到的时间序列推断生成动力学的数据驱动方法在机器学习和自然科学中越来越受到关注。在神经科学领域，这些方法有望减轻根据生物物理原理手工构建模型的需求，并能够自动化地推断个体间大脑动力学的差异。最近，在训练专门针对动力系统重建（DSR）的状态空间模型（SSM）的技术方面取得了突破，即使是从较短的时间序列中也能够恢复包括其几何（吸引子）和长期统计不变量在内的基础系统。这些技术基于控制理论的思想，如现代变体的教师强迫（TF），以确保在训练过程中稳定传播损失梯度。然而，目前这些技术并不直接适用于当前观测值依赖于先前状态整个历史的数据模态，这是由于信号过滤特性所导致的，这在神经科学（以及更广泛的生理学）中很常见。突出的例子是功能性磁共振成像（fMRI）中的血氧水平依赖（BOLD）信号或Ca²⁺成像数据。这类信号使得SSM的解码器模型不可逆，而这是以前基于TF的方法所要求的。在这里，我们利用最近在训练SSM的控制技术上的成功，提出了一种新算法来解决这个问题，并且该算法随着模型维度和滤波长度的增加表现出极好的可扩展性。我们展示了它从仅仅短的BOLD时间序列中高效重构动力系统的能力，包括它们的状态空间几何特性和长期时间特性。|\n", "2411.02824": "|**2024-11-05**|**Layer-Adaptive State Pruning for Deep State Space Models**|Minseon Gwak et.al.|[2411.02824](http://arxiv.org/abs/2411.02824)|**[link](https://github.com/msgwak/last)**|**由于缺乏状态维度优化方法，深度状态空间模型（SSM）不得不牺牲模型容量、训练搜索空间或稳定性以缓解由高状态维度引起的计算成本问题。在本工作中，我们为SSM提供了一种结构化剪枝方法——层自适应状态剪枝（LAST），该方法通过扩展单个系统的模态截断来减少每层的状态维度，从而最小化模型级能量损失。LAST评分是通过评估每个状态的子系统$\\mathcal{H}_{\\infty}$范数以及层间能量归一化得到的。这些评分作为全局剪枝标准，使得能够跨层比较状态并进行层自适应剪枝。通过对各种序列基准测试，LAST优化了先前的SSM，揭示了它们状态空间中的冗余性和可压缩性。值得注意的是，我们证明平均剪枝33%的状态后，在不重新训练的情况下，多输入多输出SSM仍能保持性能，准确率仅下降0.52%。代码可在<https://github.com/msgwak/LAST>获取。**|\n", "2411.02217": "|**2024-11-04**|**Recursive Learning of Asymptotic Variational Objectives**|Alessandro Mastrototaro et.al.|[2411.02217](http://arxiv.org/abs/2411.02217)|null|状态空间模型（SSM）在统计机器学习中被广泛应用，是用于序列时间序列数据最经典的生成模型之一。SSM 包含潜在的马尔可夫状态，可以进行变分推断（VI），但像重要性加权自编码器（IWAE）这样的标准 VI 方法缺乏处理流数据的功能。为了在实时接收观测值时在 SSM 中实现在线 VI，我们提出通过使用随机近似方法最大化 IWAE 类型变分下界在渐近对比函数上的表现，而不是标准的 IWAE ELBO。与直接最大化渐近对比函数的递归最大似然方法不同，我们的方法，称为在线序列 IWAE（OSIWAE），允许同时在线学习模型参数和用于推断潜在状态的马尔可夫识别模型。通过使用顺序蒙特卡洛（SMC）方法来逼近滤波状态后验及其导数，我们为 SSM 的在线 VI 创建了一个基于粒子的框架。这种方法比最近提出的在线变分 SMC 方法具有更坚实的理论基础。我们提供了关于学习目标的严格理论结果，并通过数值研究展示了该方法在学习模型参数和粒子提议核方面的有效性。|\n", "2411.01030": "|**2024-11-07**|**Birdie: Advancing State Space Models with Reward-Driven Objectives and Curricula**|Sam Blouir et.al.|[2411.01030](http://arxiv.org/abs/2411.01030)|**[link](https://github.com/samblouir/birdie)**|**高效的状态空间模型（SSM），如线性循环神经网络和线性注意力变体，在计算上比Transformer更具优势，但在需要长范围上下文检索的任务中表现不佳，例如文本复制、关联回忆和长上下文中的问答。之前解决这些挑战的努力主要集中在架构修改上，这往往会重新引入计算效率低下的问题。在本文中，我们提出了一种新的训练程序Birdie，它可以在不改变SSM架构的情况下显著增强其上下文检索能力。我们的方法结合了双向输入处理与通过强化学习优化的动态混合特定预训练目标。我们引入了一种新的双向SSM架构，可以无缝地从双向上下文处理过渡到因果生成。实验评估表明，Birdie在多号码电话簿查找、长段落问答和填充等检索密集型任务上的性能显著提高，缩小了与Transformer之间的性能差距，同时保持了计算效率。我们的研究结果强调了训练程序在利用SSM固定状态容量方面的重要性，为提升其能力提供了新方向。所有代码和预训练模型可在https://www.github.com/samblouir/birdie获取，支持JAX和PyTorch。**|\n", "2411.00233": "|**2024-10-31**|**SambaMixer: State of Health Prediction of Li-ion Batteries using Mamba State Space Models**|José Ignacio Olalde-Verano et.al.|[2411.00233](http://arxiv.org/abs/2411.00233)|**[link](https://github.com/sascha-kirch/samba-mixer)**|**锂离子电池的健康状态（SOH）是一个关键参数，它决定了电池的剩余容量和剩余寿命。在本文中，我们提出了一种名为SambaMixer的新结构化状态空间模型（SSM），用于预测锂离子电池的健康状态。所提出的SSM基于MambaMixer架构设计，该架构旨在处理多变量时间信号。我们在NASA电池放电数据集上评估了我们的模型，并展示了该模型在此数据集上的表现优于现有最先进方法。此外，我们引入了一种新颖的基于锚点的重采样方法，确保时间信号具有预期长度的同时也作为增强技术使用。最后，我们通过位置编码对样本时间和周期时间差进行条件预测，以提高模型性能并学习恢复效应。我们的结果证明，该模型能够以高精度和鲁棒性预测锂离子电池的健康状态。**|\n", "2411.00218": "|**2024-10-31**|**Nudging state-space models for Bayesian filtering under misspecified dynamics**|Fabian Gonzalez et.al.|[2411.00218](http://arxiv.org/abs/2411.00218)|null|推动是一种在数值滤波中处理高维动态系统推理问题的流行算法策略。本文展示了通用的推动技术也可以解决滤波中的另一个关键统计问题，即状态转移模型的错误指定。具体来说，我们依赖于将推动表述为一种增加似然性的通用操作，并从理论上证明了当谨慎应用时，推动技术隐式地定义了具有更高边际似然性的状态空间模型（SSMs），对于给定的（固定的）观测序列而言。这为推动技术作为一种数据驱动的算法修改提供了理论依据，使其能够在动态模型被错误指定的情况下获得鲁棒性模型。为了展示推动的应用，我们在线性高斯SSM和具有错误指定动态特性的随机Lorenz 63模型上进行了数值实验，结果表明推动为这些情况下提供了一种鲁棒的滤波策略。|\n", "2411.00151": "|**2024-10-31**|**NIMBA: Towards Robust and Principled Processing of Point Clouds With SSMs**|Nursena Köprücü et.al.|[2411.00151](http://arxiv.org/abs/2411.00151)|null|Transformer在大规模深度学习任务中占据了主导地位，涵盖了文本、2D和3D视觉等多个领域。然而，其注意力机制的二次复杂度限制了随着序列长度增加时的效率，特别是在高分辨率3D数据（如点云）中的应用。最近，状态空间模型（SSM）如Mamba作为有前景的替代方案出现，提供了线性复杂度、可扩展性和在长序列任务中的高性能。将SSM应用于该领域的关键挑战在于如何调和点云的非顺序结构与像Mamba这样的循环模型固有的方向性（或双向）顺序依赖处理之间的矛盾。为了解决这一问题，之前的研究提出了沿着多个方向或3D空间中的预定路径重新组织点云，并将结果连接成一个单一的一维序列以捕捉不同的视角。在我们的工作中，我们介绍了一种将点云转换为一维序列的方法，这种方法保持了3D空间结构且无需数据复制，使得Mamba的顺序处理能够以几乎不变的方式有效应用。与其他工作相比，我们发现此方法不需要位置嵌入，并允许使用更短的序列长度，同时在ModelNet40和ScanObjectNN数据集上达到了最先进的结果，在准确性和效率方面均超过了基于Transformer的模型。|\n", "2410.23882": "|**2024-10-31**|**In-Context Learned Equalization in Cell-Free Massive MIMO via State-Space Models**|Zihang Song et.al.|[2410.23882](http://arxiv.org/abs/2410.23882)|null|\n", "2410.19382": "|**2024-10-28**|**Multi-Agent Reinforcement Learning with Selective State-Space Models**|Jemma Daniel et.al.|[2410.19382](http://arxiv.org/abs/2410.19382)|null|\n", "2411.04760": "|**2024-11-07**|**Zero-Shot Temporal Resolution Domain Adaptation for Spiking Neural Networks**|Sanja Karilanova et.al.|[2411.04760](http://arxiv.org/abs/2411.04760)|null|脉冲神经网络（SNNs）是一种受生物学启发的深度神经网络，能够高效地提取时间信息，并在部署于神经形态设备时，在能耗和延迟方面展现出显著的优势。然而，SNN模型参数对时间分辨率非常敏感，当边缘端的目标数据的时间分辨率与用于训练的预部署源数据不同时，特别是在边缘端无法进行微调的情况下，会导致性能大幅下降。为了解决这一挑战，我们提出了三种新的领域适应方法，通过调整神经元参数来适应时间分辨率的变化，而无需在目标时间分辨率下重新训练。这些方法基于SNN中的神经元动态与状态空间模型（SSMs）之间的映射关系，并适用于一般的神经元模型。我们在时空数据任务上评估了所提出的方法，包括音频关键词识别数据集SHD和MSWC以及图像分类NMINST数据集。我们的方法提供了一种替代方案，并且在大多数情况下显著优于现有的仅简单缩放时间常数的参考方法。此外，实验结果表明，通过对较低时间分辨率的数据进行时间高效的训练并进行模型适应，可以在高时间分辨率的数据上获得高精度。|\n", "2411.04165": "|**2024-11-06**|**Bio-xLSTM: Generative modeling, representation and in-context learning of biological and chemical sequences**|Niklas Schmidinger et.al.|[2411.04165](http://arxiv.org/abs/2411.04165)|**[link](https://github.com/ml-jku/chem-xlstm)**|**生物和化学序列的语言模型能够支持药物发现、蛋白质工程和精准医疗等关键应用。目前，这些语言模型主要基于Transformer架构。尽管Transformers取得了令人印象深刻的结果，但其运行时间对序列长度的二次依赖性使得它们在处理长基因组序列以及蛋白质和化学序列的上下文学习时变得复杂。最近，循环xLSTM架构在自然语言领域中表现出优于Transformers和现代状态空间模型（SSM）架构的能力。与SSMs类似，xLSTMs对序列长度具有线性运行时间依赖性，并且在推理时允许常数内存解码，这使它们成为建模生物和化学序列中的长距离依赖关系的理想选择。在这项工作中，我们针对这些领域调整了xLSTM，并提出了一套称为Bio-xLSTM的架构变体。在基因组学、蛋白质和化学三个大领域进行了广泛的实验，以评估xLSTM建模生物和化学序列的能力。结果表明，基于Bio-xLSTM的模型a)可以作为DNA、蛋白质和化学序列的有效生成模型，b)能够为这些模式学习丰富的表示，c)能够在蛋白质和小分子上进行上下文学习。**|\n"}, "Communication Intelligence": {"2410.03688": "|**2024-09-21**|**LLM Agents as 6G Orchestrator: A Paradigm for Task-Oriented Physical-Layer Automation**|Zhuoran Xiao et.al.|[2410.03688](http://arxiv.org/abs/2410.03688)|null|生成式预训练模型的快速发展正在推动技术进步从基础应用如聊天机器人向更复杂的基于代理的系统转变。将6G系统与大型语言模型（LLM）代理和数字孪生（DT）结合具有巨大的潜力和必要性，以管理具有新出现特性（如原生AI服务和感知）的高度复杂的通信系统。借助面向6G的代理，基站可以理解各种动态上层任务的传输需求，自动编排最优系统工作流程。通过不断从6G DT获取反馈进行强化，代理最终可以相应地提高实际系统的性能。与现有的为通用应用设计的LLM代理不同，面向6G的代理旨在利用大量额外的专业知识进行高度严谨和精确的规划，这不可避免地需要从模型训练到实施的特定系统设计。本文提出了一种构建面向任务的6G LLM代理的新综合方法。我们首先提出了一种两阶段持续预训练和微调方案，用于构建领域基础模型和多种专业专家模型，以满足各种应用场景的需求。此外，还提出了一种基于语义检索的新推理框架，以利用现有的通信相关功能。物理层任务分解等示例任务的实验结果表明了所提范式的可行性和有效性。|\n"}, "RAG": {"2411.03957": "|**2024-11-06**|**Fine-Grained Guidance for Retrievers: Leveraging LLMs' Feedback in Retrieval-Augmented Generation**|Yuhang Liu et.al.|[2411.03957](http://arxiv.org/abs/2411.03957)|null|检索增强生成（RAG）已被证明是缓解大型语言模型（LLMs）固有幻觉问题的有效方法。以往的方法通常基于语义相似性来训练检索器，缺乏针对RAG的优化。最近的一些工作提出了将检索器与LLM的偏好信号对齐的方法。然而，这些偏好信号往往难以被密集检索器（通常具有较弱的语言能力）理解和有效学习。受指导发现学习等教学理论的启发，我们提出了一种新的框架FiGRet（细粒度引导检索器），该框架利用LLM的语言能力从更细粒度的信息中心视角构建示例，以指导检索器的学习。具体来说，我们的方法利用LLM从检索器表现不佳的样本中构建易于理解的示例，重点关注与RAG场景高度相关的三个学习目标：相关性、全面性和纯净性。这些示例作为支架，最终使检索器与LLM的偏好对齐。此外，我们采用双课程学习策略，并利用LLM和检索器之间的互反馈进一步提高RAG系统的性能。一系列实验表明，我们提出的框架增强了配备不同检索器的RAG系统的性能，并适用于各种LLM。|\n", "2411.03920": "|**2024-11-06**|**RAGulator: Lightweight Out-of-Context Detectors for Grounded Text Generation**|Ian Poey et.al.|[2411.03920](http://arxiv.org/abs/2411.03920)|null|实时检测语境不符的大型语言模型（LLM）输出对于希望安全采用RAG应用程序的企业至关重要。在这项工作中，我们训练轻量级模型来区分从检索到的文本文档中语义上不相关的LLM生成的文本。我们使用最少的资源预处理了摘要和语义文本相似性数据集的组合以构建训练数据。我们发现，在这个流程下，DeBERTa不仅是性能最佳的模型，而且速度快且不需要额外的文本预处理或特征工程。尽管新兴的研究表明，通过微调生成型LLM并将其应用于复杂的数据管道可以达到最先进的性能，但我们注意到速度和资源限制是本地部署的重要考虑因素。|\n", "2411.03572": "|**2024-11-06**|**Advanced RAG Models with Graph Structures: Optimizing Complex Knowledge Reasoning and Text Generation**|Yuxin Dong et.al.|[2411.03572](http://arxiv.org/abs/2411.03572)|null|本研究旨在通过引入图结构来优化现有的检索增强生成模型（RAG），以提高模型处理复杂知识推理任务的性能。传统的RAG模型在面对复杂的图结构信息（如知识图谱、层次关系等）时存在处理效率不足的问题，这影响了生成结果的质量和一致性。本研究提出了一种结合图神经网络（GNN）处理图结构数据的方案，使模型能够捕捉实体间的复杂关系，从而提升生成文本的知识一致性和推理能力。实验使用了自然问题（NQ）数据集，并与多种现有生成模型进行了对比。结果显示，本文提出的基于图的RAG模型在质量、知识一致性和推理能力方面优于传统生成模型，特别是在需要多维度推理的任务中表现更为突出。通过增强检索模块与图神经网络的结合，本研究中的模型能够更好地处理复杂的知识背景信息，在多个实际应用场景中具有广泛的应用潜力。|\n", "2411.03538": "|**2024-11-05**|**Long Context RAG Performance of Large Language Models**|Quinn Leng et.al.|[2411.03538](http://arxiv.org/abs/2411.03538)|null|检索增强生成（RAG）已成为通过整合外部信息来提高大型语言模型（LLMs）准确性的重要技术。随着支持越来越长上下文长度的LLM的出现，人们越来越关注这些模型在RAG场景中的表现。这些新的长上下文模型能否改善RAG的表现？本文对增加上下文长度对20个流行的开源和商业LLM在RAG性能上的影响进行了全面研究。我们在三个特定领域的数据集上运行了RAG工作流程，并将总上下文长度从2,000到128,000个令牌（以及可能的情况下达到200万个令牌）进行变化，报告了关于长上下文在RAG应用中优点与局限性的关键见解。我们的研究发现表明，虽然检索更多文档可以提高性能，但只有少数最新的先进LLM能够在超过64k令牌的长上下文中保持一致的准确性。我们还确定了长上下文情景下的独特失败模式，为未来的研究指出了方向。|\n", "2411.02959": "|**2024-11-05**|**HtmlRAG: HTML is Better Than Plain Text for Modeling Retrieved Knowledge in RAG Systems**|Jiejun Tan et.al.|[2411.02959](http://arxiv.org/abs/2411.02959)|**[link](https://github.com/plageon/HtmlRAG)**|\n", "2411.02937": "|**2024-11-06**|**Benchmarking Multimodal Retrieval Augmented Generation with Dynamic VQA Dataset and Self-adaptive Planning Agent**|Yangning Li et.al.|[2411.02937](http://arxiv.org/abs/2411.02937)|**[link](https://github.com/alibaba-nlp/omnisearch)**|\n", "2411.02850": "|**2024-11-05**|**WASHtsApp -- A RAG-powered WhatsApp Chatbot for supporting rural African clean water access, sanitation and hygiene**|Simon Kloker et.al.|[2411.02850](http://arxiv.org/abs/2411.02850)|null|\n", "2411.02832": "|**2024-11-06**|**PersianRAG: A Retrieval-Augmented Generation System for Persian Language**|Hossein Hosseini et.al.|[2411.02832](http://arxiv.org/abs/2411.02832)|null|\n", "2411.02657": "|**2024-11-04**|**Zebra-Llama: A Context-Aware Large Language Model for Democratizing Rare Disease Knowledge**|Karthik Soman et.al.|[2411.02657](http://arxiv.org/abs/2411.02657)|**[link](https://github.com/karthiksoman/zebra-Llama)**|\n", "2411.02617": "|**2024-11-04**|**TeleOracle: Fine-Tuned Retrieval-Augmented Generation with Long-Context Support for Network**|Nouf Alabbasi et.al.|[2411.02617](http://arxiv.org/abs/2411.02617)|**[link](https://github.com/Nouf-Alabbasi/oKUmura_AI_Telecom_challenge)**|\n", "2411.04952": "|**2024-11-07**|**M3DocRAG: Multi-modal Retrieval is What You Need for Multi-page Multi-document Understanding**|Jaemin Cho et.al.|[2411.04952](http://arxiv.org/abs/2411.04952)|null|文档视觉问答（DocVQA）系统能够从文档中回答问题，具有广泛的应用前景。现有的方法主要集中在使用多模态语言模型（MLMs）处理单页文档，或者依赖基于文本检索增强生成（RAG）的方法，后者使用诸如光学字符识别（OCR）等文本提取工具。然而，在实际应用中这些方法存在一些困难：(a) 问题通常需要跨多个页面或文档的信息，而MLMs难以处理大量长文档；(b) 文档中的重要信息往往以图表等形式存在，但文本提取工具会忽略这些内容。我们提出了M3DocRAG，这是一种新颖的多模态RAG框架，它能够灵活适应各种文档上下文（封闭域和开放域）、问题跳转（单跳和多跳）以及证据模态（文本、图表、图像等）。M3DocRAG通过一个多模态检索器和一个MLM来查找相关文档并回答问题，从而能够高效地处理单个或多个文档，同时保留视觉信息。由于之前的DocVQA数据集仅在特定文档的背景下提问，我们还推出了M3DocVQA，这是一个新的基准测试集，涵盖了超过3000份PDF文档和40000多页的内容，用于评估开放域DocVQA。在三个基准测试（M3DocVQA/MMLongBench-Doc/MP-DocVQA）中，实证结果表明，使用ColPali和Qwen2-VL 7B的M3DocRAG比许多强大的基线方法表现更优，包括在MP-DocVQA上达到了最先进的性能。我们提供了对不同索引、MLMs和检索模型的全面分析。最后，我们定性展示了M3DocRAG能够成功处理各种场景，例如当相关信息存在于多个页面时，以及当答案证据仅存在于图像中时。|\n", "2411.04476": "|**2024-11-07**|**LLM-R: A Framework for Domain-Adaptive Maintenance Scheme Generation Combining Hierarchical Agents and RAG**|Laifa Tao et.al.|[2411.04476](http://arxiv.org/abs/2411.04476)|null|随着智能设备使用的增加，维护在生产活动中的关键作用日益凸显。交互式电子技术手册（IETMs）是支持智能设备维护的重要工具。然而，传统的IETMs面临着从图形用户界面（GUIs）向自然语言用户界面（LUIs）转变以及处理复杂逻辑关系的挑战，同时还需要满足当前对更高智能化的需求。本文提出了一种基于大型语言模型（LLM-R）的维护方案生成方法。该方法包括几个关键创新：我们提出了低秩适应-知识保留（LORA-KR）损失技术，以按比例调整混合维护数据来微调LLM。这种方法防止了由混合数据引起的知识冲突，提高了模型在特定维护领域的适应性和推理能力。此外，还采用了分层任务代理和指令级检索增强生成（RAG）技术，以优化生成步骤并减轻由于模型无法访问上下文信息而产生的幻觉现象。这一改进提高了模型在处理已知或未知维护对象和维护方案场景时的灵活性和准确性。为了验证所提方法在维护任务中的有效性，构建了一个包含不同领域对象的维护方案数据集。实验结果表明，所提方法生成的维护方案准确率达到91.59%，这表明该方法不仅提升了维护方案的智能化水平，还为设备维护引入了新的技术方法。|\n", "2411.04473": "|**2024-11-07**|**ML-Promise: A Multilingual Dataset for Corporate Promise Verification**|Yohei Seki et.al.|[2411.04473](http://arxiv.org/abs/2411.04473)|null|政界人士、企业领袖和公众人物做出的承诺对公众认知、信任和机构声誉有着重大影响。然而，这些承诺的复杂性和数量，加上验证其履行情况的难度，需要创新的方法来评估它们的可信度。本文介绍了承诺验证的概念，这是一种系统性方法，包括识别承诺、评估证据以及确定验证时机等步骤。我们提出了首个多语言数据集ML-Promise，该数据集包含英语、法语、中文、日语和韩语，旨在促进对承诺的深入验证，特别是在环境、社会和治理（ESG）报告的背景下。鉴于对企业环境贡献日益增长的关注，这一数据集解决了评估企业承诺的挑战，尤其是在绿色洗牌等做法盛行的情况下。我们的研究还探讨了基于文本和图像的基线方法，并从检索增强生成（RAG）方法中获得了有希望的结果。这项工作旨在促进关于跨多种语言和领域公共承诺问责制的进一步讨论。|\n", "2411.04459": "|**2024-11-07**|**GPT-Guided Monte Carlo Tree Search for Symbolic Regression in Financial Fraud Detection**|Prashank Kadam et.al.|[2411.04459](http://arxiv.org/abs/2411.04459)|null|随着在线金融服务的不断增加，金融欺诈的发生率也在上升。互联网上的流量和交易率大幅增长，这导致了对快速决策的需求。金融机构还面临着严格的监管要求，这些要求通常需要决策过程的透明性和可解释性。然而，目前行业中广泛使用的最先进算法大多是高度参数化的黑箱模型，依赖于复杂的计算来生成评分。这些算法本质上速度较慢，并且缺乏传统基于规则的学习方法所具有的可解释性和速度。本文介绍了一种称为SR-MCTS（符号回归蒙特卡洛树搜索）的方法，该方法利用基础GPT模型来指导MCTS，显著提高了其收敛速度和生成表达式的质量，这些表达式进一步被提取为规则。我们的实验表明，SR-MCTS在检测欺诈方面比行业内广泛使用的方法更高效，同时提供了关于决策过程的重要见解。|\n", "2411.04341": "|**2024-11-07**|**Enhancing classroom teaching with LLMs and RAG**|Elizabeth A Mullins et.al.|[2411.04341](http://arxiv.org/abs/2411.04341)|null|大型语言模型已成为我们日常查询的宝贵信息来源。然而，经过训练后，其数据源很快就会过时，使得RAG成为提供更近期或相关数据的有用工具。在这项工作中，我们研究了以课程材料作为数据源的RAG管道如何帮助K-12教育中的学生。初步研究使用Reddit作为最新的网络安全信息的数据源。通过评估不同大小的文本块来确定生成准确答案所需的最优上下文量。在对不同大小的文本块进行实验后，使用RAGAs评估答案的正确性，结果表明任何大小的文本块的平均答案正确率都没有超过50%。这表明Reddit不是一个好的数据来源，用于挖掘关于网络安全威胁的问题。该方法成功地评估了数据源的有效性，这对评估教育资源的有效性具有重要意义。|\n", "2411.04284": "|**2024-11-06**|**Enhancing Security Control Production With Generative AI**|Chen Ling et.al.|[2411.04284](http://arxiv.org/abs/2411.04284)|null|安全控制是为基于云的服务设计的机制或策略，旨在降低风险、保护信息并确保符合安全法规。开发安全控制传统上是一个劳动密集型和耗时的过程。本文探讨了使用生成式人工智能来加速安全控制的生成。我们特别关注生成Gherkin代码，这是一种用于以结构化和易理解的格式定义安全控制行为的领域特定语言。通过利用大规模语言模型和上下文学习，我们提出了一种结构化框架，将开发安全控制所需的时间从2-3天减少到不到一分钟。我们的方法整合了详细的任务描述、分步指令和检索增强生成，以提高生成的Gherkin代码的准确性和效率。在AWS云服务上的初步评估显示了有希望的结果，表明生成式AI可以有效地简化安全控制开发过程，从而为基于云的基础设施提供强大且动态的安全保障。|\n"}, "text2sql": {"2411.02948": "|**2024-11-05**|**Grounding Natural Language to SQL Translation with Data-Based Self-Explanations**|Yuankai Fan et.al.|[2411.02948](http://arxiv.org/abs/2411.02948)|**[link](https://github.com/Kaimary/CycleSQL)**|**自然语言数据库接口使非技术用户能够使用自然语言（NL）与数据进行交互。先进的方法通常利用神经序列到序列模型或最近更为复杂的大型语言模型，以端到端的方式实现从自然语言到SQL（NL2SQL）的翻译。然而，就像人类一样，这些端到端的翻译模型可能不会总是在第一次尝试时就生成最佳的SQL输出。在本文中，我们提出了CycleSQL，这是一种迭代框架，旨在让端到端翻译模型通过自我评估自主生成最佳输出。CycleSQL的主要思想是引入基于数据的查询结果的自然语言解释作为自我提供的反馈，并使用该反馈来迭代验证翻译的正确性，从而提高整体翻译准确性。为了研究CycleSQL，我们在五个广泛使用的基准测试上将其应用于七个现有的翻译模型上进行了广泛的实验，包括定量和定性评估。结果表明：1）CycleSQL中引入的反馈循环可以持续改进现有模型的性能，特别是将CycleSQL应用于REDSQL时，在Spider基准测试的验证集上获得了82.0%（+2.6%）的翻译准确率，在测试集上获得了81.6%（+3.2%）的翻译准确率；2）生成的自然语言解释还可以为用户提供有价值的见解，帮助理解翻译结果，从而增强NL2SQL翻译的可解释性。**|\n", "2410.22925": "|**2024-10-30**|**BIS: NL2SQL Service Evaluation Benchmark for Business Intelligence Scenarios**|Bora Caglayan et.al.|[2410.22925](http://arxiv.org/abs/2410.22925)|**[link](https://github.com/boracaglayan/bis-nl2sql)**|**近年来，自然语言到结构化查询语言（NL2SQL）的转换在商业智能（BI）应用中得到了广泛应用。然而，现有的NL2SQL基准并不适用于生产环境中的BI场景，因为它们并不是为常见的商业智能问题设计的。为了解决这一问题，我们开发了一个新的基准，专注于工业BI场景中的典型自然语言问题。我们讨论了构建以BI为重点的基准所面临的挑战以及现有基准的不足之处。此外，我们介绍了我们的基准中反映常见BI查询的问题类别。最后，我们提出了两种新的语义相似性评估指标，用于评估BI应用和服务中的NL2SQL能力。**|\n", "2410.11457": "|**2024-10-15**|**LR-SQL: A Supervised Fine-Tuning Method for Text2SQL Tasks under Low-Resource Scenarios**|Wen Wuzhenghong et.al.|[2410.11457](http://arxiv.org/abs/2410.11457)|**[link](https://github.com/hongwin/lr-sql)**|**大型语言模型通过监督微调在Text2SQL领域带来了革命性的变化，但一个关键的限制被忽视了：数据库的复杂性导致上下文长度增加，从而增加了模型微调时对GPU内存的需求。为了解决这个问题，我们提出了LR-SQL。LR-SQL包括两个监督微调模型：schema_link模型和SQL_generation模型，其中schema_link模型是简化整个过程的关键。在对schema_link模型进行微调时，LR-SQL将完整的数据库分解成可灵活组合的表格，并且数量可调，使模型能够从这些分散的片段中学习整个数据库中的关系。此外，为了增强模型在推理过程中感知各种离散片段之间关系的能力，LR-SQL训练了模型的Chain-of-Thought能力来完成这项任务。实验结果表明，与现有的微调方法相比，LR-SQL可以减少40%的总GPU内存使用量，而仅在schema_link任务中损失2%的表预测准确性。对于整体Text2SQL任务，执行准确率下降了0.6%。我们的项目现在可以在https://github.com/hongWin/LR-SQL上获取。**|\n", "2408.14717": "|**2024-08-27**|**Text2SQL is Not Enough: Unifying AI and Databases with TAG**|Asim Biswal et.al.|[2408.14717](http://arxiv.org/abs/2408.14717)|**[link](https://github.com/tag-research/tag-bench)**|**能够通过自然语言问题访问数据库的人工智能系统有望释放巨大的价值。这类系统允许用户利用语言模型的强大推理和知识能力，以及数据管理系统可扩展的计算能力。这些综合能力使用户能够对自定义数据源提出任意自然语言问题。然而，现有的方法和基准测试未能充分探索这一领域。Text2SQL方法仅关注可以用关系代数表达的自然语言问题，这仅代表了实际用户希望提出的问题的一小部分。同样，检索增强生成（RAG）只考虑可以通过对数据库中一个或少数几个数据记录进行点查询来回答的有限子集查询。我们提出了表增强生成（TAG），这是一种统一且通用的方法，用于回答基于数据库的自然语言问题。TAG模型代表了语言模型与数据库之间以前未被探索过的广泛互动，并为利用语言模型在数据上的世界知识和推理能力创造了令人兴奋的研究机会。我们系统地开发了基准测试来研究TAG问题，并发现标准方法正确回答的查询不超过20%，这证实了该领域需要进一步研究。我们在https://github.com/TAG-Research/TAG-Bench上发布了基准测试代码。**|\n", "2408.05109": "|**2024-11-03**|**A Survey of NL2SQL with Large Language Models: Where are we, and where are we going?**|Xinyu Liu et.al.|[2408.05109](http://arxiv.org/abs/2408.05109)|**[link](https://github.com/hkustdial/nl2sql_handbook)**|**将用户的自然语言查询（NL）转换为SQL查询（即NL2SQL）可以显著降低访问关系数据库的障碍，并支持各种商业应用。随着大型语言模型（LLMs）的出现，NL2SQL的性能得到了极大提升。在这篇综述中，我们全面回顾了由LLMs驱动的NL2SQL技术，涵盖了从以下四个方面看其整个生命周期：(1) 模型：处理不仅包括自然语言的模糊性和欠指定问题，还正确地将自然语言与数据库模式和实例进行映射的NL2SQL翻译技术；(2) 数据：从训练数据的收集、由于训练数据稀缺而进行的数据合成，到NL2SQL基准测试；(3) 评估：使用不同的指标和粒度从多个角度评估NL2SQL方法；以及(4) 错误分析：分析NL2SQL错误以找到根本原因并指导NL2SQL模型的发展。此外，我们提供了开发NL2SQL解决方案的经验法则。最后，我们讨论了在LLMs时代NL2SQL研究面临的挑战和开放问题。**|\n", "2407.21040": "|**2024-07-21**|**Towards Automated Data Sciences with Natural Language and SageCopilot: Practices and Lessons Learned**|Yuan Liao et.al.|[2407.21040](http://arxiv.org/abs/2407.21040)|null|尽管自然语言转SQL（NL2SQL）领域在将自然语言指令转换为可执行的SQL脚本用于数据查询和处理方面取得了显著进展，但在更广泛的数据科学流程中实现全面自动化——包括数据查询、分析、可视化和报告——仍然是一个复杂的挑战。本研究介绍了一种先进的工业级系统SageCopilot，该系统通过整合大规模语言模型（LLMs）、自主代理（AutoAgents）和语言用户界面（LUIs），实现了数据科学流程的自动化。具体来说，SageCopilot采用了一个两阶段设计：在线组件通过上下文学习（ICL）细化用户的输入成为可执行脚本，并运行这些脚本来生成结果报告与可视化；离线组件则准备在线阶段ICL所需的演示示例。一系列流行策略如思维链和提示调优被用来增强SageCopilot的性能。经过严格的测试和与基于提示解决方案的对比分析，SageCopilot已在生成或执行脚本以及提供带有可视化的结果方面实证证明了其卓越的端到端性能，这得到了真实世界数据集的支持。我们的深入消融研究表明了SageCopilot所使用各种组件和策略对数据科学端到端正确性的个别贡献。|\n", "2406.07913": "|**2024-06-12**|**DeTriever: Decoder-representation-based Retriever for Improving NL2SQL In-Context Learning**|Yuxi Feng et.al.|[2406.07913](http://arxiv.org/abs/2406.07913)|null|虽然上下文学习（ICL）已被证明是提高大型语言模型（LLMs）在多种复杂任务中表现的有效技术，特别是在将自然语言问题转换为结构化查询语言（NL2SQL）方面，但如何选择最有益的示例仍然是一个开放的研究问题。尽管先前的工作经常采用现成的编码器来动态检索示例，但外部检索器和LLM之间在表示能力上存在固有的差异。此外，优化示例的选择是一个非平凡的任务，因为没有直接的方法可以在不进行两两推理的情况下评估示例之间的相对收益。为了解决这些问题，我们提出了DeTriever，这是一种新颖的演示检索框架，它学习LLM隐藏状态的加权组合，在其中编码了丰富的语义信息。为了训练模型，我们提出了一种代理分数，该分数基于输出查询之间的相似性来估计示例之间的相对收益。在两个流行的NL2SQL基准上的实验表明，我们的方法在一击式NL2SQL任务上显著优于最先进的基线。|\n", "2406.01265": "|**2024-07-27**|**The Dawn of Natural Language to SQL: Are We Fully Ready?**|Boyan Li et.al.|[2406.01265](http://arxiv.org/abs/2406.01265)|**[link](https://github.com/hkustdial/nl2sql360)**|**将用户的自然语言问题转换为SQL查询（即NL2SQL）显著降低了访问关系数据库的门槛。大型语言模型的出现为NL2SQL任务引入了新的范式，极大地提升了能力。然而，这引发了一个关键问题：我们是否已经完全准备好在生产环境中部署NL2SQL模型？为了解决这个问题，我们提出了一个多角度的NL2SQL评估框架NL2SQL360，以帮助研究人员设计和测试新的NL2SQL方法。通过NL2SQL360，我们对领先的NL2SQL方法在一系列应用场景中进行了详细比较，例如不同的数据领域和SQL特性，提供了有价值的见解，以帮助选择最适合特定需求的NL2SQL方法。此外，我们探索了NL2SQL设计空间，利用NL2SQL360自动化识别符合用户特定需求的最佳NL2SQL解决方案。具体来说，NL2SQL360确定了一种有效的NL2SQL方法SuperSQL，在使用执行准确度指标的情况下，在Spdier数据集中表现出色。值得注意的是，SuperSQL在Spider和BIRD测试集上分别达到了87%和62.66%的竞争性执行准确度。**|\n", "2405.00527": "|**2024-05-01**|**ChatBI: Towards Natural Language to Complex Business Intelligence SQL**|Jinqing Lian et.al.|[2405.00527](http://arxiv.org/abs/2405.00527)|null|自然语言到SQL（NL2SQL）技术为不熟悉数据库的非专家用户提供了一个使用SQL进行数据分析的机会。将自然语言转换为商业智能（NL2BI）是实际生产系统中NL2SQL的一个流行应用场景。与NL2SQL相比，NL2BI引入了更多挑战。在本文中，我们提出了ChatBI，这是一种全面而高效的技术，用于解决NL2BI任务。首先，我们分析了交互模式，这是NL2SQL和NL2BI在使用上一个重要的不同模块，并设计了一个更小且成本更低的模型来匹配这种交互模式。在BI场景中，表格包含大量的列，这使得依赖大型语言模型（LLMs）进行模式链接的现有NL2SQL方法由于令牌限制而无法继续。此外，BI场景中模糊列的比例较高也增加了模式链接的难度。ChatBI结合了数据库社区现有的视图技术，首先将模式链接问题分解为单个视图选择问题，然后使用一个更小且成本更低的机器学习模型来选择具有显著减少列数的单一视图。接着，将这个单一视图中的列作为模式链接所需的列传递给LLM。最后，ChatBI提出了一种与现有流程不同的分阶段处理流程，使ChatBI能够更准确地生成包含复杂语义和比较关系的SQL。我们已在百度的数据平台上部署了ChatBI，并将其集成到多条产品线中进行了大规模的生产任务评估。所获得的结果突显了其在实用性、通用性和效率方面的优越性。同时，在我们的真实BI场景数据表和查询下，与当前主流的NL2SQL技术相比，它也取得了最佳结果。|\n", "2403.20014": "|**2024-03-29**|**PURPLE: Making a Large Language Model a Better SQL Writer**|Tonghui Ren et.al.|[2403.20014](http://arxiv.org/abs/2403.20014)|null|\n", "2407.15186": "|**2024-11-07**|**A Survey on Employing Large Language Models for Text-to-SQL Tasks**|Liang Shi et.al.|[2407.15186](http://arxiv.org/abs/2407.15186)|null|随着关系数据库中数据量的不断增加以及编写SQL查询所需的专业知识，用户在访问和分析数据时面临着挑战。Text-to-SQL（Text2SQL）通过利用自然语言处理（NLP）技术将自然语言转换为SQL查询来解决这些问题。随着大型语言模型（LLMs）的发展，一系列基于LLM的Text2SQL方法应运而生。本综述全面回顾了LLMs在Text2SQL任务中的应用。我们回顾了基准数据集、提示工程方法、微调方法以及基于LLM的Text2SQL方法的基础模型。我们在每个部分提供了见解，并讨论了该领域的未来方向。|\n"}, "AIOps": {}, "PPC": {"2411.04112": "|**2024-11-06**|**Fed-EC: Bandwidth-Efficient Clustering-Based Federated Learning For Autonomous Visual Robot Navigation**|Shreya Gummadi et.al.|[2411.04112](http://arxiv.org/abs/2411.04112)|null|集中式学习要求数据在中央服务器上进行聚合，这在数据隐私和带宽消耗方面带来了重大挑战。联邦学习提供了一种有吸引力的替代方案，但传统的联邦学习方法在机器人中的应用旨在学习一个适用于所有机器人的单一全局模型。然而，在实践中，一个模型可能并不适合部署在各种环境中的机器人。本文提出了Federated-EmbedCluster（Fed-EC），这是一种基于聚类的联邦学习框架，应用于视觉自主机器人在多样化户外环境中的导航。该框架解决了由于现实世界中机器人之间存在非独立同分布数据而导致单一全局模型性能下降的关键联邦学习挑战。大量的实际实验验证了Fed-EC能够将每个机器人的通信量减少23倍，同时在目标导向导航任务上的表现与集中式学习相当，并且优于本地学习。Fed-EC还可以将先前学到的模型转移到新加入集群的机器人上。|\n", "2411.04002": "|**2024-11-06**|**Federated mixed effects logistic regression based on one-time shared summary statistics**|Marie Analiz April Limpoco et.al.|[2411.04002](http://arxiv.org/abs/2411.04002)|**[link](https://github.com/lizlimpocouhasselt/Mixed-effects-logistic-regression-from-summary-statistics)**|**在医学研究中，维护数据隐私已成为获取个体层面患者数据的主要障碍。这使得估计涉及多个数据提供者（如医院）的混合效应二元逻辑回归模型变得更加困难。联邦学习作为一种选择出现，可以在保护个体观察隐私的同时估计一个可以被解释为个体层面的全局模型，但它通常涉及数据提供者和数据分析人员之间的迭代通信。在本文中，我们提出了一种策略来估计混合效应二元逻辑回归模型，该策略只需要数据提供者一次性共享汇总统计数据。它包括生成伪数据，这些伪数据的汇总统计与实际数据相匹配，并使用这些伪数据代替不可用的实际数据进行模型估计过程。我们的策略能够包含多个预测变量，这些预测变量可以是连续变量和分类变量的组合。通过模拟，我们展示了我们的方法至少能像需要汇集个体观测值的方法一样好地估计真实模型。我们还提供了一个使用真实数据的示例说明。与典型的联邦学习算法不同，我们的方法消除了基础设施要求和安全问题，同时提高了通信效率并考虑了异质性。**|\n", "2411.03996": "|**2024-11-06**|**Towards Resource-Efficient Federated Learning in Industrial IoT for Multivariate Time Series Analysis**|Alexandros Gkillas et.al.|[2411.03996](http://arxiv.org/abs/2411.03996)|null|异常和缺失数据在工业应用中构成了一个棘手的问题。近年来，基于深度学习的异常检测成为一个重要的研究方向，但其检测精度的提高是通过使用大型神经网络实现的，这增加了存储和计算成本。此外，边缘设备收集的数据包含用户隐私，引入了可以通过隐私保护的分布式范式——联邦学习（FL）成功解决的挑战。这种框架允许边缘设备训练和交换模型，但也增加了通信成本。因此，为了应对FL基于深度学习的异常检测中增加的通信、处理和存储挑战，预期神经网络剪枝可以显著减少处理、存储和通信复杂性。为此，在FL范式的服务器端提出了一个新的基于压缩的优化问题，该问题融合了接收到的本地模型广播并执行剪枝，生成一个更压缩的模型。在异常检测和缺失值填补的实验表明，所提出的FL场景以及基于压缩的方法能够实现高压缩率（超过99.7%），与集中式解决方案相比性能损失可忽略不计（小于1.18%）。|\n", "2411.03926": "|**2024-11-06**|**Act in Collusion: A Persistent Distributed Multi-Target Backdoor in Federated Learning**|Tao Liu et.al.|[2411.03926](http://arxiv.org/abs/2411.03926)|null|联邦学习是一种旨在保护数据隐私的新范式，但由于其分布式特性，容易受到后门攻击。当前的研究通常基于单一攻击者和单一后门设计攻击，忽视了联邦学习中更现实和复杂的威胁。我们提出了一种更实际的联邦学习威胁模型：分布式多目标后门。在这种模型中，多个攻击者控制不同的客户端，嵌入各种触发器并针对不同类别，通过中央聚合协作地将后门植入全局模型。实验证明现有的方法难以在全局模型中保持多个后门的有效性。我们的关键见解是，类似的后门触发器会导致参数冲突，注入新的后门会扰乱梯度方向，从而显著削弱某些后门的性能。为了解决这个问题，我们提出了一种分布式多目标后门攻击（DMBA），确保来自不同恶意客户端的后门的效率和持久性。为了避免参数冲突，我们设计了一种多通道分散频率触发策略，以最大化触发器之间的差异。为了减轻梯度干扰，我们在本地训练中引入了后门重放，以中和冲突的梯度。广泛的验证表明，在攻击后的30轮内，来自不同客户端的三种不同后门的攻击成功率保持在93%以上。代码将在审稿期结束后公开发布。|\n", "2411.03861": "|**2024-11-06**|**FedRISE: Rating Induced Sign Election of Gradients for Byzantine Tolerant Federated Aggregation**|Joseph Geo Benjamin et.al.|[2411.03861](http://arxiv.org/abs/2411.03861)|null|在联邦学习中，最常用的防御模型中毒的策略之一是采用一种鲁棒的聚合机制，以提高训练的韧性。许多现有的拜占庭鲁棒聚合器提供了理论保证，并在某些类别的攻击下被证明是有效的。然而，我们观察到某些高强度的攻击可以颠覆聚合器并导致训练崩溃。此外，大多数聚合器需要确定容错设置才能收敛。当拜占庭节点接近多数时，攻击的影响变得更加明显，如果攻击者全知全能并且能够访问数据、诚实更新和聚合方法，那么规避攻击变得更加困难。基于这些观察，我们开发了一种名为FedRISE的鲁棒聚合器，用于跨孤岛联邦学习，该聚合器具有一致性且不易受到全知攻击者的中毒更新影响。所提出的方法通过使用方差减少的稀疏梯度，明确地通过符号投票策略确定每个梯度的最佳方向。我们认为基于原始梯度的余弦相似性的投票权重是误导性的，并引入了一种基于符号的梯度估值函数，该函数忽略梯度的幅度。我们在3个数据集和架构上将我们的方法与8种鲁棒聚合器在6种中毒攻击下进行了比较。结果表明，在严重情况下，现有鲁棒聚合器至少在某些攻击下会崩溃，而由于严格的梯度包含公式，FedRISE表现出更好的鲁棒性。|\n", "2411.03799": "|**2024-11-06**|**Overcoming label shift in targeted federated learning**|Edvin Listo Zec et.al.|[2411.03799](http://arxiv.org/abs/2411.03799)|null|联邦学习使多个参与者能够在不共享私有数据的情况下协作训练模型，这为将机器学习扩展到各种应用提供了潜力。现有的用于此任务的算法在客户端和预期目标域具有相同的特征和标签分布时是合理的，但这一假设在现实场景中经常被违反。一种常见的违规情况是标签偏移，即标签分布在客户端之间或客户端与目标域之间存在差异，这会显著降低模型性能。为了解决这个问题，我们提出了一种新的模型聚合方案FedPALS，它通过利用中央服务器上目标标签分布的知识来适应标签偏移。我们的方法确保了在随机梯度下降下无偏更新，从而保证了跨具有多样化、标签偏移数据的客户端的鲁棒泛化。广泛的图像分类实验表明，FedPALS通过将模型聚合与目标域对齐，始终优于标准基线。我们的研究发现，传统的联邦学习方法在极端客户端稀疏性情况下表现严重不佳，突显了目标感知聚合的关键需求。FedPALS提供了一种有原则且实用的解决方案，以减轻标签分布不匹配的问题，确保在联邦设置中训练的模型能够有效泛化到标签偏移的目标域。|\n", "2411.03746": "|**2024-11-06**|**Optimal Defenses Against Gradient Reconstruction Attacks**|Yuxiao Chen et.al.|[2411.03746](http://arxiv.org/abs/2411.03746)|**[link](https://github.com/cyx78/optimal_defenses_against_gradient_reconstruction_attacks)**|\n", "2411.03730": "|**2024-11-06**|**NeurIPS 2023 Competition: Privacy Preserving Federated Learning Document VQA**|Marlon Tobaben et.al.|[2411.03730](http://arxiv.org/abs/2411.03730)|null|\n", "2411.03636": "|**2024-11-06**|**Domain Generalization for Cross-Receiver Radio Frequency Fingerprint Identification**|Ying Zhang et.al.|[2411.03636](http://arxiv.org/abs/2411.03636)|null|\n", "2411.03569": "|**2024-11-06**|**Towards Personalized Federated Learning via Comprehensive Knowledge Distillation**|Pengju Wang et.al.|[2411.03569](http://arxiv.org/abs/2411.03569)|null|\n", "2411.04936": "|**2024-11-07**|**Fed-LDR: Federated Local Data-infused Graph Creation with Node-centric Model Refinement**|Jiechao Gao et.al.|[2411.04936](http://arxiv.org/abs/2411.04936)|null|全球城市化进程的加速带来了提升城市基础设施和服务的新挑战。时空数据，即整合了空间和时间维度的数据，已成为理解和促进城市可持续发展的关键工具。在此背景下，联邦学习（FL）作为一种分布式学习范式，符合城市物联网环境中的隐私要求而受到重视。然而，将传统机器学习模型和深度学习模型集成到联邦学习框架中面临着重大挑战，特别是在捕捉复杂的时空依赖关系和适应多样化的城市条件方面。为了解决这些挑战，我们提出了联邦本地数据注入图创建与节点中心模型精炼（Fed-LDR）算法。Fed-LDR利用联邦学习和图卷积网络（GCN）来增强城市环境中的时空数据分析能力。该算法包含两个关键模块：(1) 本地数据注入图创建（LDIGC）模块，通过动态重构邻接矩阵来反映城市环境中不断变化的空间关系；(2) 节点中心模型精炼（NoMoR）模块，针对单个城市节点定制模型参数以适应异质性。在PeMSD4和PeMSD8数据集上的评估表明，Fed-LDR在六个基准方法中表现最优。Fed-LDR在这两个数据集上分别达到了最低的平均绝对误差（MAE）值20.15和17.30，以及最低的均方根误差（RMSE）值32.30和27.15，并且在两个数据集中保持了高达0.96的相关系数。值得注意的是，在PeMSD4数据集上，与表现最好的基线FedMedian相比，Fed-LDR将MAE和RMSE分别降低了81%和78%。|\n", "2411.04692": "|**2024-11-07**|**Personalized Federated Learning for Cross-view Geo-localization**|Christos Anagnostopoulos et.al.|[2411.04692](http://arxiv.org/abs/2411.04692)|null|本文提出了一种结合联邦学习（FL）和跨视图图像地理定位（CVGL）技术的方法。我们通过提出一种个性化的联邦学习场景来解决自动驾驶环境中数据隐私和异质性的挑战，该场景允许有选择地共享模型参数。我们的方法采用从粗到细的策略，客户端仅共享粗略特征提取器，而将细粒度特征保留在本地环境中。我们使用KITTI数据集结合卫星图像对我们的方法进行了评估。结果表明，与传统的集中式训练相比，我们的联邦CVGL方法在保持数据隐私的同时达到了相近的性能。所提出的部分模型共享策略与经典联邦学习相比具有相当或略优的性能，并显著减少了通信开销而不牺牲准确性。我们的工作为在多样化环境中运行的自动驾驶车辆提供了更稳健且保护隐私的定位系统。|\n", "2411.04509": "|**2024-11-07**|**FedDP: Privacy-preserving method based on federated learning for histopathology image segmentation**|Liangrui Pan et.al.|[2411.04509](http://arxiv.org/abs/2411.04509)|null|苏木精和伊红（H&E）染色的全切片图像（WSIs）被认为是病理学家和医疗从业者进行肿瘤诊断、手术规划和术后评估的金标准。随着深度学习技术的迅速发展，基于卷积神经网络和变压器模型的各种模型已被应用于WSIs的精确分割。然而，由于隐私法规和保护患者隐私的需求，图像数据的集中存储和处理是不切实际的。在医疗环境中直接训练一个集中的模型因这些隐私问题而变得非常具有挑战性。本文通过采用联邦学习框架来解决医学图像数据分散性和隐私敏感性的问题，允许医疗机构在保护患者隐私的同时进行协作学习。此外，为了应对联邦学习训练过程中通过梯度反转重建原始数据的问题，差分隐私通过向模型更新中引入噪声，防止攻击者推断出单个样本的贡献，从而保护训练数据的隐私。实验结果表明，所提出的方法FedDP在几乎不影响模型准确性的同时有效保护了癌症病理图像数据的隐私，在Dice、Jaccard和Acc指数上仅分别降低了0.55%、0.63%和0.42%。这种方法促进了跨机构合作与知识共享，同时保护了敏感数据隐私，为医学领域的进一步研究和应用提供了一个可行的解决方案。|\n", "2411.04159": "|**2024-11-06**|**Cooperation and Personalization on a Seesaw: Choice-based FL for Safe Cooperation in Wireless Networks**|Han Zhang et.al.|[2411.04159](http://arxiv.org/abs/2411.04159)|null|联邦学习（FL）是一种创新的分布式人工智能（AI）技术，已被用于医疗保健、市场营销和金融等不同领域的跨学科研究。然而，FL在无线网络中的应用仍处于起步阶段。在这项工作中，我们首先概述了将FL应用于无线网络的好处和关注点。接着，我们通过分析现有个性化FL框架中合作与个性化之间的关系，提供了新的视角。此外，我们讨论了通过选择性方法调整合作水平的可能性。我们的选择性FL方法是一个灵活且安全的FL框架，允许参与者在感到不安全或无法从合作中获益时降低合作程度。通过这种方式，选择性FL框架旨在解决FL中的安全性和公平性问题，并保护参与者免受恶意攻击。|\n"}}